
var status = -1;
var text;
var sel;
var rmb;
var aaa ="#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
//"#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";

// 每个礼包所需的充值金额
var condition = new Array(10, 50, 100, 300, 500, 1000, 2000, 3500, 5000,8000,10000,15000);
var reward = new Array(// 礼包编号、道具id、数量
					// 礼包1
					Array(1, 5073000, 10), // 心脏高级喇叭*10
					Array(1, 5390006, 3), //咆哮老虎情景喇叭*3

					// 礼包2
					Array(2, 5064000, 20), // 防暴卷20
					Array(2, 2340000, 20), // 祝福卷20
					Array(2, 2049116, 10), // 强化混沌10
					Array(2, 5073000, 10), // 心脏高级喇叭*10
					Array(2, 5390006, 10), // 咆哮老虎情景喇叭10

					// 礼包3
					Array(3, 5062002, 40),	//高级神奇魔方*40
                    Array(3, 5064000, 20),//防爆卷轴*20
					Array(3, 2340000, 20),//祝福卷轴*20
					Array(3, 5062500, 40),//大师附加神奇魔方*40
					Array(3, 2049116, 15), // 强化混沌15
					Array(3, 5073000, 20), // 心脏高级喇叭20
                    Array(3, 1112915, 1),//蓝调戒指*1
					Array(3, 5390006, 20), // 咆哮老虎情景喇叭*20
					Array(3, 3010118, 1),//糖果音符椅子

					// 礼包4
				        Array(4, 5062002, 80), // 高级魔方80	
					Array(4, 5062500, 40), // 大师附加神奇魔方40
					Array(4, 5064000, 30),//防爆卷轴*30
					Array(4, 4310036, 100),//征服者币
					Array(4, 2049116, 10), //强化混沌 
					Array(4, 2340000, 30), //祝福卷30 
					Array(4, 2049137, 5), //惊人正义混沌卷轴*5
					Array(4, 5390006, 30),	//咆哮老虎情景喇叭*30
					Array(4, 5390018, 10), //赤兔喇叭10
					Array(4, 3010416, 1), // 巨无霸白雪人椅子

					// 礼包5
			        Array(5, 5062002, 80), // 高级魔方80
					Array(5, 5062500, 80),//大师附加神奇魔方*80
					Array(5, 5064000, 30), // 防暴30
					Array(5, 3010831, 1), // 海王星椅子
					Array(5, 4310036, 200), // 征服币
					Array(5, 2340000, 30), //祝福卷轴*30
					Array(5, 2049137, 10), // 惊人正义混沌卷轴*10
                    Array(5, 2049750, 2),//S级潜能卷轴*2
                    Array(5, 2048306, 2),//特殊附加潜能附加古卷*2
					Array(5, 5390004, 50), //新年喇叭50
					Array(5, 5390018, 50), //赤兔喇叭50
					
					// 礼包6
					Array(6, 2049750, 2), // S级潜能卷轴*3
					Array(6, 2049405, 1), // 真·觉醒冒险之心专用潜能力卷轴*1
					Array(6, 5062002, 150), // 高级魔方150
					Array(6, 5062500, 150), //大师附加魔方150
					Array(6, 5064000, 80), // 防暴80
					Array(6, 2049116, 30), // 强化混沌30
					Array(6, 3010417, 1), //巨无霸企鹅王*1
					Array(6, 2048306, 3), // 特殊附加潜能附加古卷*3 
					Array(6, 2340000, 80), // 祝福卷80
					Array(6, 2049137, 15), // 惊人正义混沌卷轴*15
					Array(6, 5390004, 100), // 新年喇叭100
					Array(6, 5390018, 100), //赤兔喇叭100
					
					// 礼包7
					Array(7, 3991014, 50),
					Array(7, 2431991, 2), // 冒险心秘密箱子*2
					//Array(7, 2041818, 2), // 惊人的双手武器攻击卷轴*2
					//Array(7, 2046996, 2), // 惊人的单手武器攻击卷轴*2
					//Array(7, 2046997, 2), // 惊人的单手武器魔力卷轴*2
					Array(7, 5062002, 150), // 高级魔方150
					Array(7, 5062500, 150), // 大师附加150
					Array(7, 2049116, 50), // 强化混沌 50
					Array(7, 2049750, 5), // S级潜能80%
                    Array(7, 2049405, 3),//真·觉醒冒险之心专用潜能力卷轴*3
                    Array(7, 2048306, 5),//特殊附加潜能附加古卷*5
					Array(7, 2340000, 80), // 祝福80
					Array(7, 5064000, 100), // 防暴100
					Array(7, 5062009, 150), //超级神奇魔方*150
					Array(7, 2049137, 50), // 惊人正义混沌卷轴*50
					Array(7, 5390004, 150), // 新年庆祝喇叭*150
					Array(7, 5390018, 150), //赤兔喇叭150
					Array(7,3010850, 1), // 潮流评论家椅子
					Array(7, 3010670, 1), //绝对指环椅子
					
					// 礼包8
					Array(8, 3991014, 100),//中介币
					Array(8, 2431991, 3),//冒险心秘密箱子*3
					//Array(8, 2041818, 5), // 惊人的双手武器攻击卷轴*5
					//Array(8, 2046996, 5), // 惊人的单手武器攻击卷轴*5
					//Array(8, 2046997, 5), // 惊人的单手武器魔力卷轴*5
					Array(8, 2049405, 5), //真觉冒险之心专用潜能卷5
					Array(8, 2431989, 1), // 法弗纳武器箱子*1
					Array(8, 5062009, 200), //超级神奇魔方*200
					Array(8, 5390004, 200), // 新年庆祝喇叭*200
					Array(8, 2049750, 8), //S级潜能卷轴*8
					Array(8, 5062002, 200), //高级神奇魔方*200
					Array(8, 5062500, 200), //大师附加神奇魔方*200
					Array(8, 5064000, 120), //防暴120
					Array(8, 2340000, 120), // 祝福
					Array(8, 2049116, 40), // 强化混沌
					Array(8, 2048306, 8), //特殊附加潜能附加古卷*8
					Array(8, 2049137, 50), // 惊人正义混沌卷轴*50
					Array(8, 5390018, 200), // 赤兔马喇叭200
					Array(8, 3010423, 1), // 蘑菇椅子
					Array(8, 1142796, 1), // 官方认证男神
					Array(8, 3010832, 1), // 太阳椅子

					// 礼包9
					Array(9, 3991014, 150),
					Array(9, 2049323, 10),//无损高级装备强化卷轴10
					Array(9, 5530457, 5), // 专属饰品攻击卷
					Array(9, 5530458, 5), // 专属饰品魔力卷
					//Array(9, 2041818, 5), // 惊人的双手武器攻击卷轴*5
					//Array(9, 2046996, 5), // 惊人的单手武器攻击卷轴*5
					//Array(9, 2046997, 5), // 惊人的单手武器魔力卷轴*5 
					Array(9, 2432069, 1), // 暴君箱子
					Array(9, 2049405, 3), //冒险心潜能卷
					Array(9, 5062002, 200), // 高级魔方
					Array(9, 5062500, 200), // 大师附加
					Array(9, 5064000, 150), // 防暴
					Array(9, 2340000, 150),// 祝福
					Array(9, 4310036, 5000), // 征服币
					Array(9, 2049137, 50),// 惊人正义混沌卷轴*50
					Array(9, 1182016, 1), //黄金比德曼徽章
					Array(9, 2049116, 60), //强混60
					Array(9, 5062009, 200), //超级魔方
					Array(9, 5390004, 200), // 新年庆祝喇叭*200
					Array(9, 2049750, 15), //S级潜能卷轴*15
					Array(9, 2048306, 10), //特殊附加潜能附加古卷*10
					Array(9, 5390018, 200),//赤兔喇叭
					Array(9, 1672017, 1), //极真锂心脏*1
					Array(9, 3010195, 1), // 无价之宝椅子
					Array(9, 3010206, 1), // 梦想画家椅子
					Array(9, 3010660, 1), //梦幻公主城堡椅子


					// 礼包10
					Array(10, 3991014, 300),
					//Array(10, 2041818, 5), // 惊人的双手武器攻击卷轴*5
					//Array(10, 2046996, 5), // 惊人的单手武器攻击卷轴*5
					//Array(10, 2046997, 5), // 惊人的单手武器魔力卷轴*5
					Array(10, 1142788, 1), // 进击巨人勋章
					Array(10, 2432069, 2), // 暴君箱子
					Array(10, 2049405, 10), //冒险心潜能卷10
					Array(10, 5062002, 200), // 高级魔方
					Array(10, 5062500, 200), // 大师附加
					Array(10, 5064000, 200), // 防暴
					Array(10, 2340000, 200),// 祝福
					Array(10, 3012022, 1), // 小火车椅子
					Array(10, 3010696, 1), // 大黄鸭椅子
					Array(10, 2049116, 80), // 强混100
					Array(10, 4310036, 8000),// 征服币
					Array(10, 5530457, 5), //专属饰品攻击
					Array(10, 5530458, 5), //专属饰品魔力
					Array(10, 2049137, 80),// 惊人正义
					Array(10, 2049323, 30),//无损高级装备强化卷轴30 
					Array(10, 5390004, 200), // 新年庆祝喇叭*200
					Array(10, 2049750, 30), //S级潜能卷轴*30
					Array(10, 2048306, 10), //特殊附加潜能附加古卷*10
					Array(10, 5390018, 200),//赤兔喇叭200

					//11
					Array(11, 3991014, 600),
					Array(11, 3010936, 1), //青蛙跳楼椅子
					Array(11, 1152156, 1),//逆转金属护肩
					Array(11, 1012439, 1),//凯梅尔兹文身
					Array(11, 1022212, 1),//凯梅尔兹眼镜
					Array(11, 1032225, 1),//凯梅尔兹耳环
					Array(11, 1122272, 1),//凯梅尔兹吊坠
					Array(11, 1132248, 1),//凯梅尔兹腰带
					Array(11, 1142662, 1),//凯梅尔兹市民
					Array(11, 2432069, 3), // 暴君箱子
					Array(11, 2049405, 10), //冒险心潜能卷10
					Array(11, 5062002, 200), // 高级魔方
					Array(11, 5062500, 200), // 大师附加
					Array(11, 5064000, 200), // 防暴
					Array(11, 2340000, 200),// 祝福
					Array(11, 2049137, 80),// 惊人正义
					Array(11, 2049750, 50), //S级潜能卷轴*50
					Array(11, 2048306, 15), //特殊附加潜能附加古卷*15
					Array(11, 2049323, 30),//无损高级装备强化卷轴30
					//Array(11, 2041818, 5), // 惊人的双手武器攻击卷轴*5
					//Array(11, 2046996, 5), // 惊人的单手武器攻击卷轴*5
					//Array(11, 2046997, 5), // 惊人的单手武器魔力卷轴*5
					Array(11, 1142593, 1), // 13个星星勋章

                    // 礼包12
					Array(12, 3991014, 1000),
					Array(12, 1142742, 1), //冒险岛奖杯
					Array(12, 2432069, 3), // 暴君箱子3
					Array(12, 1152124, 1),//冒险岛强韧意志黑色肩膀装饰
					Array(12, 1032201, 1),//超越证明耳环
					Array(12, 1122259, 1),//超越证明吊坠
					Array(12, 1012414, 1),//超越证明脸饰
				    Array(12, 1022195, 1),//超越证明眼饰
			        Array(12, 1113056, 1),//超越证明戒指
                    Array(12, 3015002, 1),//七彩摩天轮
					Array(12, 2432069, 5), // 暴君箱子
					Array(12, 2049405, 10), //冒险心潜能卷10
					Array(12, 5062002, 200), // 高级魔方
					Array(12, 5062500, 200), // 大师附加
					Array(12, 5064000, 200), // 防暴
					Array(12, 2340000, 200),// 祝福
					Array(12, 2049137, 80),// 惊人正义
					Array(12, 2049323, 100),//无损高级装备强化卷轴100
					//Array(12, 2041818, 10), // 惊人的双手武器攻击卷轴*10
					//Array(12, 2046996, 10), // 惊人的单手武器攻击卷轴*10
					//Array(12, 2046997, 10), // 惊人的单手武器魔力卷轴*10
					Array(12, 5390004, 200), // 新年庆祝喇叭*200
					Array(12, 2049750, 100), //S级潜能卷轴*100
					Array(12, 2048306, 30), //特殊附加潜能附加古卷*30
					Array(12, 5390018, 200)//赤兔喇叭
					);
function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0)
	{
		cm.dispose();
		return;
	}
	if (mode == 1)
	{
		status++;
	} else {
		status--;
	}

	rmb = cm.getRMB();
	var curlevel = -1;

	if (status == 0) {
		text = head + "您累计充值金额为： #r" + rmb + "#k 元\r\n\r\n";
		for (var i = 1; i <= condition.length; i++) {
			text += "#b#L" + i + "#"+aaa+" 累计充值 #r" + condition[i-1] + " #b元奖励";
			if (cm.getBossLogAcc("累计充值礼包" + i) == -1) {
				text += "(已领取)";
				curlevel = curlevel == -1 ? i : curlevel;
			}
			text += "#l\r\n";
		}
		text += "#k";
		cm.sendSimple(text);
	} else if (status == 1) {
		sel = selection;
		text = head + "#e#r- 累计充值" + condition[selection - 1] + "元奖励 -#k#n\r\n\r\n";
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == selection) {
				text += "#i" + reward[i][1] + "# #z" + reward[i][1] + "#[" + reward[i][2] + "个]\r\n";
			}
		}
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (cm.getBossLogAcc("累计充值礼包" + sel) == -1) {
			cm.sendOk(head + "这个礼包您已经领取过了");
			cm.dispose();
			return;
		}
		if (rmb < condition[sel-1]) {
			cm.sendOk("累计充值金额不足，无法领取。");
			cm.dispose();
			return;
		}
		var rewardlist = new Array();
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == sel) {
				if (reward[i][3]==null)
					reward[i][3]=-1;
				rewardlist.push(new Array(reward[i][1], reward[i][2], reward[i][3]));
			}
		}
		if (!cm.canHoldSlots(rewardlist.length)) {
			cm.sendOk(head + "包裹空间不足，请确保包裹每个栏位有至少 " + rewardlist.length + " 格空间");
			cm.dispose();
			return;
		}
		for (var i = 0; i < rewardlist.length; i++) {
			if (rewardlist[i][0]==2430865) {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1], rewardlist[i][2]);
			} else {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1]);
			}
		}
		cm.setBossLogAcc("累计充值礼包" + sel, -2);
		cm.playerMessage(1, "领取成功！");
		cm.channelMessage(0x18, "『累计充值奖励』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了累计充值 " + condition[sel-1] + " 元奖励。");
		cm.dispose();
	}
}