/* 技能册 */

var status = -1;
var itemList = Array(
Array(2290245, 200),//
//Array(2290723, 200),//
Array(2290724, 200),//
Array(2290868, 200),//
Array(2290869, 200),//
Array(2290870, 200),//
Array(2290871, 200),//
Array(2290872, 200),//
Array(2290873, 200),//
Array(2290874, 200),//
Array(2290875, 200),//
Array(2290876, 200),//
Array(2290877, 200),//
Array(2290878, 200),//
Array(2290879, 200),//
Array(2290880, 200),//
Array(2290881, 200),//
Array(2290882, 200),//
Array(2290883, 200),//
Array(2290884, 200),//
Array(2290885, 200),//
Array(2290886, 200),//
Array(2290887, 200),//
Array(2290888, 200),//
Array(2290889, 200),//
Array(2290890, 200),//
Array(2290891, 200),//
Array(2291137, 200),//
Array(2290915, 200),//
Array(2290893, 200),//
Array(2290016, 300), // 葵花宝典 20
Array(2290018, 300), // 神圣冲击 20
Array(2290020, 300), //  圣域 20
Array(2290024, 300), // 神秘瞄准术20
Array(2290025, 300), // 神秘瞄准术30
Array(2290026, 300), // 创世之破 20
Array(2290027, 300), // 创世之破 30
Array(2290028, 300), // 终极无限 20
Array(2290029, 300), // 终极无限 30
Array(2290030, 300), // 美杜莎之眼 20
Array(2290031, 300), // 美杜莎之眼 30
Array(2290032, 300), // 链环闪电 20
Array(2290033, 300), // 链环闪电 30
Array(2290034, 300), // 进阶祝福20
Array(2290036, 300), // 迷雾爆发20
Array(2290037, 300), // 迷雾爆发30
Array(2290038, 300), // 火魔兽 20
Array(2290039, 300), // 火魔兽 30
Array(2290040, 300), // 天降落星 20
Array(2290041, 300), // 天降落星 30
Array(2290044, 300), // 冰破魔兽 20
Array(2290045, 300), // 冰破魔兽 30
Array(2290046, 300), // 落霜冰破 20
Array(2290047, 300), // 落霜冰破 30
Array(2290048, 300), // 圣光普照 20
Array(2290049, 300), // 圣光普照 30
Array(2290050, 300), // 光芒飞箭 20
Array(2290051, 300), // 光芒飞箭 30
Array(2290052, 300), // 火眼晶晶20
Array(2290056, 300), // 神箭手 20
Array(2290058, 300), // 幻影步20
Array(2290059, 300), // 幻影步30
Array(2290064, 300), // 进阶终极攻击20
Array(2290066, 300), // 神弩手 20
Array(2290067, 300), // 神弩手 30
Array(2290074, 300), // 一击要害箭 20
Array(2290075, 300), // 一击要害箭 30
Array(2290076, 300), // 假动作 20
Array(2290077, 300), // 假动作 30
Array(2290090, 300), // 一出双击20
Array(2290094, 300), // 烟雾弹 20
Array(2290095, 300), // 烟雾弹 30
Array(2290097, 300), // 潜龙出渊 20
Array(2290098, 300), // 潜龙出渊 30
Array(2290108, 300), // 极速领域 20
Array(2290117, 300), // 金属风暴 20
Array(2290118, 300), // 金属风暴 30
Array(2290126, 300), // 战神之舞 20
Array(2290127, 300), // 战神之舞 30
Array(2290128, 300), // 攻击策略 20
Array(2290132, 300), // 巨熊咆哮 20
Array(2290133, 300), // 巨熊咆哮 30
Array(2290134, 300), // 防守策略 20
Array(2290136, 300), // 钻石星辰 20
Array(2290137, 300), // 钻石星辰 30
Array(2290138, 300), // 战神之盾 20
Array(2290139, 300), // 战神之盾 30
Array(2290140, 300), // 魔龙分身 20
Array(2290141, 300), // 魔龙分身 30
Array(2290142, 300), // 火焰轮 20
Array(2290143, 300), // 火焰轮 30
Array(2290144, 300), // 魔法精通 20
Array(2290145, 300), // 魔法精通 30
Array(2290146, 300), // 熊熊烈火 20
Array(2290147, 300), // 熊熊烈火 30
Array(2290148, 300), // 黑暗迷雾 20
Array(2290149, 300), // 黑暗迷雾 30
Array(2290150, 300), // 灵魂之石 20
Array(2290151, 300), // 玛瑙的祝福 20
Array(2290152, 300), // 玛瑙的祝福 25
Array(2290153, 300), // 双刀风暴 20
Array(2290155, 300), // 镜像分身 20
Array(2290156, 300), // 暗影飞跃斩 20
Array(2290159, 300), // 暴怒刀阵 30
Array(2290160, 300), // 傀儡召唤 30
Array(2290161, 300), // 荆棘 20
Array(2290230, 300), // 致命冲击 20
Array(2290231, 300), // 致命冲击 30
Array(2290232, 300), // 飓风 20
Array(2290233, 300), // 飓风 30
Array(2290234, 300), // 黑暗创世 20
Array(2290235, 300), // 黑暗创世 30
Array(2290236, 300), // 避难所 20
Array(2290238, 300), // 辅助打猎单元 20
Array(2290239, 300), // 辅助打猎单元 30
Array(2290240, 300), // 奥义箭乱舞 20
Array(2290241, 300), // 奥义箭乱舞 30
Array(2290242, 300), // 音速震波 20
Array(2290243, 300), // 音速震波 30
Array(2290275, 300), // 战争机器：泰坦 20
Array(2290276, 300), // 战争机器：泰坦 30
Array(2290277, 300), // 金属机甲：导弹战车 20
Array(2290278, 300), // 金属机甲：导弹战车 30
Array(2290279, 300), // 机器人工厂：RM1 20
Array(2290280, 300), // 机器人工厂：RM1 30
Array(2290281, 300), // 放大器：AF-11 20
Array(2290282, 300), // 激光爆破 20
Array(2290283, 300), // 激光爆破 30
Array(2290284, 300), // 卫星防护 20
Array(2290290, 300), // 进阶终极攻击20
Array(2290292, 300), // 黑暗穿刺20
Array(2290293, 300), // 黑暗穿刺30
Array(2290322, 300), // 加农火箭炮20
Array(2290323, 300), // 加农火箭炮30
Array(2290324, 300), // 诺特勒斯战舰20
Array(2290325, 300), // 诺特勒斯战舰30
Array(2290326, 300), // 海盗精神20
Array(2290327, 300), // 海盗精神30
Array(2290329, 300), // 超级猴子魔法20
Array(2290330, 300), // 超级猴子魔法20
Array(2290331, 300), // 集中炮击20
Array(2290332, 300), // 集中炮击30
Array(2290333, 300), // 极限燃烧弹20
Array(2290334, 300), // 极限燃烧弹30
Array(2290340, 300), // 伊师塔之环 20
Array(2290342, 300), // 传说之矛 20
Array(2290343, 300), // 闪电刀刃 20
Array(2290344, 300), // 闪电刀刃 30
Array(2290345, 300), // 古老意志 20
Array(2290347, 300), // 双弩枪专家 20
Array(2290349, 300), // 防御突破 20
Array(2290354, 300), // 恶魔爆炸 20
Array(2290355, 300), // 恶魔爆炸 30
Array(2290356, 300), // 恶魔冲击波 20
Array(2290357, 300), // 恶魔冲击波 30
Array(2290361, 300), // 黑暗变形 20
Array(2290363, 300), // 黑暗束缚 20
Array(2290364, 300), // 进阶精准武器 20
Array(2290366, 300), // 皮肤硬化 20
Array(2290367, 300), // 皮肤硬化 30
Array(2290656, 300), // 闪电反击 20
Array(2290657, 300), // 闪电反击 30
Array(2290658, 300), // 晨星坠落 20
Array(2290659, 300), // 晨星坠落 30
Array(2290660, 300), // 启示录 20
Array(2290661, 300), // 启示录 30
Array(2290662, 300), // 绝对死亡 20
Array(2290663, 300), // 绝对死亡 30
Array(2290664, 300), // 黑暗高潮 20
Array(2290665, 300), // 黑暗高潮 30
Array(2290666, 300), // 黑暗巫术 20
Array(2290667, 300), // 黑暗巫术 30
Array(2290668, 300), // 魔法精通 20
Array(2290669, 300), // 魔法精通 30
Array(2290739, 300), // 怒雷屠龙斩 20
Array(2290741, 300), // 天空剑影 20
Array(2290742, 300), // 天空剑影 30
Array(2290743, 300), // 进阶剑刃之壁 20
Array(2290745, 300), // 无敌之勇 20
Array(2290746, 300), // 无敌之勇 30
Array(2290747, 300), // 进阶精准剑 20
Array(2290751, 300), // 强健护甲 20
Array(2290752, 300), // 剑气突袭 20
Array(2290753, 300), // 恶魔之息 20
Array(2290763, 300), // 原始之吼 20
Array(2290764, 300), // 原始之吼 30
Array(2290765, 300), // 三位一体 20
Array(2290766, 300), // 三位一体 30
Array(2290767, 300), // 大地冲击波 20
Array(2290768, 300), // 大地冲击波 30
Array(2290769, 300), // 灵魂共鸣 20
Array(2290770, 300), // 灵魂共鸣 30
Array(2290771, 300), // 灵魂凝视 20
Array(2290772, 300), // 灵魂凝视 30
Array(2290773, 300), // 灵魂手铳手 20
Array(2290774, 300), // 灵魂手铳手 30
Array(2290775, 300), // 亲和Ⅳ 20
Array(2290776, 300), // 亲和Ⅳ 30
Array(2290894, 300), // 超越：处决 20
Array(2290895, 300), // 超越：处决 30
Array(2290896, 300), // 追击盾 20
Array(2290897, 300), // 追击盾 30
Array(2290898, 300), // 破甲 20
Array(2290899, 300), // 破甲 30
Array(2290900, 300), // 血腥禁锢 20
Array(2290901, 300), // 惊天之力 20
Array(2290902, 300), // 惊天之力 30
Array(2290903, 300), // 防御专精 20
Array(2290905, 300), // 进阶亡命剑精通 20
Array(2290907, 300), // 强化超越 20
Array(2290916, 300), // 刀锋之舞 20
Array(2290918, 300), // 聚能脉冲炮 20
Array(2290919, 300), // 聚能脉冲炮 30
Array(2290920, 300), // 全息力场 20
Array(2290921, 300), // 全息力场 30
Array(2290922, 300), // 神秘代码 20
Array(2290924, 300), // 攻击矩阵 20
Array(2290925, 300), // 攻击矩阵 30
Array(2290926, 300), // 瞬间闪避 20
Array(2290927, 300), // 瞬间闪避 30
Array(2290928, 300), // 尖兵专家 20
Array(2290635, 300), // 连射 20
Array(2290636, 300), // 连射 30
Array(2290378, 300), // 进阶终极攻击20
Array(2291022, 300), // 长杖专家 20
Array(2291023, 300), // 长杖专家 30
Array(2290411, 300), // 进阶终极攻击30
Array(2290412, 300), // 暗器专家 20
Array(2290414, 300), // 突然袭击 20
Array(2290416, 300), // 四连镖 20
Array(2290418, 300), // 黑暗祝福 20
Array(2290420, 300), // 模糊领域 20
Array(2290421, 300), // 模糊领域 30
Array(2290422, 300), // 突然袭击 20
Array(2290423, 300), // 突然袭击 30
Array(2290424, 300), // 短刀专家 20
Array(2290426, 300), // 侠盗本能 20
Array(2290427, 300), // 重装碾压 20
Array(2290428, 300), // 诺特勒斯战舰 20
Array(2290429, 300), // 诺特勒斯战舰 30
Array(2290430, 300), //  能量爆炸 20
Array(2290431, 300), // 能量爆炸 30
Array(2290432, 300), // 蛇拳 20
Array(2290433, 300), // 蛇拳 30
Array(2290434, 300), // 激怒拳 20
Array(2290435, 300), // 激怒拳 30
Array(2290436, 300), // 船长的威严 20
Array(2290437, 300), // 船长的威严 30
Array(2290438, 300), // 海盗气魄 20
Array(2290439, 300), // 齐射 20
Array(2290440, 300), // 齐射 30
Array(2290441, 300), // 爆头 20
Array(2290442, 300), // 爆头 30
Array(2290443, 300), // 诺特勒斯战舰 20
Array(2290444, 300), // 诺特勒斯战舰 30
Array(2290512, 300), // 蓝光连击 20
Array(2290514, 300), // 幻影印技天赋 20
Array(2290517, 300), // 圣歌祈祷 20
Array(2290519, 300), // 卡片风暴 20
Array(2290521, 300), // 手杖专家 20
Array(2290523, 300), // 灵魂偷取 20
Array(2290589, 300), // 进阶精准剑20
Array(2290591, 300), // 进阶灵魂盾 20
Array(2290593, 300), // 灵魂之怒 20
Array(2290594, 300), // 灵魂之怒 30
Array(2290595, 300), // 灵魂抨击 20
Array(2290596, 300), // 灵魂抨击 30
Array(2290597, 300), // 闪耀爆炸 20
Array(2290598, 300), // 闪耀爆炸 30
Array(2290599, 300), // 终极打击 20
Array(2290690, 300), // 暴怒对战 30
Array(2291025, 300), // 稳如泰山 20
Array(2291027, 300), // 烈焰冲斩 20
Array(2291028, 300), // 烈焰冲斩 30
Array(2291029, 300), // 虚空元素 20
Array(2291030, 300), // 虚空元素 30
Array(2291031, 300), // 守护之神 20
Array(2291032, 300), // 圣骑士专家 20
Array(2291033, 300), // 圣骑士专家 30
Array(2291034, 300), // 神枪降临 20
Array(2291036, 300), // 龙之献祭 20
Array(2291038, 300), // 重生契约 20
Array(2291040, 300), // 进阶精准武器 20
Array(2291042, 300), // 炙焰笼罩 20
Array(2291043, 300), // 炙焰笼罩 30
Array(2291044, 300), // 极冻吐息 20
Array(2291045, 300), // 极冻吐息 30
Array(2291046, 300), // 寒霜爆晶 20
Array(2291047, 300), // 寒霜爆晶 30
Array(2291048, 300), // 箭矢炮盘 20
Array(2291050, 300), // 骤雨箭矢 20
Array(2291051, 300), // 骤雨箭矢 30
Array(2291052, 300), // 防甲穿透 20
Array(2291054, 300), // 神箭幻影 20
Array(2291055, 300), // 神箭幻影 30
Array(2291056, 300), // 穿透箭 20
Array(2291057, 300), // 穿透箭 30
Array(2291058, 300), // 弱点捕捉 20
Array(2291059, 300), // 突然袭击 20
Array(2291060, 300), // 突然袭击 30
Array(2291061, 300), // 决战之巅 20
Array(2291062, 300), // 暗杀 20
Array(2291064, 300), // 终极斩 20
Array(2291066, 300), // 幽灵一击 20
Array(2291068, 300), // 进阶狂蛮撞击 20
Array(2291069, 300), // 进阶神剑陨落 20
Array(2291070, 300), // 进阶旋卷切割 20
Array(2291071, 300), // 进阶圆月旋风 20
Array(2291072, 300), // 进阶狂转回旋 20
Array(2291073, 300), // 进阶狂转回旋 30
Array(2291074, 300), // 进阶旋跃斩 20
Array(2291075, 300), // 进阶旋跃斩 30
Array(2291076, 300), // 进阶地裂山崩 20
Array(2291077, 300), // 进阶地裂山崩 30
Array(2291078, 300), // 进阶暴风旋涡 20
Array(2291079, 300), // 进阶暴风旋涡 30
Array(2291112, 300), // 进阶圆月旋风 30
Array(2291116, 300), // 爆流拳 20
Array(2291117, 300), // 爆流拳 30
Array(2291118, 300), // 鬼斩 20
Array(2291119, 300), // 鬼斩 30
Array(2291120, 300), // 四魂刻印 20
Array(2291121, 300), // 分魂斩 20
Array(2291122, 300), // 火狐灵 20
Array(2291123, 300), // 火狐灵 30
Array(2291124, 300), // 精灵凝聚第4招 20
Array(2291125, 300), // 精灵凝聚第4招 30
Array(2291126, 300), // 高级拳甲修炼 20
Array(2291127, 300), // 高级拳甲修炼 30
Array(2291128, 300), // 洞察之眼 20
Array(2291138, 300), // 暴风箭雨 20
Array(2291139, 300), // 暴风箭雨 30
Array(2291141, 300), // 磁性船锚 20
Array(2291144, 300), // 暮光祝福 20
Array(2291145, 300), // 暮光祝福 30
Array(2291147, 300), // 弹仓扩展 20
Array(2291149, 300), // 弹仓扩展 30
Array(2291152, 300) // 血腥禁锢 30
);
var selectedItem = -1;
var selectedCost = -1;
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#g-----#r管理提示：雪花只能兑换部分技能书,不是全部哦#k#g-----#k\r\n\r\n#e#b亲爱的#r#h ##k#b您好 \t#k#b当前可用雪花币 #r" + cm.getPlayerPoints() + " #k#b个 \r\n\r\n请选择您希望购买的技能册：#k#e#n";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k #b需要 #r" + itemList[i][1] + " #k#b雪花币#k#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1];
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 雪花币\r\n附加 100万 冒险币？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getMeso() >= 1000000 && cm.getPlayerPoints() >= selectedCost) {
            if (cm.gachaponItem != -1) {
		cm.gainItem(selectedItem,1);
                cm.gainMeso(-1000000);
		cm.gainPlayerPoints(-selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
                cm.worldSpouseMessage(0x25, "『雪花币书店』 : " + cm.getChar().getName() + " 使用 【雪花币】，成功购买技能书#k.");

            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多雪花币或冒险币。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k \r\n需要 #r" + selectedCost + "#k 雪花币 附加 100万 冒险币。");
        }
        cm.dispose();
    }
}