/* 技能册 */

var status = -1;
var itemList = Array(
Array(2290245, 500),//
//Array(2290723, 500),//
Array(2290724, 500),//
Array(2290868, 500),//
Array(2290869, 500),//
Array(2290870, 500),//
Array(2290871, 500),//
Array(2290872, 500),//
Array(2290873, 500),//
Array(2290874, 500),//
Array(2290875, 500),//
Array(2290876, 500),//
Array(2290877, 500),//
Array(2290878, 500),//
Array(2290879, 500),//
Array(2290880, 500),//
Array(2290881, 500),//
Array(2290882, 500),//
Array(2290883, 500),//
Array(2290884, 500),//
Array(2290885, 500),//
Array(2290886, 500),//
Array(2290887, 500),//
Array(2290888, 500),//
Array(2290889, 500),//
Array(2290890, 500),//
Array(2290891, 500),//
Array(2291137, 500),//
Array(2290915, 500),//
Array(2290893, 500)//


/*Array(2290016, 420), // 葵花宝典 20
Array(2290018, 420), // 神圣冲击 20
Array(2290020, 420), //  圣域 20
Array(2290024, 420), // 神秘瞄准术20
Array(2290025, 420), // 神秘瞄准术30
Array(2290026, 420), // 创世之破 20
Array(2290027, 420), // 创世之破 30
Array(2290028, 420), // 终极无限 20
Array(2290029, 420), // 终极无限 30
Array(2290030, 420), // 美杜莎之眼 20
Array(2290031, 420), // 美杜莎之眼 30
Array(2290032, 420), // 链环闪电 20
Array(2290033, 420), // 链环闪电 30
Array(2290034, 420), // 进阶祝福20
Array(2290036, 420), // 迷雾爆发20
Array(2290037, 420), // 迷雾爆发30
Array(2290038, 420), // 火魔兽 20
Array(2290039, 420), // 火魔兽 30
Array(2290040, 420), // 天降落星 20
Array(2290041, 420), // 天降落星 30
Array(2290044, 420), // 冰破魔兽 20
Array(2290045, 420), // 冰破魔兽 30
Array(2290046, 420), // 落霜冰破 20
Array(2290047, 420), // 落霜冰破 30
Array(2290048, 420), // 圣光普照 20
Array(2290049, 420), // 圣光普照 30
Array(2290050, 420), // 光芒飞箭 20
Array(2290051, 420), // 光芒飞箭 30
Array(2290052, 420), // 火眼晶晶20
Array(2290056, 420), // 神箭手 20
Array(2290058, 420), // 幻影步20
Array(2290059, 420), // 幻影步30
Array(2290064, 420), // 进阶终极攻击20
Array(2290066, 420), // 神弩手 20
Array(2290067, 420), // 神弩手 30
Array(2290074, 420), // 一击要害箭 20
Array(2290075, 420), // 一击要害箭 30
Array(2290076, 420), // 假动作 20
Array(2290077, 420), // 假动作 30
Array(2290090, 420), // 一出双击20
Array(2290094, 420), // 烟雾弹 20
Array(2290095, 420), // 烟雾弹 30
Array(2290097, 420), // 潜龙出渊 20
Array(2290098, 420), // 潜龙出渊 30
Array(2290108, 420), // 极速领域 20
Array(2290117, 420), // 金属风暴 20
Array(2290118, 420), // 金属风暴 30
Array(2290126, 420), // 战神之舞 20
Array(2290127, 420), // 战神之舞 30
Array(2290128, 420), // 攻击策略 20
Array(2290132, 420), // 巨熊咆哮 20
Array(2290133, 420), // 巨熊咆哮 30
Array(2290134, 420), // 防守策略 20
Array(2290136, 420), // 钻石星辰 20
Array(2290137, 420), // 钻石星辰 30
Array(2290138, 420), // 战神之盾 20
Array(2290139, 420), // 战神之盾 30
Array(2290140, 420), // 魔龙分身 20
Array(2290141, 420), // 魔龙分身 30
Array(2290142, 420), // 火焰轮 20
Array(2290143, 420), // 火焰轮 30
Array(2290144, 420), // 魔法精通 20
Array(2290145, 420), // 魔法精通 30
Array(2290146, 420), // 熊熊烈火 20
Array(2290147, 420), // 熊熊烈火 30
Array(2290148, 420), // 黑暗迷雾 20
Array(2290149, 420), // 黑暗迷雾 30
Array(2290150, 420), // 灵魂之石 20
Array(2290151, 420), // 玛瑙的祝福 20
Array(2290152, 420), // 玛瑙的祝福 25
Array(2290153, 420), // 双刀风暴 20
Array(2290155, 420), // 镜像分身 20
Array(2290156, 420), // 暗影飞跃斩 20
Array(2290159, 420), // 暴怒刀阵 30
Array(2290160, 420), // 傀儡召唤 30
Array(2290161, 420), // 荆棘 20
Array(2290230, 420), // 致命冲击 20
Array(2290231, 420), // 致命冲击 30
Array(2290232, 420), // 飓风 20
Array(2290233, 420), // 飓风 30
Array(2290234, 420), // 黑暗创世 20
Array(2290235, 420), // 黑暗创世 30
Array(2290236, 420), // 避难所 20
Array(2290238, 420), // 辅助打猎单元 20
Array(2290239, 420), // 辅助打猎单元 30
Array(2290240, 420), // 奥义箭乱舞 20
Array(2290241, 420), // 奥义箭乱舞 30
Array(2290242, 420), // 音速震波 20
Array(2290243, 420), // 音速震波 30
Array(2290275, 420), // 战争机器：泰坦 20
Array(2290276, 420), // 战争机器：泰坦 30
Array(2290277, 420), // 金属机甲：导弹战车 20
Array(2290278, 420), // 金属机甲：导弹战车 30
Array(2290279, 420), // 机器人工厂：RM1 20
Array(2290280, 420), // 机器人工厂：RM1 30
Array(2290281, 420), // 放大器：AF-11 20
Array(2290282, 420), // 激光爆破 20
Array(2290283, 420), // 激光爆破 30
Array(2290284, 420), // 卫星防护 20
Array(2290290, 420), // 进阶终极攻击20
Array(2290292, 420), // 黑暗穿刺20
Array(2290293, 420), // 黑暗穿刺30
Array(2290322, 420), // 加农火箭炮20
Array(2290323, 420), // 加农火箭炮30
Array(2290324, 420), // 诺特勒斯战舰20
Array(2290325, 420), // 诺特勒斯战舰30
Array(2290326, 420), // 海盗精神20
Array(2290327, 420), // 海盗精神30
Array(2290329, 420), // 超级猴子魔法20
Array(2290330, 420), // 超级猴子魔法20
Array(2290331, 420), // 集中炮击20
Array(2290332, 420), // 集中炮击30
Array(2290333, 420), // 极限燃烧弹20
Array(2290334, 420), // 极限燃烧弹30
Array(2290340, 420), // 伊师塔之环 20
Array(2290342, 420), // 传说之矛 20
Array(2290343, 420), // 闪电刀刃 20
Array(2290344, 420), // 闪电刀刃 30
Array(2290345, 420), // 古老意志 20
Array(2290347, 420), // 双弩枪专家 20
Array(2290349, 420), // 防御突破 20
Array(2290354, 420), // 恶魔爆炸 20
Array(2290355, 420), // 恶魔爆炸 30
Array(2290356, 420), // 恶魔冲击波 20
Array(2290357, 420), // 恶魔冲击波 30
Array(2290361, 420), // 黑暗变形 20
Array(2290363, 420), // 黑暗束缚 20
Array(2290364, 420), // 进阶精准武器 20
Array(2290366, 420), // 皮肤硬化 20
Array(2290367, 420), // 皮肤硬化 30
Array(2290656, 420), // 闪电反击 20
Array(2290657, 420), // 闪电反击 30
Array(2290658, 420), // 晨星坠落 20
Array(2290659, 420), // 晨星坠落 30
Array(2290660, 420), // 启示录 20
Array(2290661, 420), // 启示录 30
Array(2290662, 420), // 绝对死亡 20
Array(2290663, 420), // 绝对死亡 30
Array(2290664, 420), // 黑暗高潮 20
Array(2290665, 420), // 黑暗高潮 30
Array(2290666, 420), // 黑暗巫术 20
Array(2290667, 420), // 黑暗巫术 30
Array(2290668, 420), // 魔法精通 20
Array(2290669, 420), // 魔法精通 30
Array(2290739, 420), // 怒雷屠龙斩 20
Array(2290741, 420), // 天空剑影 20
Array(2290742, 420), // 天空剑影 30
Array(2290743, 420), // 进阶剑刃之壁 20
Array(2290745, 420), // 无敌之勇 20
Array(2290746, 420), // 无敌之勇 30
Array(2290747, 420), // 进阶精准剑 20
Array(2290751, 420), // 强健护甲 20
Array(2290752, 420), // 剑气突袭 20
Array(2290753, 420), // 恶魔之息 20
Array(2290763, 420), // 原始之吼 20
Array(2290764, 420), // 原始之吼 30
Array(2290765, 420), // 三位一体 20
Array(2290766, 420), // 三位一体 30
Array(2290767, 420), // 大地冲击波 20
Array(2290768, 420), // 大地冲击波 30
Array(2290769, 420), // 灵魂共鸣 20
Array(2290770, 420), // 灵魂共鸣 30
Array(2290771, 420), // 灵魂凝视 20
Array(2290772, 420), // 灵魂凝视 30
Array(2290773, 420), // 灵魂手铳手 20
Array(2290774, 420), // 灵魂手铳手 30
Array(2290775, 420), // 亲和Ⅳ 20
Array(2290776, 420), // 亲和Ⅳ 30
Array(2290894, 420), // 超越：处决 20
Array(2290895, 420), // 超越：处决 30
Array(2290896, 420), // 追击盾 20
Array(2290897, 420), // 追击盾 30
Array(2290898, 420), // 破甲 20
Array(2290899, 420), // 破甲 30
Array(2290900, 420), // 血腥禁锢 20
Array(2290901, 420), // 惊天之力 20
Array(2290902, 420), // 惊天之力 30
Array(2290903, 420), // 防御专精 20
Array(2290905, 420), // 进阶亡命剑精通 20
Array(2290907, 420), // 强化超越 20
Array(2290916, 420), // 刀锋之舞 20
Array(2290918, 420), // 聚能脉冲炮 20
Array(2290919, 420), // 聚能脉冲炮 30
Array(2290920, 420), // 全息力场 20
Array(2290921, 420), // 全息力场 30
Array(2290922, 420), // 神秘代码 20
Array(2290924, 420), // 攻击矩阵 20
Array(2290925, 420), // 攻击矩阵 30
Array(2290926, 420), // 瞬间闪避 20
Array(2290927, 420), // 瞬间闪避 30
Array(2290928, 420), // 尖兵专家 20
Array(2290635, 420), // 连射 20
Array(2290636, 420), // 连射 30
Array(2290378, 420), // 进阶终极攻击20
Array(2291022, 420), // 长杖专家 20
Array(2291023, 420), // 长杖专家 30
Array(2290411, 420), // 进阶终极攻击30
Array(2290412, 420), // 暗器专家 20
Array(2290414, 420), // 突然袭击 20
Array(2290416, 420), // 四连镖 20
Array(2290418, 420), // 黑暗祝福 20
Array(2290420, 420), // 模糊领域 20
Array(2290421, 420), // 模糊领域 30
Array(2290422, 420), // 突然袭击 20
Array(2290423, 420), // 突然袭击 30
Array(2290424, 420), // 短刀专家 20
Array(2290426, 420), // 侠盗本能 20
Array(2290427, 420), // 重装碾压 20
Array(2290428, 420), // 诺特勒斯战舰 20
Array(2290429, 420), // 诺特勒斯战舰 30
Array(2290430, 420), //  能量爆炸 20
Array(2290431, 420), // 能量爆炸 30
Array(2290432, 420), // 蛇拳 20
Array(2290433, 420), // 蛇拳 30
Array(2290434, 420), // 激怒拳 20
Array(2290435, 420), // 激怒拳 30
Array(2290436, 420), // 船长的威严 20
Array(2290437, 420), // 船长的威严 30
Array(2290438, 420), // 海盗气魄 20
Array(2290439, 420), // 齐射 20
Array(2290440, 420), // 齐射 30
Array(2290441, 420), // 爆头 20
Array(2290442, 420), // 爆头 30
Array(2290443, 420), // 诺特勒斯战舰 20
Array(2290444, 420), // 诺特勒斯战舰 30
Array(2290512, 420), // 蓝光连击 20
Array(2290514, 420), // 幻影印技天赋 20
Array(2290517, 420), // 圣歌祈祷 20
Array(2290519, 420), // 卡片风暴 20
Array(2290521, 420), // 手杖专家 20
Array(2290523, 420), // 灵魂偷取 20
Array(2290589, 420), // 进阶精准剑20
Array(2290591, 420), // 进阶灵魂盾 20
Array(2290593, 420), // 灵魂之怒 20
Array(2290594, 420), // 灵魂之怒 30
Array(2290595, 420), // 灵魂抨击 20
Array(2290596, 420), // 灵魂抨击 30
Array(2290597, 420), // 闪耀爆炸 20
Array(2290598, 420), // 闪耀爆炸 30
Array(2290599, 420), // 终极打击 20
Array(2290690, 420), // 暴怒对战 30
Array(2291025, 420), // 稳如泰山 20
Array(2291027, 420), // 烈焰冲斩 20
Array(2291028, 420), // 烈焰冲斩 30
Array(2291029, 420), // 虚空元素 20
Array(2291030, 420), // 虚空元素 30
Array(2291031, 420), // 守护之神 20
Array(2291032, 420), // 圣骑士专家 20
Array(2291033, 420), // 圣骑士专家 30
Array(2291034, 420), // 神枪降临 20
Array(2291036, 420), // 龙之献祭 20
Array(2291038, 420), // 重生契约 20
Array(2291040, 420), // 进阶精准武器 20
Array(2291042, 420), // 炙焰笼罩 20
Array(2291043, 420), // 炙焰笼罩 30
Array(2291044, 420), // 极冻吐息 20
Array(2291045, 420), // 极冻吐息 30
Array(2291046, 420), // 寒霜爆晶 20
Array(2291047, 420), // 寒霜爆晶 30
Array(2291048, 420), // 箭矢炮盘 20
Array(2291050, 420), // 骤雨箭矢 20
Array(2291051, 420), // 骤雨箭矢 30
Array(2291052, 420), // 防甲穿透 20
Array(2291054, 420), // 神箭幻影 20
Array(2291055, 420), // 神箭幻影 30
Array(2291056, 420), // 穿透箭 20
Array(2291057, 420), // 穿透箭 30
Array(2291058, 420), // 弱点捕捉 20
Array(2291059, 420), // 突然袭击 20
Array(2291060, 420), // 突然袭击 30
Array(2291061, 420), // 决战之巅 20
Array(2291062, 420), // 暗杀 20
Array(2291064, 420), // 终极斩 20
Array(2291066, 420), // 幽灵一击 20
Array(2291068, 420), // 进阶狂蛮撞击 20
Array(2291069, 420), // 进阶神剑陨落 20
Array(2291070, 420), // 进阶旋卷切割 20
Array(2291071, 420), // 进阶圆月旋风 20
Array(2291072, 420), // 进阶狂转回旋 20
Array(2291073, 420), // 进阶狂转回旋 30
Array(2291074, 420), // 进阶旋跃斩 20
Array(2291075, 420), // 进阶旋跃斩 30
Array(2291076, 420), // 进阶地裂山崩 20
Array(2291077, 420), // 进阶地裂山崩 30
Array(2291078, 420), // 进阶暴风旋涡 20
Array(2291079, 420), // 进阶暴风旋涡 30
Array(2291112, 420), // 进阶圆月旋风 30
Array(2291116, 420), // 爆流拳 20
Array(2291117, 420), // 爆流拳 30
Array(2291118, 420), // 鬼斩 20
Array(2291119, 420), // 鬼斩 30
Array(2291120, 420), // 四魂刻印 20
Array(2291121, 420), // 分魂斩 20
Array(2291122, 420), // 火狐灵 20
Array(2291123, 420), // 火狐灵 30
Array(2291124, 420), // 精灵凝聚第4招 20
Array(2291125, 420), // 精灵凝聚第4招 30
Array(2291126, 420), // 高级拳甲修炼 20
Array(2291127, 420), // 高级拳甲修炼 30
Array(2291128, 420), // 洞察之眼 20
Array(2291138, 420), // 暴风箭雨 20
Array(2291139, 420), // 暴风箭雨 30
Array(2291141, 420), // 磁性船锚 20
Array(2291144, 420), // 暮光祝福 20
Array(2291145, 420), // 暮光祝福 30
Array(2291147, 420), // 弹仓扩展 20
Array(2291149, 420), // 弹仓扩展 30
Array(2291152, 420) // 血腥禁锢 30*/
);
var selectedItem = -1;
var selectedCost = -1;
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#r管理提示：苹果只能购买本职业神秘能手册#k\r\n\r\n#e#b亲爱的#r#h ##k#b您好 \t#k#b当前可用苹果 #r" + cm.getPlayerPoints() + " #k#b个 \r\n\r\n请选择您希望购买的技能册：#k#e#n";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k #b需要 #r" + itemList[i][1] + " #k#b苹果#k#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1];
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 苹果\r\n附加 500万 冒险币？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getMeso() >= 5000000 && cm.getPlayerPoints() >= selectedCost) {
            if (cm.gachaponItem != -1) {
		cm.gainItem(selectedItem,1);
                cm.gainMeso(-5000000);
		cm.gainPlayerPoints(-selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
                cm.worldSpouseMessage(0x25, "『苹果书店』 : " + cm.getChar().getName() + " 使用 【苹果】，成功购买本职业神秘能手册，看看您人品如何，能开出想要的书吗？");

            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多苹果或冒险币。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k \r\n需要 #r" + selectedCost + "#k 苹果 附加 500万 冒险币。");
        }
        cm.dispose();
    }
}