/*
 脚本功能：道具兑换
 */
 
var ItemNeedId = 4310020;
var selects;
var ItemArray = Array(
Array(2430054, 50), //男男机车 30天
Array(2430055, 50),  //女女机车 30天
Array(2430057, 60),  //赛车 30天
Array(2430072, 50), //老虎传说 7天
Array(2430293, 1000), //坐骑 飞船 永久
Array(2430294, 100), //飞船 90天
Array(2430295, 10000), //坐骑 天马 永久
Array(2430296, 1000), //坐骑 天马 90天
Array(2430297, 2000), //坐骑 暗光龙 永久
Array(2430298, 200), //暗光龙 90天
Array(2430299, 3000), //坐骑 魔法扫帚 永久
Array(2430300, 300), //魔法扫帚 90
Array(2430301, 4000), //坐骑 筋斗云 永久
Array(2430302, 400), //坐骑 筋斗云 90天
Array(2430303, 5000), //坐骑 骑士团战车 永久
Array(2430304, 500), //骑士团战车 90天
Array(2430305, 6000), //坐骑 梦魇 永久
Array(2430306, 600), //梦魇 90天
Array(2430307, 8000), //坐骑 蝙蝠怪 永久
Array(2430308, 800), //蝙蝠怪 90天
Array(2430309, 8000), //坐骑 透明蝙蝠怪 永久
Array(2430310, 800), //透明蝙蝠怪 90天
Array(2430311, 1000), //坐骑 猫头鹰 永久
Array(2430312, 100), //猫头鹰 90天
Array(2430315, 500), //坐骑 妮娜的魔法阵 永久
Array(2430316, 50), //妮娜的魔法阵 90天
Array(2430317, 3000), //坐骑 青蛙 永久
Array(2430318, 300), //青蛙90天交换券
Array(2430319, 3000), //小龟龟 永久
Array(2430320, 300), //月小龟龟 90天
Array(2430321, 3000), //无辜水牛 永久
Array(2430325, 3000), //坐骑 维京战车 永久
Array(2430326, 300), //维京战车 90天
Array(2430327, 3000), //打豆豆机器人 永久
Array(2430328, 300), //打豆豆机器人 90天
Array(2430329, 2000), //暴风摩托 永久
Array(2430330, 200), //暴风摩托 90天
Array(2430331, 1000), //玩具木马 永久
Array(2430332, 100), //玩具木马 90天
Array(2430333, 6000), //老虎只是传说 永久
Array(2430334, 600), //老虎只是传说 90天
Array(2430335, 1000), //坐骑 莱格斯的豺犬 永久
Array(2430336, 100), //莱格斯的豺犬 90天
Array(2430337, 3000), //坐骑 鸵鸟 永久
Array(2430338, 300), //鸵鸟 90天
Array(2430339, 2000), //坐骑 跑车 永久
Array(2430340, 200), //跑车 90天
Array(2430341, 5000), //拿破仑的白马 永久
Array(2430342, 500), //拿破仑的白马 90天
Array(2430343, 1000), //坐骑 鳄鱼王 永久
Array(2430344, 100) //鳄鱼王 90天

//以下为不可使用的
/*
Array(2432350, 10), //白魔法师和雪原骑宠1天交换券
Array(2430992, 50),  //藏獒骑宠7天使用券
Array(2430707, 50),  //好朋友坐骑7天使用券
Array(2430993, 0), //藏獒骑宠30天使用券
Array(2430521, 0), //小兔子骑宠30天使用券
Array(2431914, 0), //小兔子骑宠30天使用券
Array(2432328, 0), //Naver帽子骑宠30天使用券
Array(2432099, 0), //巨大公鸡骑宠30天券
Array92431950, 0), //巨大公鸡骑宠90天券
Array(2430994, 0), //藏獒骑宠90天使用券
Array(2432029, 0), //老式战船骑宠90天券
Array(2432497, 0), //赤兔马骑宠永久使用券
Array(2430464, 0), //国庆纪念版热气球永久权
Array(2432735, 0), //熊猫骑宠永久券
Array(2432733, 0), //雄鹰！骑宠永久券
Array(2432487, 0), //LV骑宠永久券 
Array(2432496, 0), //舞狮骑宠永久使用权
Array(2432518, 0), //幽灵马车骑宠永久使用券
Array(2430534, 0), //企鹅永久权使用券
Array(2430938, 0), //红色皮卡永久使用券
Array(2430939, 0), //双强力滑车骑宠永久使用券
Array(2430968, 0), //双粉红飞马永久使用券
Array(2431137, 0), //幻龙骑宠永久使用券
Array(2431073, 0), //二连跳青蛙永久使用券
Array(2431135, 0), //与你相伴幻影骑宠永久使用券
Array(2431136, 0), //与你相伴阿莉亚骑宠永久使用券
Array(2431268, 0), //玛瑙美洲豹永久使用券
Array(2431353, 0), //黑飞龙骑宠永久使用券
Array(2431362, 0), //礼物雪球永久使用券
Array(2431423, 0), //天空自行车骑宠永久使用券
Array(2431424, 0), //雪花骑宠永久使用券
Array(2431425, 0), //乌云骑宠永久使用券
Array(2431426, 0), //月亮骑宠永久使用券
Array(2431473, 0), //和品克缤一起旅行骑宠永久使用券
Array(2431474, 0), //和布莱克缤一起旅行骑宠永久使用券
Array(2434377, 0), //不想长大！骑宠永久使用券
Array(2434379, 0), //骑士团花轿骑宠永久使用券
Array(2434277, 0), //极光鹿骑宠永久使用券
Array(2432172, 0), //兔兔赏月骑宠永久使用券
Array(2432992, 0), //蜜蝴蝶骑宠永久使用券
Array(2433069, 0), //迷你太空船永久使用券
Array(2432806, 0), //官轿骑宠永久券
Array(2432994, 0), //希望敞篷车骑宠
Array(2432995, 0), //后起跑车骑宠
Array(2432996, 0), //梦幻跑车骑宠
Array(2432997, 0), //新手滑板骑宠
Array(2432998, 0), //初级滑板骑宠
Array(2432999, 0), //普通滑板骑宠
Array(2433000, 0), //高级滑板骑宠
Array(2433001, 0), //精英滑板骑宠
Array(2433002, 0), //传说滑板骑宠
Array(2433003, 0), //闪耀气球骑宠
Array(2433051, 0), //猫咪手推车骑宠永久劵
Array(2433053, 0), //喷气式滑艇骑宠永久劵
Array(2431898, 0), //弹跳车骑宠永久券
Array(2431915, 0), //鸟叔邮递员永久使用券
Array(2432003, 0), //战斗飞艇骑宠使用券
Array(2432007, 0), //海加顿之拳骑宠使用券
Array(2432030, 0), //石像鬼骑宠永久券
Array(2432031, 0), //好友骑宠永久券
Array(2432078, 0), //地狱犬骑宠永久券
Array(2432085, 0), //海豚骑宠永久券
Array(2431883, 0), //沙云骑宠永久使用券
Array(2431765, 0), //摇摇木马骑宠券
Array(2432015, 0), //赤红沙云骑宠永久使用券
Array(2432149, 0), //稻香四溢骑宠永久使用券
Array(2432151, 0), //飞行床骑宠永久券
Array(2432309, 0), //吉尼骑宠永久使用券
Array(2432216, 0), //僵尸卡车永久券
Array(2432218, 0), //妮娜的魔法阵骑宠永久券
Array(2432291, 0), //滑板永久使用券
Array(2432293, 0), //南瓜马车永久使用券
Array(2432295, 0), //贝伦骑宠永久使用券
Array(2432347, 0), //南哈特和雪原永久骑宠交换券
Array(2432348, 0), //希纳斯和雪原永久骑宠交换券
Array(2432349, 0), //奥尔卡和雪原永久骑宠交换券
Array(2432351, 0), //希拉和雪原永久骑宠交换券
Array(2432431, 0), //龙骑士骑宠永久使用券
Array(2432433, 0), //魔法扫帚骑宠永久使用券
Array(2432449, 0), //飞鞋骑宠永久使用券
Array(2432582, 0), //迟到了！骑宠永久使用券
Array(2432498, 0), //蓝焰梦魇骑宠永久使用券
Array(2432500, 0), //新年快乐骑宠永久使用券
Array(2432645, 0), //毛驴骑宠永久券
Array(2432653, 0), //舞动的向日葵骑宠
Array(2434127, 0), //菇菇有点肿骑宠永久券
Array(2433499, 0), //奥尔卡之搀扶永久券
Array(2433501, 0), //赫丽娜之搀扶永久券
Array(2433735, 0), //飞翔青羊骑宠永久券
Array(2433736, 0), //飞翔粉羊骑宠永久券
Array(2433809, 0), //拉拉喵骑宠永久券
Array(2433811, 0), //草莓蛋糕骑宠永久券
Array(2433292, 0), //蛋糕骑宠永久使用券
Array(2433293, 0), //驯鹿雪橇骑宠永久使用券
Array(2433497, 0), //美羊羊骑宠永久交换券
Array(2433511, 0), //喜羊羊骑宠永久交换券
Array(2434084, 0), //黑色天使骑宠永久交换券
Array(2434142, 0), //盖奥勒克骑宠使用券
Array(2434143, 0), //粉碎机骑宠使用券
Array(2434235, 0), //变身云朵骑宠
Array(2434236, 0), //呆萌鲸鱼骑宠
Array(2434037, 0), //迷你黑色天堂骑宠券
Array(2433836, 0), //拯救骑宠
Array(2433058, 0), //永久性喷气式滑艇载具优惠券
Array(2433059, 0), //永久性潜水艇载具优惠券
Array(2433060, 0), //永久性直升机载具优惠券
Array(2433168, 0), //永久性热气球载具优惠券
Array(2433169, 0), //永久性独木舟载具优惠券
Array(2433170, 0), //永久性迷你直升机载具优惠券
Array(2433198, 0), //永久性猫咪海盗船载具优惠券
Array(2433881, 0), //橄榄球兔骑宠
Array(2434082, 0), //金鱼出租车骑宠永久交换券
Array(2434083, 500) //金龙鱼骑宠永久使用券
*/


);
var itemQuantity;
var itemid;
var pass = true;
 
function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			var text = "#b温馨提示：#r#z4310020##b只能在怪物公园处获得#k\r\n#r[GM提示您]：#b您当前的#z4310020#为： #r" + cm.getItemQuantity(4310020) + " #b个\r\n";
			for (var i = 0 ; i < ItemArray.length;i++){
				text += "#L"+i+"# #i"+ItemArray[i][0]+"#  #z"+ItemArray[i][0]+"# #k( 需要 #r"+ItemArray[i][1]+"#k 个)\r\n"
			}
			cm.sendSimple(text);
		}else if (a == 1){
			selects = selection;
			itemQuantity = ItemArray[selects][1];
			itemid = ItemArray[selects][0];
			cm.sendYesNo("你确定要使用"+itemQuantity+"个#t"+ItemNeedId+"#来兑换#t"+itemid+"#吗？");
		}else if (a == 2){
			for (var i = 1 ; i < 5 ;i++){
				if (cm.getSpace(i) <1){
					pass = false;
				}
			}
			if (pass){
			if (cm.haveItem(ItemNeedId,itemQuantity)){
				cm.gainItem(itemid,1);
				cm.gainItem(ItemNeedId,-itemQuantity);
				cm.sendOk("兑换成功了！");
			}else{
				cm.sendOk("对不起，你没有足够的#t"+ItemNeedId+"#");
			}
			
			}else{
				cm.sendOk("对不起，背包装备栏位已满,请清理。\r\n -#r请让所有的背包栏目腾出一格。")
			}
			cm.dispose();
		}
	}
}