/* 点卷商城 - 帽子 */

var status = -1;
var itemList = Array(
// -----价格为 10000 点卷 --------
//130版本点装帽子
Array(1004658, 10000),//霜降鹿角
Array(1004657, 10000),//白露鹿角
Array(1004656, 10000),//夏至鹿角
Array(1004655, 10000),//惊蛰鹿角
Array(1004632, 10000),//卖萌小草发卡
Array(1004631, 10000),//卖萌花苞发卡
Array(1004630, 10000),//卖萌花团发卡
Array(1004629, 10000),//卖萌小花发卡
Array(1004628, 10000),//卖萌小叶子发卡
Array(1004602, 10000),//农夫的瑰宝
Array(1004601, 10000),//小企鹅帽子
Array(1004590, 10000),//蓝莓宝石头饰
Array(1004589, 10000),//侠盗猫眼罩
Array(1004580, 10000),//莲花学院青玉饰品
Array(1004571, 10000),//海贼团贝雷帽
Array(1004570, 10000),//黑色海魂帽
Array(1004569, 10000),//彩虹花开帽子
Array(1004543, 10000),//复古头巾
Array(1004533, 10000),//兰儿在游戏！
Array(1004525, 10000),//发卷
Array(1004508, 10000),//女皇的王冠
Array(1004512, 10000),//愉快品克缤帽子
Array(1004506, 10000),//白色兔耳发带
Array(1004505, 10000),//粉红樱花丝带
Array(1004504, 10000),//贵族花纹帽子
Array(1004501, 10000),//王的王冠
Array(1004490, 10000),//尖刺耳麦
Array(1004489, 10000),//骷髅发卡
Array(1004488, 10000),//治愈之丝带
Array(1004486, 10000),//春之主人
Array(1004478, 10000),//BOY帽
Array(1004471, 10000),//水晶喵喵蓝丝带
Array(1004469, 10000),//爱情宣言
Array(1004467, 10000),//特大爱心宽檐帽
Array(1004455, 10000),//白色兔子管家帽
Array(1004454, 10000),//白雪狐狸帽
Array(1004453, 10000),//雪兔贝雷帽
Array(1004450, 10000),//十字之翼
Array(1004448, 10000),//黑色啵啵鼠帽
Array(1004199, 10000),//菖蒲发卡
Array(1004181, 10000),//糖果晚会丝带发卡
Array(1004175, 10000),//天使旋律
//以下是老版本
Array(1002299, 10000), //摇滚帽
Array(1003241, 10000), //摇滚歌手帽
Array(1004156, 10000), //来自星星的你
Array(1004157, 10000), //来自心心的我
Array(1004026, 10000), //黑猫无边帽
Array(1004029, 10000), //北极熊无边帽
Array(1004124, 10000), //恋爱小草莓帽
Array(1004125, 10000), //歌唱大菠萝帽
Array(1003955, 10000), //浪漫玫瑰
Array(1004193, 10000), //搞怪翅膀帽
Array(1000043, 10000), //圣诞节装饰帽-男孩
Array(1000050, 10000), //薄荷雪水晶
Array(1001076, 10000), //樱桃雪水晶
Array(1003955, 10000), //浪漫玫瑰
Array(1000062, 10000), //兔子胡萝卜绒线帽(蓝)
Array(1001089, 10000), //兔子胡萝卜绒线帽(粉)
Array(1003892, 10000), //树叶钻石
Array(1003588, 10000), //玩具粉熊帽子
Array(1004112, 10000), //可爱兔纸帽
Array(1003862, 10000), //小熊丝带
Array(1004092, 10000), //小马乖乖帽
Array(1004110, 10000), //蓝色波点发箍
Array(1004111, 10000), //粉色波点发箍
Array(1004126, 10000), //彩糖熊耳帽
Array(1004137, 10000), //兔兔熊帽
Array(1004190, 10000), //微笑旋律耳机
Array(1004200, 10000), //夏日兔草帽
Array(1004203, 10000), //喵星人的秘密
Array(1004204, 10000), //蓝色小马憨憨针织帽
Array(1004205, 10000), //红色小马憨憨针织帽
Array(1004211, 10000), //哈尼绒绒耳
Array(1004295, 10000), //音乐飞天小鸡帽
Array(1004296, 10000), //萌动飞天小鸡帽
Array(1004180, 10000), //俏皮帽子
Array(1004298, 10000), //泰迪萌犬帽(白)
Array(1004299, 10000), //泰迪萌犬帽(棕)
Array(1004332, 10000), //我爱小狗
Array(1004094, 10000), //白巧克力兔子发箍
// -----价格为 8000 点卷 --------
Array(1004393, 8000), //艾伦套装
Array(1004394, 8000), //三笠套装
Array(1004395, 8000), //阿明套装
Array(1004396, 8000), //利威尔套装
Array(1004398, 8000), //趴趴艾伦
Array(1004399, 8000), //趴趴三笠
Array(1004400, 8000), //趴趴阿明
Array(1004401, 8000), //趴趴利威尔
Array(1004402, 8000), //趴趴超大型巨人
Array(1003909, 8000), //活力苏打帽
Array(1004413, 8000), //星光熠熠的驯鹿角
Array(1004397, 8000), //清扫头巾
Array(1004191, 8000), //粉红天使翅膀帽
Array(1004196, 8000), //风车头箍
Array(1004171, 8000), //旋转木马帽
Array(1004164, 8000), //丝绸头盔
Array(1004165, 8000), //玫瑰闪耀
Array(1004166, 8000), //黑色蝴蝶结发箍
Array(1004167, 8000), //绿色恐龙帽
Array(1004168, 8000), //呆萌猫咪帽
Array(1004169, 8000), //美味荷包蛋帽
Array(1004170, 8000), //斑斓可爱的芭菲帽
Array(1004187, 8000), //小猴子帽子
Array(1004188, 8000), //白雪人帽子
Array(1004185, 8000), //蓝色蘑菇帽
Array(1004186, 8000), //幼红独角狮帽子
Array(1004189, 8000), //企鹅王帽子
Array(1004158, 8000), //鼠鼠派对发箍
Array(1002495, 8000), //安格拉毛线帽
Array(1003883, 8000), //华尔兹丝带贝雷帽
Array(1004114, 8000), //红樱贝雷帽
Array(1003596, 8000), //金属冠棒球帽
Array(1003859, 8000), //满天星普赛克
Array(1003945, 8000), //超级巨星王冠
Array(1003953, 8000), //神之子头冠
Array(1003919, 8000), //花花绒线帽
Array(1003865, 8000), //星光飘带帽子
Array(1003920, 8000), //夏威夷草帽
Array(1003934, 8000), //影子斗篷
Array(1003460, 8000), //奶油巧克力帽子
Array(1001068, 8000), //军团长假发-女款
Array(1000045, 8000), //军团长假发-男款
// -----价格为 5000 点卷 --------
Array(1003968, 5000), //小绵羊朵朵玩偶帽
Array(1003967, 5000), //巧可羊帽子
Array(1004025, 5000), //绿猫猫帽子
Array(1004033, 5000), //红猫猫帽子
Array(1002796, 5000), //可爱小绵羊帽子
Array(1004081, 5000), //灵魂熊帽
Array(1003840, 5000), //暗影骑士帽子
Array(1003802, 5000), //小恐龙绿豆帽子
Array(1003803, 5000), //小恐龙云豆帽子
Array(1003796, 5000), //甜蜜冰淇淋帽
Array(1003753, 5000), //尖兵帽
Array(1004000, 5000), //黑暗小恶魔帽子
Array(1003776, 5000), //海豹白白帽
Array(1003539, 5000), //蓝色天使帽
Array(1003516, 5000), //小蜜蜂帽子
Array(1003509, 5000), //时尚香肠帽
Array(1003530, 5000), //银河牛仔帽
Array(1003506, 5000), //银河战队头盔
Array(1003005, 5000), //枫叶赛车手头盔
Array(1003649, 5000), //领主战盔(国庆)
Array(1003650, 5000), //血狩战盔(国庆)
Array(1003651, 5000), //影刃头带(国庆)
Array(1003652, 5000), //神圣魔法帽(国庆)
Array(1003653, 5000), //荆棘头冠(国庆)
Array(1003273, 5000), //[派对]黑发帽
Array(1003274, 5000), //[派对]白色帽子
Array(1003275, 5000), //[派对]可爱牛头帽
Array(1004158, 5000), //鼠鼠派对发箍
Array(1004162, 5000), //柴郡猫耳朵
Array(1001049, 5000), //鬼娃娃发带
Array(1000027, 5000), //金童帽
Array(1001039, 5000), //玉女帽
Array(1002976, 5000), //女仆头饰
Array(1003147, 5000), //天蓝女仆头饰
Array(1002943, 5000), //水兵帽
Array(1003044, 5000), //小丑帽子
Array(1003853, 5000), //Blavy天使之翼
Array(1003760, 5000), //猫咪耳机
Array(1003759, 5000), //蓝缎带猫咪帽
Array(1003505, 5000), //炎龙角
Array(1003504, 5000), //海龙角
Array(1003761, 5000), //圣洁天使帽
Array(1004095, 5000), //肃清者斗篷
Array(1003730, 5000), //猫咪洛丽塔帽子
Array(1003508, 5000), //西红柿帽子
Array(1002890, 5000), //丝带发箍（蓝色）
Array(1002888, 5000), //丝带发箍（红色）
Array(1003207, 5000), //胡萝卜兔爆炸头
Array(1003269, 5000), //天蓝爱心帽
Array(1003268, 5000), //粉嫩爱心帽
Array(1003492, 5000), //蓬松蛋卷寿司
Array(1003493, 5000), //新鲜三文鱼寿司
Array(1003494, 5000), //Q弹章鱼寿司
Array(1003495, 5000), //鲑鱼子寿司
Array(1003496, 5000), //呀吼鲜虾寿司
Array(1003249, 5000), //8周年音符黄晶
Array(1003250, 5000), //8周年音符红宝石
Array(1003251, 5000), //8周年音符黄水晶
Array(1003252, 5000), //8周年音符紫水晶
Array(1003253, 5000), //8周年音符柠檬色
Array(1003254, 5000), //8周年音符希埃尔
Array(1003255, 5000), //8周年音符紫色
Array(1003256, 5000), //8周年音符绿色
Array(1003965, 5000), //小鸡玩偶帽
Array(1002422, 5000), //点点星光帽
Array(1004028, 5000), //黄猫无边帽
Array(1003779, 5000), //爱丽丝兔兔帽
Array(1003714, 5000), //喵喵耳朵
Array(1003935, 5000), //萌萌狐耳朵
Array(1004162, 5000), //柴郡猫耳朵
Array(1002479, 5000), //雪人帽
Array(1002526, 5000), //白骨帽子
Array(1002599, 5000), //黄金盔
Array(1002720, 5000), //鹿角圣诞帽
Array(1002734, 5000), //舞狮头
Array(1003536, 5000), //露西娅帽子
Array(1002960, 5000), //黑色王冠
Array(1003458, 5000), //茅山道士帽
Array(1004014, 5000), //找准感觉, 好好解开～！妖精
Array(1004039, 5000), //隐月花帽
Array(1001092, 5000), //隐月花簪
Array(1000070, 5000), //蹦蹦邦尼帽
Array(1000072, 5000), //蓝色钱包君
Array(1001097, 5000), //秋游贝雷帽
Array(1000029, 5000), //新娘面纱
Array(1000035, 5000), //结婚礼帽
Array(1004113, 5000), //僵尸新娘的面纱
Array(1000011, 5000), //绿虎钢盔
Array(1001080, 5000), //黄熊钢盔
Array(1001079, 5000), //粉狼钢盔
Array(1000026, 5000), //圣诞男孩子帽
Array(1001036, 5000), //圣诞女孩子帽
Array(1001063, 5000), //快乐圣诞帽
Array(1000006, 5000), //日式女发套
Array(1000037, 5000), //日式男发套
Array(1000060, 5000), //真红犄角
Array(1000046, 5000), //精灵王假发-男款
Array(1001069, 5000), //精灵王假发-女款
Array(1004192, 5000), //哆来咪耳麦
Array(1003014, 5000), //女女机车帽
Array(1003015, 5000), //男男机车帽
Array(1001030, 5000), //貂蝉巾
Array(1001075, 5000), //圣地之星
Array(1001095, 5000), //粉红钱包君
Array(1000072, 5000), //蓝色钱包君
Array(1002203, 5000), //黄雨帽
Array(1002204, 5000), //红雨帽
Array(1002205, 5000), //蓝雨帽
Array(1002206, 5000), //绿雨帽
Array(1002224, 5000), //老虎面具
Array(1002293, 5000), //蓝色睡帽
Array(1002294, 5000), //红色睡帽
Array(1003743, 5000), //蛇年嘻哈帽
Array(1004123, 5000), //时尚小圆帽
Array(1004140, 5000), //军团长斯乌面具
Array(1004141, 5000), //军团长德米安面具
Array(1004142, 5000), //军团长鲁希德面具
Array(1004144, 5000), //军团长班·雷昂面具
Array(1004145, 5000), //军团长阿卡伊勒面具
Array(1004146, 5000), //军团长奥尔卡面具
Array(1004147, 5000), //军团长威尔面具
Array(1004148, 5000), //军团长希拉面具
Array(1004139, 5000), //粉嘟嘟熊帽
Array(1004136, 5000), //未来天使帽
Array(1003078, 5000), //灵异蝴蝶
Array(1002672, 5000), //金人帽
Array(1002673, 5000), //银人帽
Array(1002674, 5000), //铜人帽
Array(1002700, 5000), //绿独眼怪婴
Array(1002701, 5000), //绿独嘴怪婴
Array(1002696, 5000), //信号灯帽
Array(1002703, 5000), //青独眼怪婴
Array(1002705, 5000), //青独嘴怪婴
Array(1002704, 5000), //黄独眼怪婴
Array(1002706, 5000), //黄独嘴怪婴
Array(1002607, 5000), //八戒帽
Array(1002592, 5000), //大圣头冠
Array(1002568, 5000), //手工编织发夹
Array(1003001, 5000), //贵族勇士头盔
Array(1002558, 5000), //豺狼帽
Array(1002499, 5000), //白虎帽
Array(1002493, 5000), //熊仔帽
Array(1003756, 5000), //白熊帽
Array(1002536, 5000), //打劫的
Array(1002542, 5000), //栗子头
Array(1002548, 5000), //兔子头
Array(1002549, 5000), //黑猫头
Array(1002823, 5000), //巫毒头套
Array(1002456, 5000), //水瓶座帽
Array(1002457, 5000), //双鱼座帽
Array(1002458, 5000), //白羊座帽
Array(1002459, 5000), //金牛座帽
Array(1002460, 5000), //双子座帽
Array(1002461, 5000), //巨蟹座帽
Array(1002462, 5000), //狮子座帽
Array(1002463, 5000), //处女座帽
Array(1002464, 5000), //天秤座帽
Array(1002465, 5000), //天蝎座帽
Array(1002466, 5000), //射手座帽
Array(1002467, 5000), //山羊座帽
Array(1002367, 5000), //天使之冠
Array(1002552, 5000), //月兔帽子
Array(1001061, 5000), //伊丽莎白假发
Array(1001064, 5000), //闪耀Girl帽子
Array(1000044, 5000), //闪耀Boy帽子
Array(1000074, 5000), //秋游贝雷帽
Array(1001097, 5000), //秋游贝雷帽
Array(1002322, 5000), //龙虾帽
Array(1003227, 5000), //青蛙帽子
Array(1002877, 5000), //牛牛贺岁帽子
Array(1003519, 5000) //霞光草帽
);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#亲爱的#r#h ##k您好，请选择您希望购买的道具：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1] / 1 + " #k点卷#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1] / 1;
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + " #k 点卷？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "点卷商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷。");
        }
        cm.dispose();
    }
}