/* 点卷商城 - 披风 */

var status = -1;
var itemList = Array(
// -----价格为 15000 点卷 --------
//131
Array(1102908, 15000),//冬日雪人披风
Array(1102903, 15000),//香蕉猴子气球
Array(1102876, 15000),//自嗨时间
Array(1102875, 15000),//失忆的外星人
Array(1102874, 15000),//花精灵翅膀
Array(1102861, 15000),//乌鲁斯之光
Array(1102854, 15000),//兔儿爷咚咚
Array(1102855, 15000),//兔儿奶奶咚咚

//130
Array(1102867, 15000),//满月清辉披风
Array(1102858, 15000),//永恒时间齿轮
Array(1102859, 15000),//蓝色雪花飘飘
Array(1102847, 15000),//莲花学院守护魂火
Array(1102844, 15000),//鼠鼠和兔兔
Array(1102841, 15000),//爱莉丝的泡泡
Array(1102831, 15000),//高飞
Array(1102823, 15000),//可爱之翼
Array(1102822, 15000),//活泼花风
Array(1102816, 15000),//闪亮小叮当
Array(1102812, 15000),//决战！暴雪！
Array(1102811, 15000),//雪花绽放
Array(1102809, 15000),//死亡华尔兹
Array(1102808, 15000),//啵啵鼠气球
Array(1102461, 15000),//粉嫩披风


//Array(1102723, 50000), //光明天使羽翼
Array(1102702, 15000), //红色蝴蝶羽翼
Array(1102699, 15000), //烈焰翅膀
Array(1102698, 15000), //绿色蜻蜓翅膀
Array(1102697, 15000), //红色蜻蜓翅膀
Array(1102688, 15000), //双色砰砰炮
Array(1102616, 15000), //拉比斯之精气
Array(1102617, 15000), //拉兹丽之精气
Array(1102608, 15000), //超级巨星水晶魔球
Array(1102564, 15000), //天衣无缝
// -----价格为 10000 点卷 --------
Array(1102864, 10000),//蔬果纷飞
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1051465, 10000),//
Array(1102788, 10000), //与阿明同在披风
Array(1102785, 10000), //与利威尔同在
Array(1102786, 10000), //从巨人处逃走
Array(1102757, 10000), //巴尼兔心形气球
Array(1102756, 10000), //微笑玉米斗篷
Array(1102726, 10000), //胡萝卜披风
Array(1102709, 10000), //双色糖果翅膀
Array(1102705, 10000), //背着海鸥去旅行
Array(1102704, 10000), //精灵翅膀
Array(1102703, 10000), //蓝色蝴蝶羽翼
Array(1102683, 10000), //兔兔熊背包
Array(1102672, 10000), //唠叨话喇叭
Array(1102669, 10000), //壕
Array(1102667, 10000), //寻找满月
Array(1102388, 10000), //炎龙尾巴
Array(1102387, 10000), //海龙尾巴
Array(1102643, 10000), //金色之翼
Array(1102629, 10000), //粉红四翼天使
Array(1102619, 10000), //喜欢冰的小企鹅
Array(1102605, 10000), //暗炎赎罪者
Array(1102555, 10000), //大天使的翅膀
Array(1102550, 10000), //绿宝石翅膀
Array(1102551, 10000), //蓝宝石翅膀
Array(1102487, 10000), //夜光法师四翼天使
Array(1102453, 10000), //树妖
Array(1102450, 10000), //天使光芒之翼
Array(1102451, 10000), //黑暗光芒之翼
Array(1102452, 10000), //精灵光芒之翼
Array(1102537, 10000), //星尘披肩
Array(1102576, 10000), //诺克斯四翼天使
Array(1102575, 10000), //路易斯四翼天使
Array(1102610, 10000), //普赛克时空
Array(1102611, 10000), //普赛克旋律
Array(1102356, 10000), //天使祖母绿
Array(1102225, 10000), //嫦娥披风
// -----价格为 8000 点卷 --------
Array(1102692, 8000), //小小寿司团
Array(1102685, 8000), //熊宝宝披风
Array(1102684, 8000), //未来医生听诊器
Array(1102682, 8000), //未来天使注射器
Array(1102673, 8000), //僵尸新娘披风
Array(1102671, 8000), //肃清者的荆翼
Array(1102644, 8000), //小精灵
Array(1102622, 8000), //时间旅行者的怀表
Array(1102631, 8000), //万圣节幻影披风
Array(1102620, 8000), //我的烟火秀
Array(1102615, 8000), //时间塔发条娃娃
Array(1102593, 8000), //浮漾的棒球
Array(1102587, 8000), //安琪莉可的光环
Array(1102583, 8000), //宝宝龙波比
Array(1102546, 8000), //蓝色幻想之翼
Array(1102547, 8000), //粉色幻想之翼
Array(1102548, 8000), //绿色幻想之翼
Array(1102511, 8000), //圣洁四翼天使
Array(1102491, 8000), //阳光明媚
Array(1102488, 8000), //蛋糕杯气球
Array(1102391, 8000), //小蜜蜂翅膀
Array(1102217, 8000), //九尾披风
Array(1102213, 8000), //品克缤的小尾巴
Array(1102149, 8000), //冰凌披风
Array(1102148, 8000), //熔岩披风
Array(1102675, 8000), //糖果甜甜蝴蝶结
Array(1102624, 8000), //天王星光芒之翼
Array(1102532, 8000), //光芒智天使
Array(1102349, 8000), //发光精灵翅膀
// -----价格为 5000 点卷 --------

Array(1102651, 5000), //熊猫尾巴
Array(1102652, 5000), //松鼠尾巴
Array(1102654, 5000), //狗狗尾巴
Array(1102653, 5000), //兔尾巴
Array(1102213, 5000), //品克缤的小尾巴
Array(1102296, 5000), //夜叉尾巴(黑色
Array(1102067, 5000), //老虎尾巴
Array(1102094, 5000), //猴子尾巴
Array(1102549, 5000), //管家的猫咪
Array(1102531, 5000), //僵尸猎人披风
Array(1102503, 5000), //猫咪洛丽塔披风
Array(1102465, 5000), //银河牛仔披风
Array(1102354, 5000), //粉嫩披风
Array(1102419, 5000), //露西娅披风
Array(1102392, 5000), //西式风情披风
Array(1102389, 5000), //银色天使
Array(1102389, 5000), //金色天使
Array(1102380, 5000), //我的朋友青蛙酱
Array(1102343, 5000), //军团长的披风
Array(1102344, 5000), //精灵王的披风
Array(1102336, 5000), //炼金师的披风
Array(1102325, 5000), //紫天使羽翼
Array(1102326, 5000), //蓝天使羽翼
Array(1102310, 5000), //精灵披风
Array(1102308, 5000), //新·比耶莫特的翅膀
Array(1102307, 5000), //新·夏其尔的翅膀
Array(1102309, 5000), //新·亚努斯的翅膀
Array(1102300, 5000), //派对舞会灯
Array(1102292, 5000), //闪耀彩虹
Array(1102288, 5000), //背背雪人
Array(1102286, 5000), //晴天娃娃(天蓝色)
Array(1102271, 5000), //可爱巧克力棒气球
Array(1102270, 5000), //风和日丽
Array(1102267, 5000), //我的朋友九尾狐尾巴
Array(1102253, 5000), //紫色之翼
Array(1102245, 5000), //太阳披风
Array(1102238, 5000), //灰蒙蒙猫尾巴
Array(1102233, 5000), //雪娃娃披风
Array(1102232, 5000), //小王子的星星
Array(1102229, 5000), //小熊熊披风
Array(1102224, 5000), //小绵羊披风
Array(1102222, 5000), //死神披风
Array(1102215, 5000), //气球串
Array(1102214, 5000), //品克缤气球
Array(1102203, 5000), //超强力火箭炮
Array(1102202, 5000), //异界披风
Array(1102196, 5000), //点点星光围巾
Array(1102185, 5000), //彩虹围脖
Array(1102175, 5000), //可爱小绵羊披风
Array(1102157, 5000), //傀儡枷锁
Array(1102164, 5000), //摇滚电吉他
Array(1102156, 5000), //风度围脖
Array(1102154, 5000), //扎昆爪爪
Array(1102150, 5000), //吸血鬼披风
Array(1102144, 5000), //老僧人披肩
Array(1102143, 5000), //扁担水桶披肩
Array(1102142, 5000), //火焰披风
Array(1102108, 5000), //恶魔尾巴
Array(1102060, 5000), //蝴蝶夫人结
Array(1102137, 5000), //花蘑菇气球
Array(1102112, 5000), //垂耳兔
Array(1102676, 5000), //摇摆猫咪酱
Array(1102625, 5000), //蜗牛披风
Array(1102374, 5000), //飞行小猴披风
Array(1102690, 5000), //柴郡猫的狐狸围脖
Array(1102065, 5000), //圣诞披风
Array(1102199, 5000) //玲珑彩灯
);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#亲爱的#r#h ##k您好，请选择您希望购买的道具：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1] / 1  + " #k点卷#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1] / 1;
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + " #k 点卷？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "点卷商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷。");
        }
        cm.dispose();
    }
}