function start() {
	//cm.gainItem(2430154, 1);//新手变强说明
	cm.gainItem(2431718, 1);//蜡笔箱子
	//cm.gainItem(2430499, 1, 7);//首冲礼包 7天内有效
	cm.gainItem(2431092, 1);//特殊超值礼包
	cm.gainItem(1142806, 1);//2015羊年勋章
	cm.gainItem(2430505, 1);//星之力勋章
	cm.gainItem(2430241, 1);
	//cm.gainItem(2431673, 1, 7);// 充值2000元礼包
	cm.gainMeso(100000);
	cm.warp(50000);
	cm.sendOk("#d欢迎来到 #r纯爱冒险岛#k #d,先来大概了解一下本服特色：\r\n\r\n#b· 本服为仿官方模式  经验50倍  金币30倍  爆率10倍\r\n· 主菜单在拍卖按钮(频道上面),和商城按钮 提供各种便捷服务\r\n· 拍卖处的游戏商店分类很多种，详情请看说明。\r\n· 各种特色副本，组队任务，以及BOSS副本。\r\n· 为帮助您能顺利成长,我们准备了新手礼包给您\r\n· 最后祝您游戏愉快，想要变强请看背包里的 #r#z2430154##k#b。\r\n· 如果真心不会请加我们的玩家交流群：#e#r730662#n#k");
	cm.worldSpouseMessage(0x15,"『新手驾到』：恭喜玩家 "+ cm.getChar().getName() +" 来到了纯爱冒险岛。热烈祝贺他(她)吧。");
	cm.dispose();
}