status = -1;
var tz15 = "#fEffect/CharacterEff/1112949/0/0#";  //花样音符
var itemList = Array(
// 对应下列信息，
//抽奖道具， 抽中概率500为最大1为最小，给予该道具数量，喇叭公告

//---------点装--------
Array(5010031, 200, 1, 1), //我的男友
Array(5010032, 200, 1, 1), //我的女友
Array(5120001, 100, 1, 1), //浪漫樱花
Array(5120007, 100, 1, 1), //棒棒糖
Array(5120010, 100, 1, 1), //漂可乐
Array(5120012, 100, 1, 1), //圣诞袜子
//-------必成卷+好卷-------
Array(2040006, 500, 1, 1), //头盔防御必成卷
Array(2040007, 500, 1, 1), //头盔体力必成卷
Array(2040303, 500, 1, 1), //耳环智力必成卷
Array(2040403, 500, 1, 1), //上衣防御必成卷
Array(2040506, 500, 1, 1), //全身盔甲敏捷必成卷
Array(2040507, 500, 1, 1), //全身盔甲防御必成卷
Array(2040603, 500, 1, 1), //裤裙防御必成卷
Array(2040709, 500, 1, 1), //鞋子敏捷必成卷
Array(2040710, 500, 1, 1), //鞋子跳跃必成卷
Array(2040711, 500, 1, 1), //鞋子速度必成卷
Array(2040806, 500, 1, 1), //手套敏捷必成卷
Array(2040903, 500, 1, 1), //盾牌防御必成卷
Array(2041024, 500, 1, 1), //披风魔法防御必成卷
Array(2041025, 500, 1, 1), //披风物理防御必成卷
Array(2043003, 300, 1, 1), //单手剑攻击必成卷
Array(2043103, 300, 1, 1), //单手斧攻击必成卷
Array(2043203, 300, 1, 1), //单手钝器攻击必成卷
Array(2043303, 300, 1, 1), //短剑攻击必成卷
Array(2043703, 300, 1, 1), //短杖攻击必成卷
Array(2043803, 300, 1, 1), //长杖攻击必成卷
Array(2044003, 300, 1, 1), //双手剑攻击必成卷
Array(2044019, 300, 1, 1), //双手剑魔力必成卷
Array(2044103, 300, 1, 1), //双手斧攻击必成卷
Array(2044203, 300, 1, 1), //双手钝器攻击必成卷
Array(2044303, 300, 1, 1), //枪攻击必成卷
Array(2044403, 300, 1, 1), //矛攻击必成卷
Array(2044503, 300, 1, 1), //弓攻击必成卷
Array(2044603, 300, 1, 1), //弩攻击必成卷
Array(2044703, 300, 1, 1), //拳套攻击必成卷
Array(2044815, 300, 1, 1), //指节攻击必成卷
Array(2044908, 300, 1, 1), //短枪攻击必成卷

Array(2046008, 30, 1, 1), //周年庆单手武器攻击力卷轴50%
Array(2046009, 30, 1, 1), //周年庆单手武器魔法力卷轴50%
Array(2046108, 30, 1, 1), //周年庆双手武器攻击力卷轴50%
Array(2046109, 30, 1, 1), //周年庆双手武器魔法力卷轴50%
Array(2046577, 20, 1, 1), //宿命正义防具力量卷轴 100%
Array(2046578, 20, 1, 1), //宿命正义防具智力卷轴 100%
Array(2046579, 20, 1, 1), //宿命正义防具敏捷卷轴 100%
Array(2046580, 20, 1, 1), //宿命正义防具运气卷轴 100%
Array(2046763, 10, 1, 1), //宿命正义饰品力量卷轴 100%
Array(2046764, 10, 1, 1), //宿命正义饰品智力卷轴 100%
Array(2046765, 10, 1, 1), //宿命正义饰品敏捷卷轴 100%
Array(2046766, 10, 1, 1), //宿命正义饰品运气卷轴 100%

Array(2049004, 200, 1, 1), //白医卷轴10%
Array(2049005, 100, 1, 1), //白医卷轴20%

//-------垃圾卷--------
Array(2101001, 100, 1, 1), //蝙蝠魔召唤
Array(2100902, 100, 1, 1), //神秘召唤包
Array(2101004, 100, 1, 1), //绿水灵王召唤
Array(2040044, 500, 1, 1), //头盔敏捷卷轴15%
Array(2040100, 500, 1, 0), //脸部装饰生命卷轴10%
Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 500, 1, 0), //脸部装饰回避率卷轴60%
Array(2040108, 500, 1, 0), //脸部装饰回避率诅咒卷轴30%
Array(2040109, 500, 1, 0), //脸部装饰回避率诅咒卷轴70%
Array(2040200, 200, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 200, 1, 1), //眼部装饰命中率卷轴60%
Array(2040203, 200, 1, 1), //眼部装饰命中率诅咒卷轴30%
Array(2040307, 200, 1, 0), //耳环敏捷卷轴30%
Array(2040308, 500, 1, 0), //耳环防御力诅咒卷轴70%
Array(2040313, 100, 1, 1), //耳环智力卷轴65%
Array(2040314, 200, 1, 1), //耳环智力卷轴15%
Array(2040316, 100, 1, 0), //耳环敏捷卷轴100%
Array(2040317, 100, 1, 0), //耳环敏捷卷轴60%
Array(2040527, 400, 1, 0), //全身盔甲智力卷轴15%
Array(2040528, 300, 1, 0), //全身盔甲幸运卷轴65%
Array(2040529, 400, 1, 0), //全身盔甲幸运卷轴15%
Array(2040530, 500, 1, 0), //全身盔甲力量卷轴100%
Array(2040541, 500, 1, 1), //全身盔甲力量卷轴15%
Array(2040600, 500, 1, 0), //裤/裙防御卷轴100%
Array(2040727, 500, 1, 0), //鞋子防滑卷轴10%
Array(2040800, 300, 1, 1), //手套敏捷卷轴100%
Array(2040801, 400, 1, 1), //手套敏捷卷轴60%
Array(2040802, 300, 1, 1), //手套敏捷卷轴10%
Array(2040803, 100, 1, 1), //手套攻击卷轴100%
Array(2040804, 400, 1, 1), //手套攻击卷轴60%
Array(2041108, 300, 1, 1), //戒指敏捷卷轴10%
Array(2041111, 300, 1, 1), //戒指运气卷轴10%
Array(2041201, 300, 1, 1), //项链运气卷轴10%
Array(2041314, 300, 1, 1), //腰带智力卷轴70%
Array(2041315, 300, 1, 1), //腰带智力卷轴30%
Array(2041316, 300, 1, 1), //腰带敏捷卷轴70%
Array(2041317, 300, 1, 1), //腰带敏捷卷轴30%
Array(2041318, 300, 1, 1), //腰带运气卷轴70%
Array(2041319, 300, 1, 1), //腰带运气卷轴30%
Array(2043000, 300, 1, 1), //单手剑攻击卷轴100%
Array(2043001, 300, 1, 1), //单手剑攻击卷轴60%
Array(2043002, 300, 1, 1), //单手剑攻击卷轴10%
Array(2043004, 300, 1, 1), //单手剑攻击诅咒卷轴70%
Array(2043005, 300, 1, 1), //单手剑攻击诅咒卷轴30%
Array(2043306, 400, 1, 1), //短剑攻击卷轴65%
Array(2043307, 400, 1, 1), //短剑攻击卷轴15%
Array(2043700, 400, 1, 1), //短杖魔力卷轴100%
Array(2044218, 300, 1, 1), //单手钝器命中卷轴65%
Array(2044219, 300, 1, 1), //单手钝器命中卷轴15%
Array(2044300, 300, 1, 1), //枪攻击卷轴100%
Array(2044301, 300, 1, 1), //枪攻击卷轴60%
Array(2044302, 300, 1, 1), //枪攻击卷轴10%
Array(2044304, 300, 1, 1), //枪攻击诅咒卷轴70%
Array(2044305, 300, 1, 1), //枪攻击诅咒卷轴30%
Array(2044306, 300, 1, 1), //枪攻击卷轴65%
Array(2044802, 300, 1, 1), //拳甲攻击卷轴10%
Array(2044803, 300, 1, 1), //拳甲攻击卷轴70%
Array(2044804, 300, 1, 1), //拳甲攻击卷轴30%
Array(2044805, 300, 1, 1), //拳甲命中率卷轴100%
Array(2044806, 300, 1, 1), //拳甲命中率卷轴70%
Array(2044807, 300, 1, 1), //拳甲命中率卷轴60%
Array(2044904, 300, 1, 1), //短枪攻击卷轴30%
Array(2044906, 300, 1, 1), //短枪攻击卷轴65%
Array(2044907, 300, 1, 1), //短枪攻击卷轴15%
Array(2049100, 300, 1, 1), //混沌卷轴60%
Array(2049200, 500, 1, 1), //配饰力量卷轴70%
Array(2049201, 500, 1, 1), //配饰力量卷轴30%
Array(2049202, 500, 1, 1), //配饰敏捷卷轴70%
Array(2049203, 500, 1, 1), //配饰敏捷卷轴30%
Array(2049204, 500, 1, 1), //配饰智力卷轴70%
Array(2049205, 500, 1, 1), //配饰智力卷轴30%
Array(2049206, 500, 1, 1), //配饰幸运卷轴70%
Array(2049207, 500, 1, 1), //配饰幸运卷轴30%
Array(2049208, 500, 1, 1), //配饰HP卷轴70%
Array(2049209, 500, 1, 1), //配饰HP卷轴30%
Array(2049210, 500, 1, 1), //配饰MP卷轴70%
Array(2049211, 500, 1, 1), //配饰MP卷轴30%
Array(2101001, 500, 1, 1), //蝙蝠魔召唤
Array(2100902, 500, 1, 1), //神秘召唤包
Array(2101004, 500, 1, 1), //绿水灵王召唤

//-------饰品--------
Array(1012011, 50, 1, 1), //圣诞鹿的鼻子
Array(1012012, 50, 1, 1), //圣诞鹿的鼻子
Array(1012013, 50, 1, 1), //圣诞鹿的鼻子
Array(1012018, 50, 1, 1), //圣诞鹿的鼻子
Array(1012019, 50, 1, 1), //圣诞鹿的鼻子
Array(1012020, 50, 1, 1), //圣诞鹿的鼻子
Array(1012011, 50, 1, 1), //圣诞鹿的鼻子
Array(1012012, 50, 1, 1), //圣诞鹿的鼻子
Array(1012013, 50, 1, 1), //圣诞鹿的鼻子
Array(1012019, 50, 1, 1), //圣诞鹿的鼻子
Array(1012020, 50, 1, 1), //圣诞鹿的鼻子
Array(1012056, 50, 1, 1), //狗狗鼻
Array(1012058, 50, 1, 1), //匹诺曹的鼻子
Array(1012061, 50, 1, 1), //匹诺曹的鼻子
Array(1012058, 50, 1, 1), //匹诺曹的鼻子
Array(1012059, 50, 1, 1), //匹诺曹的鼻子
Array(1012060, 50, 1, 1), //匹诺曹的鼻子
Array(1012061, 50, 1, 1), //匹诺曹的鼻子

//-----椅子-----
Array(3010013, 250, 1, 1), //悠长假期
Array(3010014, 250, 1, 1), //月亮弯
Array(3010018, 250, 1, 1), //椰子树沙滩椅
Array(3010019, 250, 1, 1), //寿司椅
Array(3010021, 250, 1, 1), //暖暖桌
Array(3010025, 250, 1, 1), //枫叶纪念凳
Array(3010028, 250, 1, 1), //海盗的俘虏
Array(3010029, 250, 1, 1), //蓝环凳
Array(3010030, 250, 1, 1), //黑环凳
Array(3010031, 250, 1, 1), //红环凳
Array(3010032, 250, 1, 1), //黄环凳
Array(3010033, 250, 1, 1), //绿环凳
Array(3010037, 250, 1, 1), //猪猪凳
Array(3010044, 100, 1, 1), //同一红伞下
Array(3012001, 150, 1, 1), //篝火
Array(3012002, 150, 1, 1), //浴桶
Array(3010073, 150, 1, 1), //PB克缤
Array(3012003, 150, 1, 1), //爱心椅子
Array(3010012, 150, 1, 1), //剑士 宝座
Array(3010025, 50, 1, 1), //枫叶纪念凳
Array(3010037, 150, 1, 1), //猪猪凳
Array(3010038, 150, 1, 1), //爱心椅子
Array(3010040, 50, 1, 1), //蝙蝠椅
Array(3010041, 150, 1, 1), //骷髅王座
Array(3010043, 150, 1, 1), //魔女的飞扫把
Array(3010044, 150, 1, 1), //同一红伞下
Array(3010045, 150, 1, 1), //寒冰椅子
Array(3010046, 150, 1, 1), //红龙椅
Array(3010047, 100, 1, 1), //蓝龙椅
Array(3010048, 100, 1, 1), //圣诞树椅子
Array(3010049, 100, 1, 1), //雪房子
Array(3010050, 100, 1, 1), //公主凳
Array(3010057, 100, 1, 1), //血色玫瑰
Array(3010058, 100, 1, 1), //世界末日
Array(3010068, 100, 1, 1), //露水椅子
Array(3010070, 150, 1, 1), //巨无霸品克缤
Array(3010071, 125, 1, 1), //神兽椅
Array(3010077, 125, 1, 1), //猫头鹰椅子
Array(3010085, 125, 1, 1), //鬼娃娃椅子
Array(3010096, 125, 1, 1), //恐龙化石宝座
Array(3010095, 125, 1, 1), //石头人座椅
Array(3010094, 115, 1, 1), //漂漂猪椅子
Array(3010098, 125, 1, 1), //电视宅人
Array(3010106, 125, 1, 1), //雪狼战椅
Array(3010112, 125, 1, 1), //情书柜子
Array(3010117, 125, 1, 1), //魔法书椅子
Array(3010119, 125, 1, 1), //羊羊椅子
Array(3010120, 125, 1, 1), //彩蛋篮子
Array(3010123, 125, 1, 1), //夏日花朵
Array(3010124, 125, 1, 1), //都纳斯喷气椅子
Array(3010125, 125, 1, 1), //尼贝隆战舰椅
Array(3010127, 125, 1, 1), //扎昆宝座
Array(3012001, 125, 1, 0), //篝火
Array(3010136, 150, 1, 1), //6周年怪物王座
Array(3010155, 150 * 2, 1, 1), //暗影双刀的猫头鹰椅子
Array(3010144, 150 * 2, 1, 1), //七夕椅子
Array(3010149, 150 * 2, 1, 1), //猫咪风扇椅
Array(3010129, 150 * 2, 1, 1), //酋长宝座
Array(3010131, 150 * 2, 1, 1), //贪吃熊猫椅
Array(3010132, 150 * 2, 1, 1), //撒娇喵咪椅
Array(3010133, 150 * 2, 1, 1), //帐篷椅
Array(3010163, 150 * 2, 1, 1), //满月椅

// ------ 131添加 ------
Array(1112915, 100, 1, 1), //蓝调戒指
Array(2430144, 300, 1, 1), //秘密能手册

// ------ 特殊奖品 --------------
Array(4001465, 500, 10, 1), //爱心宝石
Array(2432069, 10, 1, 1), //暴君箱子随机箱
//Array(2431988, 10, 1, 1), //秘密箱子
Array(2432341, 10, 1,1),//高贵头部防具箱子
Array(4000313, 150, 1, 1), //黄金叶子
Array(1112915, 50, 1, 1), //蓝调戒指
Array(2431944, 200, 1, 1), //140级武器箱
Array(2431945, 50, 1, 1),//140级防具箱
Array(3994417, 50, 1, 1), //红蜡笔
Array(3994418, 40, 1, 1), //红蜡笔
Array(3994419, 30, 1, 1), //红蜡笔
Array(3994420, 20, 1, 1), //红蜡笔
Array(3994421, 15, 1, 1), //红蜡笔
Array(3994420, 10, 1, 1), //红蜡笔
Array(1102730, 100, 1, 1), //浓翅膀
Array(1012172, 10, 1, 1) //娃娃脸


);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4001833, 1)) {
            cm.sendYesNo("            #r『转盘转转转』 \r\n\r\n#k使用“#b1个 #z4001833##k”就可以抽奖1次#d\r\n比转蛋机的几率要高100%，另外还能抽到转蛋机里没有的物品如下：#k\r\n#v2432069#(暴军防具箱子)#v2432341#(高贵头部防具箱子)\r\n#v3994420##v1102730##v1012172##v1402014##v4000313#\r\n\r\n现在要玩转盘转转转么?");
        } else {
            cm.sendOk("           #r『转盘转转转』 \r\n\r\n#k使用“#b1个 #z4001833##k”就可以抽奖1次#d\r\n比转蛋机的几率要高100%，另外还能抽到转蛋机里没有的物品如下：#k\r\n#v3994421#   #v1102730#   #v1012172#   #v1402014#   #v4000313#  #v2432069#(暴军防具箱子)#v2431988#(鹰眼防具箱子)。。。等等\r\n#b提示：你背包里好像没有#r1个 #z4001833##k#b哦!\r\n请去消费商城购买抽奖礼包或通过其他活动获得!");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "转盘转转转", notice);
            if (item != -1) {
                cm.gainItem(4001833, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4001833##k吗？如果是，请你确认在背包的装备，消耗，#b其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("#r(获得了安慰奖：星星 10 个。)\r\n今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4001833, -1);//扣除抽奖道具转盘转转票1个
            cm.gainItem(4001839, 10);//星星
            cm.safeDispose();
        }
    }
}