var status = -1;

function action(mode, type, selection) {
	if (mode == 1) {
		status++;
	} else {
		if (status == 0) {
			cm.dispose();
		}
		status--;
	}
	if (status == 0) {
		if (cm.getPlayer().getMapId() == 350060200) {
			cm.sendYesNo("我毕生的心血，还是被你们打败了吗！");
		} else {
			cm.sendOk("呵呵。");
			cm.safeDispose();
		}
	} else if (status == 1) {
		if ((cm.getSpace(1) > 1 || cm.getSpace(2) > 1 || cm.getSpace(3) > 1 || cm.getSpace(4) > 1)) {
			cm.gainNX(2, 10000);//抵用卷
			cm.gainNX(1, 5000);//点卷
			cm.gainItem(4310156, 1);//埃苏币
			cm.gainItem(2049124, 1);//正向卷
			var item;
			var chance1 = Math.floor(Math.random() * 1000);
			if (chance1 < 50) {
				var itemList = new Array(5750000, 5062500, 5062009, 5062010, 2049116, 2049124);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 5, "格里梅尔手", 3);
			} else if (chance1 >= 50 && chance1 <= 100) {
				var itemList = new Array(4001485, 4001714, 4001715);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 3, "格里梅尔手", 3);
			} else if (chance1 > 100 && chance1 <= 200) {
				var itemList = new Array(
				/*140道具已经取消，直接给予下面的必成卷轴和惊人卷
				1003172, // 狮心战斗头盔
				1542015, 
				1102275, // 狮心战斗披风
				1082295, // 狮心战斗护腕
				1052314, // 狮心战斗锁子甲
				1072485, // 狮心战斗鞋
				1003173, // 龙尾法师帽子
				1102276, // 龙尾法师披风
				1082296, // 龙尾法师手套
				1052315, // 龙尾法师长袍
				1072486, // 龙尾法师鞋
				1003174, // 鹰翼哨兵便帽
				1102277, // 鹰翼哨兵披风
				1082297, // 鹰翼哨兵手套
				1052316, // 鹰翼哨兵服
				1072487, // 鹰翼哨兵鞋
				1003175, // 渡鸦之魂追踪者帽
				1102278, // 渡鸦之魂猎人披风
				1082298, // 渡鸦之魂追踪者手套
				1052317, // 渡鸦之魂追踪者盔甲
				1072488, // 渡鸦之魂追踪者鞋
				1003176, // 鲨齿船长帽
				1102279, // 鲨齿船长披风
				1082299, // 鲨齿船长手套
				1052318, // 鲨齿船长外套
				1072489, // 鲨齿船长鞋
				1432086, // 狮心长枪
				1442116, // 狮心长矛
				1322096, // 狮心震雷
				1422066, // 狮心巨锤
				1402095, // 狮心战刀
				1412065, // 狮心战斧
				1302152, // 狮心弯刀
				1312065, // 狮心勇斧
				1372084, // 龙尾短杖
				1382104, // 龙尾长杖
				1452111, // 鹰翼重弓
				1462099, // 鹰翼重弩
				1332130, // 渡鸦之魂（短刀）
				1472122, // 渡鸦之魂
				1342036, // 精灵角刀
				1492085, // 鲨齿手铳
				1532018, // 鲨齿鹰爪
				1302016, // 鲨齿火炮
				1522018 // 龙翼弩枪
							*/
//武器必成卷
2043003,
2043103,
2043203,
2043303,
2043703,
2043803,
2044003,
2044103,
2044203,
2044303,
2044403,
2044503,
2044603,
2044703,
2044815,
2044908,//武器必成卷结束
//其它卷
2340000,//祝福卷
5064000,//防爆卷轴
2049132,//惊人混沌卷轴30%
2049133,//惊人混沌卷轴50%
2049135,//惊人正义混沌卷轴 20%
2049137 //惊人正义混沌卷轴 40%
				);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "格里梅尔手", 3);
			} else if (chance1 > 200 && chance1 <= 995) {//出将概率在90%左右，下列装备随机
				var itemList = new Array(
				
				1212077, // 巨匠黑甲凶灵, // (无描述)
				1222072, // 巨匠天使手铳, // (无描述)
				1232071, // 巨匠死亡使者, // (无描述)
				1402204, // 巨匠巨剑, // (无描述)
				1242076, // 巨匠精神之刃, // (无描述)
				1302285, // 巨匠战剑, // (无描述)
				1312162, // 巨匠战斗切肉斧, // (无描述)
				1322213, // 巨匠大战斗锤, // (无描述)
				1332235, // 巨匠小妖精刀, // (无描述)
				1342084, // 巨匠小刀, // (无描述)
				1362099, // 巨匠手杖, // (无描述)
				1372186, // 巨匠邪恶杖, // (无描述)
				1382220, // 巨匠战斗长杖, // (无描述)
				1412144, // 巨匠战斧, // (无描述)
				1422149, // 巨匠战锤, // (无描述)
				1432176, // 巨匠战斗之矛, // (无描述)
				1442232, // 巨匠地狱之鸟, // (无描述)
				1452214, // 巨匠战斗弓, // (无描述)
				1462202, // 巨匠弩, // (无描述)
				1472223, // 巨匠黑手甲, // (无描述)
				1482177, // 巨匠狮鹫拳爪, // (无描述)
				1492188, // 巨匠无尽之枪, // (无描述)
				1522103, // 巨匠鹰弩枪, // (无描述)
				1532106, // 巨匠火炮, // (无描述)
				1542075, // 巨匠武士刀, // (无描述)
				1252058, // 巨匠光能魔法棒, // (无描述)
				1552075, // 巨匠扇, // (无描述)
				1113055, // 巨匠之戒, // (无描述)
				1032200, // 巨匠耳环, // (无描述)
				1152154, // 巨匠护肩, // (无描述)
//帽子
1003797, //- 高贵战士头盔, //- (无描述)
1003798, //- 高贵流丹维奇帽, //- (无描述)
1003799, //- 高贵游侠贝雷帽, //- (无描述)
1003800, //- 高贵刺客软帽, //- (无描述)
1003801, //- 高贵流浪者帽, //- (无描述)

//上衣
1042254, //- 鹰眼战士盔甲, //- (无描述)
1042255, //- 鹰眼丹维奇长袍, //- (无描述)
1042256, //- 鹰眼游侠斗篷, //- (无描述)
1042257, //- 鹰眼刺客衬衣, //- (无描述)
1042258, //- 鹰眼流浪者外衣, //- (无描述)

//裤子
1062165, //- 魔术师战士短裤, //- (无描述)
1062166, //- 魔术师丹维奇短裤, //- (无描述)
1062167, //- 魔术师游侠短裤, //- (无描述)
1062168, //- 魔术师刺客短裤, //- (无描述)
1062169, //- 魔术师流浪者短裤, //- (无描述)

//150武器
1212057,//, //- 天钿女命的眩光杖,//, //- (无描述)
1222052,//, //- 素盏呜尊的虹击炮,//, //- (无描述)
1232072,//, //- 天照的猛岚剑,//, //- (无描述)
1242077,//, //- 月夜见尊的天雷剑,//, //- (无描述)
1242078,//, //- 素盏呜尊的豪雷剑,//, //- (无描述)
1252056,//, //- 天钿女命的灵魂棒,//, //- (无描述)
1302229,//, //- 天照的丛云剑,//, //- (无描述)
1312118,//, //- 天照的天月斧,//, //- (无描述)
1322164,//, //- 天照的金刚杵,//, //- (无描述)
1332195,//, //- 月夜见尊的斩杀刀,//, //- (无描述)
1342071,//, //- 月夜见尊的斩死刀,//, //- (无描述)
1362069,//, //- 月夜见尊的惨鬼杖,//, //- (无描述)
1372141,//, //- 天钿女命的却鬼棒,//, //- (无描述)
1382170,//, //- 天钿女命的魔灵杖,//, //- (无描述)
1402153,//, //- 天照的御魂剑,//, //- (无描述)
1412106,//, //- 天照的鬼炎斧,//, //- (无描述)
1422109,//, //- 天照的破雳刚杵,//, //- (无描述)
1432140,//, //- 天照的风灭戟,//, //- (无描述)
1442184,//, //- 天照的天羽羽斩,//, //- (无描述)
1452172,//, //- 大山祇神的火魂弓,//, //- (无描述)
1462161,//, //- 大山祇神的大通莲弓,//, //- (无描述)
1472181,//, //- 月夜见尊的惨魔拳,//, //- (无描述)
1482142,//, //- 素盏呜尊的惨血熊千,//, //- (无描述)
1492154,//, //- 素盏呜尊的雷激枪,//, //- (无描述)
1522073,//, //- 大山祇神的龙闪弓,//, //- (无描述)
1532076,//, //- 素盏呜尊的红炎炮,//, //- (无描述)
1542045,//, //- 天照的村正,//, //- (无描述)
1552045,//, //- 天钿女命的赤花蝶扇,//, //- (无描述)

//150帽子
1003601,//, //- 天照的头盔,//, //- (无描述)
1003602,//, //- 大山祇神的帽子,//, //- (无描述)
1003603,//, //- 天钿女命的帽子,//, //- (无描述)
1003604,//, //- 月夜见尊的帽子,//, //- (无描述)
1003605,//, //- 素盏呜尊的头盔,//, //- (无描述)

//150衣服
1052509,//, //- 天照的铠甲,//, //- (无描述)
1052510,//, //- 大山祇神的铠甲,//, //- (无描述)
1052511,//, //- 天钿女命的铠甲,//, //- (无描述)
1052512,//, //- 月夜见尊的铠甲,//, //- (无描述)
1052513,//, //- 素盏呜尊的铠甲,//, //- (无描述)
1052531,//, //- 剑豪的铠甲,//, //- (无描述)

//150手套
1082472,//, //- 天照的手套,//, //- (无描述)
1082473,//, //- 大山祇神的手套,//, //- (无描述)
1082474,//, //- 天钿女命的手套,//, //- (无描述)
1082475,//, //- 月夜见尊的手套,//, //- (无描述)
1082476,//, //- 素盏呜尊的手套,//, //- (无描述)
1082442,//, //- 剑豪的铁手套,//, //- (无描述)
1082443,//, //- 神鸣之手环,//, //- (无描述)

//150鞋子
1072711,//, //- 天照的鞋子,//, //- (无描述)
1072712,//, //- 大山祇神的鞋子,//, //- (无描述)
1072713,//, //- 天钿女命的鞋子,//, //- (无描述)
1072714,//, //- 月夜见尊的鞋子,//, //- (无描述)
1072715,//, //- 素盏呜尊的鞋子,//, //- (无描述)

//150披风
1102456,//, //- 天照的披风,//, //- (无描述)
1102457,//, //- 大山祇神的披风,//, //- (无描述)
1102458,//, //- 天钿女命的披风,//, //- (无描述)
1102459,//, //- 月夜见尊的披风,//, //- (无描述)
1102460,//, //- 素盏呜尊的披风,//, //- (无描述)

//150腰带
1132156,//, //- 天照的腰带,//, //- (无描述)
1132157,//, //- 大山祇神的腰带,//, //- (无描述)
1132158,//, //- 天钿女命的腰带,//, //- (无描述)
1132159,//, //- 月夜见尊的腰带,//, //- (无描述)
1132160,//, //- 素盏呜尊的腰带,//, //- (无描述)

//150护肩
1152094,//, //- 天照的肩章,//, //- (无描述)
1152095,//, //- 大山祇神的肩章,//, //- (无描述)
1152096,//, //- 天钿女命的肩章,//, //- (无描述)
1152097,//, //- 月夜见尊的肩章,//, //- (无描述)
1152098//, //- 素盏呜尊的肩章,//, //- (无描述)
				);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "格里梅尔手", 3);
			} else {
				var itemList = new Array(5062002, 5062500, 5062009, 5062010, 2049116, 2049124);
				var itemid = itemList[Math.floor(Math.random() * itemList.length)];
				item = cm.gainGachaponItem(itemid, 1, "格里梅尔手", 3);
			}
			if (item != -1) {
				cm.warp(910000000);
				cm.dispose();
			} else {
				cm.sendOk("请你确认在背包的装备,消耗,其他窗口中是否有一格以上的空间?");
			}
		} else {
			cm.sendOk("xx错误");
		}
		cm.safeDispose();
	}
}