var status = -1;
var text;
var sel;
var rmb;
var aaa = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";

// 每个礼包所需的充值金额
var condition = new Array(10, 30, 50, 100, 200, 300, 500, 1000, 1500, 2000, 3000, 5000, 8000);
var reward = new Array( // 礼包编号、道具id、数量
	// 礼包1 10元
	Array(1, 3015144, 1),//贵族的花船椅子
	Array(1, 3010118, 1),//糖果音符椅子
	Array(1, 2430069, 1),//祖母绿宝箱
        Array(1, 5062009, 10),//超级神奇魔方
	Array(1, 5062500, 5),//大师附加神奇魔方
	Array(1, 5064000, 1),//防爆卷轴
	Array(1, 2340000, 1),//祝福卷轴
	Array(1, 4001839, 100),//星星
	Array(1, 4001785, 1),//定居金500W

	// 礼包2 30元
	Array(2, 3015049, 1),//黑色天堂火车椅
	Array(2, 3015080, 1),//被蛋卷椅子
	Array(2, 2430069, 2),//祖母绿宝箱
        Array(2, 5062009, 20),//超级神奇魔方
	Array(2, 5062500, 10),//大师附加神奇魔方
	Array(2, 5064000, 3),//防爆卷轴
	Array(2, 2340000, 3),//祝福卷轴
	Array(2, 4001839, 300),//星星
	Array(2, 4001785, 2),//定居金500W

        // 礼包3 50元
	Array(3, 1112793, 1),//快乐指环
	Array(3, 3015084, 1),//爱之骑士椅
	Array(3, 3010044, 1),//同一红伞下
	Array(3, 2430069, 3),//祖母绿宝箱
        Array(3, 5062009, 30),//超级神奇魔方
	Array(3, 5062500, 15),//大师附加神奇魔方
	Array(3, 5064000, 5),//防爆卷轴
        Array(3, 2340000, 5),//祝福卷轴
        Array(3, 4001839, 500),//星星
	Array(3, 4001785, 3),//定居金500W


	// 礼包4 100元
	Array(4, 2431945, 1),//140级防具箱
	Array(4, 3010830, 1),//天王星椅子
	Array(4, 3015087, 1),//家庭聚餐椅子
	Array(4, 3015083, 1),//萌动年糕汤火车椅
        Array(4, 2049323, 10),//高级装备强化卷轴
        Array(4, 2049750, 1),//S级潜能卷轴
        Array(4, 4033204, 5),//温暖的羽毛
	Array(4, 2430069, 5),//祖母绿宝箱
        Array(4, 5062009, 50),//超级神奇魔方
	Array(4, 5062500, 25),//大师附加神奇魔方
        Array(4, 5064000, 10),//防爆卷轴
        Array(4, 2340000, 10),//祝福卷轴
	Array(4, 4001839, 1000),//星星
	Array(4, 4001715, 1),//定居金1E
	Array(4, 5073000, 10),//心脏高级喇叭


	// 礼包5 200元
	Array(5, 2431945, 1),//140级防具箱
	Array(5, 3015178, 1),//萤火之森椅子
	Array(5, 3015109, 1),//花花幻想曲
        Array(5, 3010417, 1),//巨无霸企鹅王
        Array(5, 2431354, 1),//星火幸运箱子
        Array(5, 2049323, 20),//高级装备强化卷轴
        Array(5, 2049750, 2),//S级潜能卷轴
        Array(5, 4033204, 10),//温暖的羽毛
	Array(5, 2430069, 8),//祖母绿宝箱
        Array(5, 5062009, 80),//超级神奇魔方
	Array(5, 5062500, 40),//大师附加神奇魔方					
        Array(5, 5064000, 20),//防爆卷轴
        Array(5, 2340000, 20),//祝福卷轴
	Array(5, 4001839, 2000),//星星
	Array(5, 4001715, 2),//定居金1E					
	Array(5, 5390004, 20),//新年庆祝喇叭


       	// 礼包6 300元
	Array(6, 2431944, 1),//140级武器箱
	Array(6, 3015142, 1),//武士精神椅子
	Array(6, 3015264, 1),//奥兹的美味厨房椅子
	Array(6, 3015210, 1),//鼠鼠奶酪椅
        Array(6, 3010894, 1),//一杯咖啡的悠闲 
        Array(6, 2431354, 1),//星火幸运箱子
	Array(6, 2049323, 30),//高级装备强化卷轴
        Array(6, 2049750, 3),//S级潜能卷轴
        Array(6, 4033204, 20),//温暖的羽毛
	Array(6, 2430069, 10),//祖母绿宝箱
        Array(6, 5062009, 100),//超级神奇魔方
	Array(6, 5062500, 50),//大师附加神奇魔方
        Array(6, 5064000, 30),//防爆卷轴
        Array(6, 2340000, 30),//祝福卷轴
	Array(6, 4001839, 3000),//星星
	Array(6, 4001715, 3),//定居金1E
	Array(6, 5390004, 30),//新年庆祝喇叭
	
	
	// 礼包7 500元
	Array(7, 1112915, 1),//蓝调戒指
        Array(7, 2431945, 3),//140级防具箱
	Array(7, 3994417, 1),//红色蜡笔
	Array(7, 3015183, 1),//绿水灵背景椅子
	Array(7, 3015258, 1),//兔儿爷爷虎虎椅子
	Array(7, 3015120, 1),//少女的枕头大战
        Array(7, 3010621, 1),//蛤蛤仙人椅
        Array(7, 2431354, 2),//星火幸运箱子
        Array(7, 2049137, 5),//惊人正义混沌卷轴40%
        Array(7, 2049323, 50),//高级装备强化卷轴
        Array(7, 2049750, 5),//S级潜能卷轴
        Array(7, 4033204, 30),//温暖的羽毛
	Array(7, 2430069, 20),//祖母绿宝箱
        Array(7, 5062009, 200),//超级神奇魔方
        Array(7, 5062500, 100),//大师附加神奇魔方
        Array(7, 5064000, 50),//防爆卷轴
        Array(7, 2340000, 50),//祝福卷轴
	Array(7, 4001839, 5000),//星星
	Array(7, 4001715, 5),//定居金1E
	Array(7, 5390018, 50),//赤兔情景喇叭


	// 礼包8 1000元
	Array(8, 2432069, 1),//暴君防具交换券
	Array(8, 3994417, 1),//红色蜡笔
	Array(8, 3994419, 1),//橙色蜡笔
	Array(8, 3994418, 1),//黄色蜡笔
	Array(8, 3015049, 1),//黑色天堂火车椅
	Array(8, 3010416, 1),//巨无霸白雪人椅子
	Array(8, 3015177, 1),//寿司公仔椅子
	Array(8, 3015274, 1),//国庆节喷泉椅子
	Array(8, 3010876, 1),//行星椅子
        Array(8, 2430252, 1),//香包
        Array(8, 2049137, 10),//惊人正义混沌卷轴40%
        Array(8, 2049323, 100),//高级装备强化卷轴
        Array(8, 2049750, 10),//S级潜能卷轴
        Array(8, 4033204, 50),//温暖的羽毛
	Array(8, 2430069, 50),//祖母绿宝箱
        Array(8, 5062009, 300),//超级神奇魔方
        Array(8, 5062500, 150),//大师附加神奇魔方
        Array(8, 5064000, 100),//防爆卷轴
        Array(8, 2340000, 100),//祝福卷轴
	Array(8, 4001839, 10000),//星星
	Array(8, 4001715, 8),//定居金1E
	Array(8, 5390018, 100),//赤兔情景喇叭


	// 礼包9 1500元
	Array(9, 2432069, 1),//暴君防具交换券
        Array(9, 2432341, 1),//高贵头部防具箱子
	Array(9, 3994420, 1),//绿色蜡笔
	Array(9, 3994421, 1),//青色蜡笔
	Array(9, 3994422, 1),//蓝色蜡笔
	Array(9, 3015236, 1),//粉蛙蛙滑梯椅子
	Array(9, 3015133, 1),//亚敏下午茶椅
	Array(9, 3015134, 1),//泡泡浴椅子
	Array(9, 3015129, 1),//白色天堂椅子
	Array(9, 3010423, 1),//蘑菇椅子
        Array(9, 2430252, 2),//香包
        Array(9, 2049323, 150),//高级装备强化卷轴
        Array(9, 2049750, 15),//S级潜能卷轴
        Array(9, 2049137, 15),//惊人正义混沌卷轴40%
        Array(9, 4033204, 80),//温暖的羽毛
	Array(9, 2430069, 80),//祖母绿宝箱
        Array(9, 5062009, 500),//超级神奇魔方
        Array(9, 5062500, 250),//大师附加神奇魔方
        Array(9, 5064000, 150),//防爆卷轴
        Array(9, 2340000, 150),//祝福卷轴
	Array(9, 4001839, 10000),//星星
	Array(9, 4001716, 1),//定居金10E
	Array(9, 5390018, 80),//赤兔马情景喇叭


	// 礼包10 2000元
        Array(10, 2432069, 1),//暴君防具交换券
        Array(10, 2432341, 1),//高贵头部防具箱子
	Array(10, 3994417, 1),//红色蜡笔
	Array(10, 3994418, 1),//橙色蜡笔
	Array(10, 3994419, 1),//黄色蜡笔
	Array(10, 3994420, 1),//绿色蜡笔
	Array(10, 3994421, 1),//青色蜡笔
	Array(10, 3994422, 1),//蓝色蜡笔
	Array(10, 3010832, 1),//太阳椅子
	Array(10, 3010461, 1),//赏月专用月桂树秋千椅
	Array(10, 3015143, 1),//巨大彩色金鱼标本椅子
	Array(10, 3015131, 1),//巨大鼻涕泡椅子
	Array(10, 3015132, 1),//大粽子沙发椅
	Array(10, 3015182, 1), //蝶恋花椅子
        Array(10, 2430252, 3),//香包
        Array(10, 2049323, 200),//高级装备强化卷轴
        Array(10, 2049750, 20),//S级潜能卷轴
        Array(10, 2049137, 20),//惊人正义混沌卷轴40%
        Array(10, 4033204, 100),//温暖的羽毛
	Array(10, 2430069, 100),//祖母绿宝箱
        Array(10, 5062009, 800),//超级神奇魔方
        Array(10, 5062500, 400),//大师附加神奇魔方
        Array(10, 5064000, 200),//防爆卷轴
	Array(10, 2340000, 200),//祝福卷轴
	Array(10, 4001839, 20000),//星星
	Array(10, 4001716, 2),//定居金10E
	Array(10, 5390018, 100),//赤兔马情景喇叭


	// 礼包11 3000元
       	Array(11, 2430865, 1, 30),//VIP神秘盒子
	Array(11, 1032219, 1),//遗忘之神话耳环
	Array(11, 2432069, 1),//暴君防具交换券
        Array(11, 2432341, 1),//高贵头部防具箱子
	Array(11, 1142540, 1),//黄金勋章
	Array(11, 3994417, 2),//红色蜡笔
	Array(11, 3994418, 2),//橙色蜡笔
	Array(11, 3994419, 2),//黄色蜡笔
	Array(11, 3994420, 2),//绿色蜡笔
	Array(11, 3994421, 2),//青色蜡笔
	Array(11, 3994422, 2),//蓝色蜡笔
	Array(11, 5530457, 1),//专属饰品攻击卷
	Array(11, 5530458, 1),//专属饰品魔力卷
	Array(11, 3015197, 1),//闪耀冒险岛椅
        Array(11, 3010070, 1),//巨无霸品克宾
	Array(11, 3012024, 1),//沙滩排球椅子
        Array(11, 3010936, 1),//青蛙跳楼椅子
        Array(11, 3015075, 1),//铲雪狂人椅子
	Array(11, 3015257, 1),//月下庭院椅子
        Array(11, 2430252, 5),//香包
        Array(11, 2049323, 300),//高级装备强化卷轴
        Array(11, 2049750, 30),//S级潜能卷轴
        Array(11, 2049137, 30),//惊人正义混沌卷轴40%
        Array(11, 4033204, 120),//温暖的羽毛
	Array(11, 2430069, 120),//祖母绿宝箱
	Array(11, 5062009, 1000),//超级神奇魔方
	Array(11, 5062500, 500),//大师附加神奇魔方
	Array(11, 5064000, 300),//防爆卷轴
	Array(11, 2340000, 300),//祝福卷轴
	Array(11, 4001839, 20000),//星星
	Array(11, 4001716, 3),//定居金10E
	Array(11, 5390018, 100),//赤兔马情景喇叭


	// 礼包12 5000元
	Array(10, 1672027, 1),//极真心脏
	Array(12, 2432069, 3),//暴君防具交换券
        Array(12, 2432341, 3),//高贵头部防具箱子
	Array(12, 1182016, 1),//黄金比德曼徽章
	Array(12, 3994417, 3),//红色蜡笔
	Array(12, 3994418, 3),//橙色蜡笔
	Array(12, 3994419, 3),//黄色蜡笔
	Array(12, 3994420, 3),//绿色蜡笔
	Array(12, 3994421, 3),//青色蜡笔
	Array(12, 3994422, 3),//蓝色蜡笔
	Array(12, 5530457, 2),//专属饰品攻击卷
	Array(12, 5530458, 2),//专属饰品魔力卷 
	Array(12, 3015234, 1),//少年海滩派对
	Array(12, 3015303, 1),//幸福的花鞋椅子
	Array(12, 3016000, 1),//等等象跷跷板椅子
        Array(12, 3010853, 1),//心花怒放椅子
	Array(12, 3010660, 1), //梦幻公主城堡
        Array(12, 3012025, 1),//小鸡弹簧床椅子
        Array(12, 3015078, 1),//雏祭娃娃6
        Array(12, 2430252, 8),//香包
        Array(12, 2049323, 500),//高级装备强化卷轴
        Array(12, 2049750, 50),//S级潜能卷轴
        Array(12, 2049137, 50),//惊人正义混沌卷轴40%
        Array(12, 4033204, 150),//温暖的羽毛
	Array(12, 2430069, 150),//祖母绿宝箱
	Array(12, 5062009, 1200),//超级神奇魔方
	Array(12, 5062500, 600),//大师附加神奇魔方
	Array(12, 5064000, 500),//防爆卷轴
	Array(12, 2340000, 500),//祝福卷轴
	Array(12, 4001839, 20000),//星星
	Array(12, 4001716, 5),//定居金10E
	Array(12, 5390018, 100),//赤兔马情景喇叭



	// 礼包13 8000元
	Array(13, 2430865, 1, 60),//VIP
	Array(13, 2430813, 1, 60),//进阶精灵帽
	Array(13, 2432069, 5),//暴君防具交换券
        Array(13, 2432341, 5),//高贵头部防具箱子
	Array(13, 3994417, 5),//红色蜡笔
	Array(13, 3994418, 5),//橙色蜡笔
	Array(13, 3994419, 5),//黄色蜡笔
	Array(13, 3994420, 5),//绿色蜡笔
	Array(13, 3994421, 5),//青色蜡笔
	Array(13, 3994422, 5),//蓝色蜡笔
	Array(13, 5530457, 3),//专属饰品攻击
	Array(13, 5530458, 3),//专属饰品魔力
	Array(13, 3010938, 1),//异界血腥女王椅子
	Array(13, 3010821, 1),//童年玩具椅子
	Array(13, 3015009, 1),//小苹果椅子
        Array(13, 3015051, 1),//巨无霸国际巨星椅子
	Array(13, 3015002, 1),//摩天轮
	Array(13, 3015014, 1),//千君一发椅子
	Array(13, 3015193, 1),//被驯服的鲸鱼椅子
        Array(13, 3010658, 1),//夏日西瓜冰椅子
        Array(13, 2430252, 10),//香包
        Array(13, 2049323, 800),//高级装备强化卷轴
        Array(13, 2049750, 80),//S级潜能卷轴
        Array(13, 2049137, 80),//惊人正义混沌卷轴40%
        Array(13, 4033204, 180),//温暖的羽毛
	Array(13, 2430069, 180),//祖母绿宝箱
	Array(13, 5062009, 1500),//超级神奇魔方
	Array(13, 5062500, 750),//大师附加神奇魔方
	Array(13, 5064000, 800),//防爆卷轴
	Array(13, 2340000, 800),//祝福卷轴
	Array(13, 4001839, 20000),//星星
	Array(13, 4001716, 8),//定居金10E
	Array(13, 5390018, 100)//赤兔马情景喇叭

);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0) {
		cm.dispose();
		return;
	}
	if (mode == 1) {
		status++;
	} else {
		status--;
	}

	rmb = cm.getRMB();//getTotalRMB
	var curlevel = -1;

	if (status == 0) {
		text = "您累计充值金额为： #r" + rmb + "#k 元\r\n\r\n#r请选择#b\r\n";
		for (var i = 1; i <= condition.length; i++) {
			text += "#b#L" + i + "#" + aaa + " 累计充值 #r" + condition[i - 1] + " #b元奖励";
			if (cm.getBossLogAcc("累计充值礼包" + i) == -1) {
				text += "(已领取)";
				curlevel = curlevel == -1 ? i : curlevel;
			}
			text += "#l\r\n";
		}
		text += "#k";
		cm.sendSimple(text);
	} else if (status == 1) {
		sel = selection;
		text = "\t\t\t\t#e#r- 累计充值" + condition[selection - 1] + "元奖励 -#k#n\r\n\r\n";
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == selection) {
				text += "\t\t\t#i" + reward[i][1] + "# #z" + reward[i][1] + "#[" + reward[i][2] + "个]\r\n";
			}
		}
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (cm.getBossLogAcc("累计充值礼包" + sel) == -1) {
			cm.sendOk("这个礼包您已经领取过了");
			cm.dispose();
			return;
		}
		if (rmb < condition[sel - 1]) {
			cm.sendOk("累计充值金额不足，无法领取。");
			cm.dispose();
			return;
		}
		var rewardlist = new Array();
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == sel) {
				if (reward[i][3] == null)
					reward[i][3] = -1;
				rewardlist.push(new Array(reward[i][1], reward[i][2], reward[i][3]));
			}
		}
		if (!cm.canHoldSlots(rewardlist.length)) {
			cm.sendOk("包裹空间不足，请确保包裹每个栏位有至少 " + rewardlist.length + " 格空间");
			cm.dispose();
			return;
		}
		for (var i = 0; i < rewardlist.length; i++) {
			if (rewardlist[i][0] == 2430865) {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1], rewardlist[i][2]);
			} else {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1]);
			}
		}
		cm.setBossLogAcc("累计充值礼包" + sel, -2);
		cm.playerMessage(1, "领取成功！");
		cm.channelMessage(0x18, "『累计充值奖励』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了累计充值 " + condition[sel - 1] + " 元奖励。");
		cm.dispose();
	}
}