var status = -1;
var text;
var sel;
var rmb;
var aaa = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";

// 每个礼包所需的充值金额
var condition = new Array(10, 50, 100, 200, 300, 500, 1000, 1500, 2000, 3000, 5000);
var reward = new Array( // 礼包编号、道具id、数量
	// 礼包1 10元
	Array(1, 3015144, 1),//贵族的花船椅子
	//Array(1, 3015049, 1), //黑色天堂火车椅
	//Array(1, 3015058, 1),//黑色天堂火车椅
	Array(1, 2430069, 1),//祖母绿宝箱
	Array(1, 1112793, 1),
	Array(1, 3010118, 1),
	Array(1, 2340000, 1),
	Array(1, 2049137, 1),
	Array(1, 4001839, 100), //星星
	Array(1, 4001785, 2), //定居金500W

	// 礼包2 50元
	//Array(2, 3015197, 1), //闪耀冒险岛椅
	Array(2, 3015084, 1),//爱之骑士椅
	Array(2, 3015080, 1),//被蛋卷椅子
	//Array(2, 3015078, 1),//雏祭娃娃6
	Array(2, 2430069, 5),//祖母绿宝箱
	Array(2, 2431945, 1),//140级防具箱
        Array(2, 5062009, 50), //
	Array(2, 5062500, 50),
        Array(2, 2049323, 5),
        Array(2, 2049750, 1),
        Array(2, 2340000, 5),
        //Array(2, 2433654, 1),
        Array(2, 4001006, 20),//火焰羽毛
        Array(2, 4001839, 500), //星星


	// 礼包3 100元
	//Array(3, 3015181, 1),//仲夏夜之梦椅子
	Array(3, 3010830, 1), // 天王星椅子
	Array(3, 3015087, 1),//家庭聚餐椅子
	Array(3, 3015083, 1),//萌动年糕汤火车椅
	Array(3, 2430069, 10),//祖母绿宝箱
	Array(3, 2431945, 1),//140级防具箱
	Array(3, 2431944, 1),//140级武器箱
        Array(3, 5062009, 100),
	Array(3, 5062500, 100),
        //Array(3, 2049323, 30),//高级装备强化卷轴
        Array(3, 2340000, 10),
        Array(3, 5064000, 10),
        Array(3, 4001006, 10),//火焰羽毛
	Array(3, 4001839, 1000), //星星
	Array(3, 4001785, 10), // 定居金500W 金币
	Array(3, 5073000, 30), //心脏喇叭



	// 礼包4 200元
	Array(4, 3015178, 1),//萤火之森椅子
	//Array(4, 3015177, 1),//寿司公仔椅子
	//Array(4, 3015182, 1), //蝶恋花椅子
	Array(4, 3015109, 1),//花花幻想曲
	Array(4, 2430069, 20),//祖母绿宝箱
	Array(4, 2431945, 3),//140级防具箱
        Array(4, 5062009, 200),
	Array(4, 5062500, 200),
        Array(4, 2049323, 10),//高级装备强化卷轴					
        Array(4, 5064000, 20),
        Array(4, 2340000, 15),
        Array(4, 2431354, 1),
        Array(4, 2049750, 1),
        Array(4, 4001006, 20),//火焰羽毛
        Array(4, 3010417, 1),
	Array(4, 4001839, 2000), //星星					
	Array(4, 5390004, 50), //新年喇叭
	Array(4, 4001715, 1), // 定居金1 E


	// 礼包5 300元
	Array(5, 1112915, 1), //蓝调戒指
	Array(5, 3015142, 1),//武士精神椅子
	//Array(5, 3015263, 1),//黄蛙蛙滑梯椅子
	Array(5, 3015264, 1),//奥兹的美味厨房椅子
	Array(5, 3015210, 1),//鼠鼠奶酪椅
	//Array(5, 3015257, 1),//月下庭院椅子
	Array(5, 2430069, 20),//祖母绿宝箱
       // Array(5, 2432255, 1),
        Array(5, 5062009, 300),
	Array(5, 5062500, 300),
	Array(5, 2049323, 20),
        Array(5, 5064000, 25),

        Array(5, 2340000, 20),
        Array(5, 2431354, 1),
        Array(5, 4001006, 30),//火焰羽毛
        Array(5, 3012025, 1),

	Array(5, 5390004, 80), //新年喇叭

	Array(5, 4001715, 2), // 定居金1E

	// 礼包6 500元

	Array(6, 3015183, 1),//绿水灵背景椅子
	//Array(6, 3015234, 1),//少年的海滩派对
	Array(6, 3015258, 1), //兔儿爷爷虎虎椅子
	Array(6, 3015120, 1),//少女的枕头大战
	Array(6, 2430069, 20),//祖母绿宝箱
        Array(6, 5062009, 500),	
        Array(6, 2049323, 30),
        Array(6, 5062500, 500),
        Array(6, 5064000, 30),
        Array(6, 2431354, 2),
        Array(6, 2340000, 30),
        Array(6, 4001006, 50),	//火焰羽毛
        Array(6, 3010621, 1),
	Array(6, 4001839, 5000), //星星
	Array(6, 5390018, 50), //赤兔喇叭
	Array(6, 4001715, 3), // 定居金1E


	// 礼包7 1000元
        //Array(7, 2432507, 1), //
	Array(7, 2432069, 1), //暴君箱子
	//Array(7, 3015303, 1), //"幸福的花鞋椅子
	Array(7, 3015049, 1),  //黑色天堂火车椅
	Array(7, 3010832, 1), // 太阳椅子
	Array(7, 3010416, 1), // 巨无霸白雪人椅子
	Array(7, 3015177, 1), //寿司公仔椅子
	Array(7, 3015274, 1),//国庆节喷泉椅子
	Array(7, 2430069, 30),//祖母绿宝箱
        Array(7, 5062009, 1000),
        Array(7, 2049323, 50),
        Array(7, 5062500, 1000),
        Array(7, 5064000, 35),
        Array(7, 4001006, 100),//火焰羽毛
        Array(7, 2340000, 35),	
        Array(7, 2433695, 3),
	Array(7, 3994417, 1), // 红色蜡笔
	Array(7, 3994418, 1), // 黄色蜡笔
	Array(7, 3994419, 1), // 橙色蜡笔
	Array(7, 4001839, 8000), //星星
	Array(7, 4001715, 5), // 定居金1E


	// 礼包8 1500元
        //Array(8, 2432506, 1),
        Array(8, 2432341, 1),//鲁塔比斯防具箱子
	Array(8, 2432069, 1), // 暴君箱子
	//Array(8, 3015227, 1),//与莫拉野餐椅子
	Array(8, 3015236, 1),//粉蛙蛙滑梯椅子
	Array(8, 3015133, 1),//亚敏下午茶椅
	Array(8, 3015134, 1), //泡泡浴椅子
	Array(8, 3015129, 1),//白色天堂椅子
	Array(8, 2430069, 30),//祖母绿宝箱
        //Array(8, 3010658, 1),//夏日西瓜冰椅子
        Array(8, 5062009, 1000),
        Array(8, 2049323, 100),
        Array(8, 5062500, 1000),
        Array(8, 5064000, 40),
        Array(8, 3015075, 1),
        Array(8, 2340000, 40),
        Array(8, 4001006, 200),//火焰羽毛
        Array(8, 2433695, 3),
	Array(8, 3994420, 1), //绿色蜡笔
	Array(8, 3994421, 1), // 青色蜡笔
	Array(8, 3994422, 1), //蓝色蜡笔
	Array(8, 4001839, 10000), //星星
	Array(8, 5390018, 80), // 赤兔马喇叭
	Array(8, 4001716, 1), //定居金10E



	// 9 2000元
        Array(9, 2432069, 1),//暴君防具交换卷
        Array(9, 2432341, 1),//鲁塔比斯防具箱子
        //Array(9, 1032219, 1),//遗忘之神话耳环
	//Array(9, 3015224, 1),//梦幻水晶球椅子
	//Array(9, 3015225, 1), //和大象一起自拍椅子
	Array(9, 3010461, 1), //赏月专用月桂树秋千椅
	Array(9, 3015143, 1),//巨大彩色金鱼标本椅子
	Array(9, 3015131, 1),//巨大鼻涕泡椅子
	Array(9, 3015132, 1),//大粽子沙发椅
	Array(9, 2430069, 30),//祖母绿宝箱
        Array(9, 5062009, 1000),
        Array(8, 2049323, 100),
        Array(9, 5062500, 1000),
        Array(9, 2049349, 1),
	Array(9, 2340000, 50),
        Array(9, 5064000, 50),
        Array(9, 2049137, 30),
        Array(9, 4001006, 300),//火焰羽毛
        //Array(9, 3015051, 1),//巨无霸国际巨星椅子
       // Array(9, 3010853, 1),//心花怒放椅子
	Array(9, 3994418, 1), //  橙色蜡笔
	Array(9, 3994417, 1), // 红色蜡笔
	Array(9, 3994419, 1), // 黄色蜡笔
	Array(9, 3994420, 1), // 绿色蜡笔
	Array(9, 3994421, 1), // 青色蜡笔
	Array(9, 3994422, 1), //蓝色蜡笔
	Array(9, 4001839, 15000), //星星
	Array(9, 5390018, 100), // 赤兔喇叭
	Array(9, 4001716, 1), // 定居金10E

	//10 3000元
        //Array(10, 2046829, 5),
	Array(10, 2430865, 1, 30), //VIP
	Array(10, 1032219, 1),//遗忘之神话耳环
        Array(10, 2432341, 2),//鲁塔比斯防具箱子
	Array(10, 2432069, 2), // 暴君箱子
	Array(10, 3015328, 1),//"冒险岛电动缆车椅子
	//Array(10, 3015349, 1),//"青蛙摇摇机椅子
	Array(10, 3015193, 1),//被驯服的鲸鱼椅子
	Array(10, 3010070, 1), // 巨无霸品克宾
	Array(10, 3012024, 1), // 沙滩排球椅子
	Array(10, 2430069, 30),//祖母绿宝箱
        Array(10, 2047978, 10),
        Array(10, 3010936, 1),//青蛙跳楼椅子
       // Array(10, 3010894, 1),//一杯咖啡屋椅子
        Array(10, 2049122, 20),
	//Array(10, 2049124, 50), // 正向混沌
	Array(10, 5064000, 100), // 防暴
	//Array(10, 2340000, 100), // 祝福
	//Array(10, 2049137, 80), // 惊人正义
	//Array(10, 4310036, 5000), // 征服币
	//Array(10, 2049116, 50), // 强混
        Array(10, 2049323, 100),
	Array(10, 4001006, 400),//火焰羽毛

	Array(10, 5530457, 3), // 专属饰品攻击卷
	Array(10, 5530458, 3), // 专属饰品魔力卷
	Array(10, 3994417, 2), //  红色蜡笔
	Array(10, 3994418, 2), // 橙色蜡笔
	Array(10, 3994419, 2), // 黄色蜡笔
	Array(10, 3994420, 2), // 绿色蜡笔
	Array(10, 3994421, 2), // 青色蜡笔
	Array(10, 3994422, 2), // 蓝色蜡笔
	Array(10, 4001839, 20000), //星星
	Array(10, 5062009, 1000), // 超级魔方
	//Array(10, 4310030, 5000), // 运动币

	Array(10, 5062500, 1000), // 大师附加

	//Array(10, 3010423, 1), // 蘑菇椅子

	//Array(10, 3010876, 1), // 行星椅子
	//Array(10, 1672027, 1), // 极真心脏
	Array(10, 1142540, 1), // 黄金勋章
	Array(10, 5390018, 100), // 赤兔喇叭
	Array(10, 4001716, 1), // 定居金10


	//11 5000元
	Array(11, 1142742, 1),
        Array(11, 2432341, 3),
	Array(11, 2432069, 3), // 暴君箱子
	//Array(11, 3015304, 1),//哗啦啦大水车
	Array(11, 3015234, 1),//少年海滩派对
	Array(11, 3015303, 1),//幸福的花鞋椅子
	Array(11, 3016000, 1),
	Array(11, 3010660, 1), //梦幻公主城堡
	Array(11, 3010696, 1), // 大黄鸭
	Array(11, 3012022, 1), // 小火车椅子
	Array(11, 3015002, 1), //摩天轮
	Array(11, 2430069, 30),//祖母绿宝箱
	Array(11, 2049323, 100),
	Array(11, 5530457, 5), // 专属饰品攻击卷
	Array(11, 5530458, 5), // 专属饰品魔力卷 

        Array(11, 4001006, 1000),//火焰羽毛
	Array(11, 3994420, 3), // 绿色蜡笔
	Array(11, 3994417, 3), // 红色蜡笔
	Array(11, 3994418, 3), // 橙色蜡笔
	Array(11, 3994419, 3), // 黄色蜡笔
	Array(11, 3994421, 3), // 青色蜡笔
	Array(11, 3994422, 3), // 蓝色蜡笔
	Array(11, 4001839, 30000), //星星
	Array(11, 5062500, 1000), // 大师附加
	Array(11, 5064000, 200), // 防暴
	Array(11, 2340000, 200), // 祝福
	Array(11, 2049137, 100), // 惊人正义
	Array(11, 1182016, 1), //黄金比德曼徽章
	Array(11, 5062009, 1000), //超级魔方
	Array(11, 5390018, 100), //赤兔喇叭
	Array(11, 4001716, 2) // 定居金10E


	/*//12 5000元
	Array(12, 4310129, 3000), //冬季限量硬币
	Array(12, 2430865, 1, 60), //VIP
	Array(12, 2432069, 10), // 暴君箱子
	Array(12, 2049323, 200), // 无损
	Array(12, 2049405, 10), // 冒险心潜能卷
	Array(12, 3994421, 6), // 青色蜡笔
	Array(12, 3994417, 6), // 红色蜡笔
	Array(12, 3994418, 6), // 橙色蜡笔
	Array(12, 3994419, 6), // 黄色蜡笔
	Array(12, 3994420, 6), // 绿色蜡笔
	Array(12, 3994422, 6), //蓝色蜡笔
	Array(12, 2432353, 100), //开心转盘票
	Array(12, 4001839, 100000), //星星
	Array(12, 5062002, 500), // 高级魔方
	Array(12, 5062500, 500), // 大师附加
	Array(12, 5064000, 500), // 防暴
	Array(12, 2340000, 500), // 祝福
	Array(12, 5062009, 500), // 超级魔方
	Array(12, 3010660, 1), //梦幻公主城堡
	Array(12, 3010696, 1), // 大黄鸭
	Array(12, 3010955, 1), // 新运金蛋椅子
	Array(12, 3010938, 1), // 异界血腥女王椅子
	Array(12, 3010821, 1), // 童年玩具椅子
	Array(12, 3015009, 1), // 小苹果椅子
	Array(12, 1142788, 1), // 进击巨人勋章
	Array(12, 3012022, 1), // 小火车椅子
	Array(12, 3015002, 1), //摩天轮
	Array(12, 2049116, 300), // 强混
	Array(12, 4310036, 20000), // 征服币
	Array(12, 5530457, 5), //专属饰品攻击
	Array(12, 5530458, 5), //专属饰品魔力
	Array(12, 2049137, 300), // 惊人正义
	Array(12, 1142593, 1), // 13个星星勋章
	Array(12, 3015014, 1), //千君一发椅子
	Array(12, 5390018, 500), // 赤兔喇叭
	Array(12, 4001716, 3)*/
);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0) {
		cm.dispose();
		return;
	}
	if (mode == 1) {
		status++;
	} else {
		status--;
	}

	rmb = cm.getTotalRMB();
	var curlevel = -1;

	if (status == 0) {
		text = "您累计充值金额为： #r" + rmb + "#k 元\r\n\r\n#r请选择#b\r\n";
		for (var i = 1; i <= condition.length; i++) {
			text += "#b#L" + i + "#" + aaa + " 累计充值 #r" + condition[i - 1] + " #b元奖励";
			if (cm.getBossLogAcc("累计充值礼包" + i) == -1) {
				text += "(已领取)";
				curlevel = curlevel == -1 ? i : curlevel;
			}
			text += "#l\r\n";
		}
		text += "#k";
		cm.sendSimple(text);
	} else if (status == 1) {
		sel = selection;
		text = "\t\t\t\t#e#r- 累计充值" + condition[selection - 1] + "元奖励 -#k#n\r\n\r\n";
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == selection) {
				text += "\t\t\t#i" + reward[i][1] + "# #z" + reward[i][1] + "#[" + reward[i][2] + "个]\r\n";
			}
		}
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (cm.getBossLogAcc("累计充值礼包" + sel) == -1) {
			cm.sendOk("这个礼包您已经领取过了");
			cm.dispose();
			return;
		}
		if (rmb < condition[sel - 1]) {
			cm.sendOk("累计充值金额不足，无法领取。");
			cm.dispose();
			return;
		}
		var rewardlist = new Array();
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == sel) {
				if (reward[i][3] == null)
					reward[i][3] = -1;
				rewardlist.push(new Array(reward[i][1], reward[i][2], reward[i][3]));
			}
		}
		if (!cm.canHoldSlots(rewardlist.length)) {
			cm.sendOk("包裹空间不足，请确保包裹每个栏位有至少 " + rewardlist.length + " 格空间");
			cm.dispose();
			return;
		}
		for (var i = 0; i < rewardlist.length; i++) {
			if (rewardlist[i][0] == 2430865) {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1], rewardlist[i][2]);
			} else {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1]);
			}
		}
		cm.setBossLogAcc("累计充值礼包" + sel, -2);
		cm.playerMessage(1, "领取成功！");
		cm.channelMessage(0x18, "『累计充值奖励』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了累计充值 " + condition[sel - 1] + " 元奖励。");
		cm.dispose();
	}
}