var status = 0;
var ttt6 ="#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var aa ="#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#";
var hwtext=new Array("人长得漂亮不如活得漂亮！","当裤子失去皮带，才懂得什麽叫做依赖。","烟不听话，所以我们'抽烟'。","你发怒一分钟，便失去60秒的幸福。","当男人遇见女人，从此只有纪念日，没有独立日。","路见不平一声吼，吼完继续往前走。","幸福是个比较级，要有东西垫底才感觉得到。","知识就像内裤，看不见但很重要","作为失败的典型，你实在是太成功了","女人喜欢长得坏坏的男人，不是喜欢长坏了的男人","跌倒了，爬起来再哭","你若流泪，先湿的是我的心","让未来到来，让过去过去","我自横刀向天笑，笑完之后去睡觉","别跟我谈感情，谈感情伤钱","孤单是一个人的狂欢，狂欢是一群人的孤单","姐不是收破烂的，做不到让你随喊随到","我不是草船，你的贱别往我这发","你的矮是终身的，我的胖却是暂时的","別在无聊的时候來找我，不然显得我是多余的","姐不是电视机，不要老是盯着姐看","即使你已名花有主、我也要移花接木","心里只有你一个频道 最可恨的是还没有广告","给你最大的报复，就是活的比你幸福","要不是老师说不能乱扔垃圾，不然我早把你扔出去","没有癞蛤蟆，天鹅也会寂寞","我是光棍我可耻，我给国家浪费纸","人生没有如果，只有后果和结果","你那么有钱 为什么不让鬼来推磨？","别把人和狗相提并论，狗最起码忠诚","生活嘛，就是生下来，活下去","当你披上了婚纱 我也披上了袈裟","趁着年轻把能干的坏事都干了吧，没几年了","我人生只会两件事 1 这也不会 2 那也不会","出租车司机，司机中的战斗机，噢耶! ","思想有多远，你就给我滚多远!","人生最大的悲哀是青春不在,青春痘却还在。","最简单的长寿秘决:保持呼吸，不要断气~","打死我也不说，你们还没使美人计呢!","不要和我比懒,我懒得和你比","我不是个随便的人 我随便起来不是人","不怕虎一样的敌人，就怕猪一样的队友","老虎不发威 你当我是HELLO KITTY！","吃自助最高境界：扶墙进，扶墙出。","爷爷都是从孙子走过来的……","夏天就是不好，穷的时候我连西北风都没得喝","没什么事就不要找我，有事了更不要找我。","我想早恋，可是已经晚了……","钱可以解决的问题都不是问题。","天哪，我的衣服又瘦了！","不吃饱哪有力气减肥啊？","连广告也信，读书读傻了吧？","人怕出名猪怕壮，男怕没钱女怕胖。","如果有钱也是一种错，我情愿一错再错","命运负责洗牌，但是玩牌的是我们自己！","好好活着，因为我们会死很久!","人又不聪明，还学人家秃顶！","我总在牛a与牛c之间徘徊。","不怕被人利用，就怕你没用。","鄙视我的人这么多，你算老几? ","秀发去无踪，头屑更出众！","春色满园关不住，我诱红杏出墙来。","问世间情为何物？一物降一物","bmw是别摸我，msn是摸死你","女为悦己者容,男为悦己者穷！ ","念了十几年书，还是幼儿园比较好混");

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (cm.getMapId() == 180000001) {
            cm.sendOk("很遗憾，您因为违反用户守则被禁止游戏活动，如有异议请联系管理员.")
            cm.dispose();
        } 
    else if (status == 0) {
		var hwchance= Math.floor(Math.random()*hwtext.length);
		var selStr = "#d幽默时刻:"+hwtext[hwchance]+"#k\r\n\r\n";
		selStr += "#r重要提示；能量每天0点自动清零，请合理提交能量#k\r\n";
		selStr += "#r重要提示；能量每天0点自动清零，请合理提交能量#k\r\n";
		selStr += "#r重要提示；能量每天0点自动清零，请合理提交能量#k\r\n";
		selStr += ""+aa+"\r\n";
		selStr += "- #d#e欢迎使用翅膀升级系统：#n#k\r\n\r\n";
		selStr += "#L0#"+ttt6+" #b1). 翅膀进阶强化属性#k#l\r\n";
		selStr += "#L1#"+ttt6+" #b2). 领取翅膀开启进阶系统#k#l\r\n";
		selStr += "#L2#"+ttt6+" #b3). #r#z4033204##b获得方式条件#k#l\r\n";
		cm.sendSimple(selStr);
    } else if (status == 1) {
        switch (selection) {
        case 0:
         if (cm.getBossLog("初阶段翅膀领取",1) >= 1) {
            cm.dispose();
            cm.openNpc(9310144, 28);
	} else {
	    cm.sendOk("#b未查询到您有初阶段翅膀,无法让您使用翅膀进阶功能#k\r\n\r\n"+aa+"\r\n- #d#e进阶翅膀说明#k#n\r\n\r\n#b1). 请点击领取翅膀领取初阶翅膀。\r\n#r2). 请把要进阶的翅膀放在背包第一格。");
	    cm.dispose();
	}
            break;
        case 1:
	if (cm.getBossLog("初阶段翅膀",1) == 0 && cm.getSpace(1) > 1) {
	    cm.gainItem(1102729, 1);
	    cm.setBossLog("初阶段翅膀",1);
	    cm.setBossLog("初阶段翅膀领取",1);
	    cm.worldSpouseMessage(0x20, "『进阶翅膀』 : 玩家 " + cm.getChar().getName() + " 领取了初阶段翅膀开启了进阶之路。");
	    cm.sendOk(" #b成功领取了初阶段翅膀一个。请妥善保管每次进阶的翅膀。下次再无法从我这里领取初级翅膀了。");
            cm.dispose();
	} else {
	    cm.sendOk("#b您已经领取过。或者背包已满。#k\r\n\r\n"+aa+"\r\n- #d#e进阶翅膀说明#k#n\r\n\r\n#b1). 请点击领取翅膀领取初阶翅膀。\r\n#r2). 请把要进阶的翅膀放在背包第一格。");
	    cm.dispose();
	}
            break;
	case 2:
	    cm.sendOk("#b您当前一共有温暖的羽毛： #r" + cm.getItemQuantity("4033204") + " #b个#k\r\n\r\n"+aa+"\r\n- #d#e#r#z4033204#获得方式#k#n\r\n\r\n#b1). 通过充值消费金额进行购买。\r\n#b2). 通过Gm举办在线活动时候获得。");
	    cm.dispose();
	    break;












}
    }
}