var status = -1;

function action(mode, type, selection) {
	if (mode == 1) {
		status++;
	} else {
		if (status == 0) {
			cm.dispose();
		}
		status--;
	}
	if (status == 0) {
		if ((cm.getSpace(1) > 1 || cm.getSpace(2) > 1 || cm.getSpace(3) > 1 || im.getSpace(4) > 1)) {
			cm.sendYesNo("这里是赞助积分免费抽奖专区。#b1元=1积分#k#n\r\n需要 [100积分] 才能抽奖一次,我背包里面包含了\r\n#r#i1522094#,#i2431991#,#i2049405#,#i2049750#,#i1012438#,#i2432069#,#i1072737#,#i1122242#,#i2431993#,#i2046913#,#i2046577#,#i2046763#,#i2613000#,#i3010658#,#i3010832#,#i3015015#,#i3010070#,#i2431988#,#i1003172#,#i1402014##k#n等。\r\n我这里道具样样是精品,奖品特别丰富哦快来抽奖吧! \r\n每赞助[100元]可以抽奖一次,你确定要抽奖吗？");
		} else {
			cm.sendOk("我凑,你想坑死我呀,你能不能不要坑爹了,您背包空间不足,或者您没有赞助奇妙服务器费用#b[100元]#k#n,没有#b100#k#n积分，请整理您的背后或赞助后再来点我");
			cm.safeDispose();
		}
	} else if (status == 1) {
		var points = getMyPoints();
		if (points < 100) {
			cm.sendOk("我草,你坑爹呀,不带你这么坑爹的吧,您当前充值积分已经小于  100元  ,请去赞助充值后再来抽奖吧,");
			cm.dispose();
			return;
		}
		gainPoint(-100);
		if ((cm.getSpace(1) > 1 || cm.getSpace(2) > 1 || cm.getSpace(3) > 1 || im.getSpace(4) > 1)) {
			var item = -1;
			var chance = Math.floor(Math.random() * 30);
			var text = "";
			if (chance >= 0 && chance <= 6) {
				cm.gainExp(2000000000);
				text = "恭喜你牛气冲天获得了20E经验值。";
				cm.worldMessage("恭喜玩家" + cm.getChar().getName() + "牛气冲天,在现金冲值转盘中吸取20E经验。请再来一次,终极大奖等你来领取");
				cm.dispose();
			} else if (chance >= 7 && chance <= 10) {
				cm.gainMeso(100000000);
				text = "恭喜你牛气冲天获得了1E金币。请再来一次,超级大奖等你来领取";
				cm.worldMessage("恭喜玩家" + cm.getChar().getName() + "牛气冲天,在现金充值积分转盘中无意拿到1E支票。请再来一次,超级大奖等你来领取");
				cm.dispose();
			} else {

				var chance1 = Math.floor(Math.random() * 500);
				if (chance1 > 450) {
					var itemList = new Array(
						1532098, // 法弗纳荣耀炮 - (无描述)
						1522094, // 法弗纳双风翼弩 - (无描述)
						1492179, // 法弗纳左轮枪 - (无描述)
						1482168, // 法弗纳巨狼之爪 - (无描述)
						1472214, // 法弗纳危险之手 - (无描述)
						1462193, // 法弗纳风翼弩 - (无描述)
						1452205, // 法弗纳追风者 - (无描述)
						1442223, // 法弗纳半月宽刃斧 - (无描述)
						1432167, // 法弗纳贯雷枪 - (无描述)
						1422140, // 法弗纳闪电锤 - (无描述)
						1412135, // 法弗纳战斗切肉斧 - (无描述)
						1402196, // 法弗纳忏悔之剑 - (无描述)
						1382208, // 法弗纳魔冠之杖 - (无描述)
						1372177, // 法弗纳魔力夺取者 - (无描述)
						1362090, // 法弗纳洞察手杖 - (无描述)
						1342082, // 法弗纳急速之刃 - (无描述)
						1332225, // 法弗纳大马士革剑 - (无描述)
						1322203, // 法弗纳戈耳迪锤 - (无描述)
						1312153, // 法弗纳双刃切肉斧 - (无描述)
						1302275, // 法弗纳银槲之剑 - (无描述)
						1242061, // 法弗纳精神之刃 - 鲁塔比斯套装(海盗)专用武器
						1242060, // 法弗纳精神之刃 - 鲁塔比斯套装(飞侠)专用武器
						1232057, // 法弗纳死亡使者 - (无描述)
						1222058, // 法弗纳天使手铳 - (无描述)
						1003797, // 高贵战士头盔 - (无描述)
						1003798, // 高贵流丹维奇帽 - (无描述)
						1003799, // 高贵游侠贝雷帽 - (无描述)
						1003800, // 高贵刺客软帽 - (无描述)
						1003801, // 高贵流浪者帽 - (无描述)
						1042254, // 鹰眼战士盔甲 - (无描述)
						1042255, // 鹰眼丹维奇长袍 - (无描述)
						1042256, // 鹰眼游侠斗篷 - (无描述)
						1042257, // 鹰眼刺客衬衣 - (无描述)
						1042258, // 鹰眼流浪者外衣 - (无描述)
						1062165, // 魔术师战士短裤 - (无描述)
						1062166, // 魔术师丹维奇短裤 - (无描述)
						1062167, // 魔术师游侠短裤 - (无描述)
						1062168, // 魔术师刺客短裤 - (无描述)
						1062169, // 魔术师流浪者短裤 - (无描述)
						1212063, // 法弗纳魔力源泉杖 - (无描述)
						2431938, // FFN武器材料箱子
						2431991, // 冒险心箱子
						2049405, // 真觉冒险心潜能卷
						2049750, // S级潜能卷轴
						2432069, // 暴君箱子
						1012438, //漩涡
						1022211, //漩涡
						1032224, //漩涡
						1122269, //漩涡
						1132247, //漩涡
						1152160, //漩涡
						1003976, //漩涡
						1102623, //漩涡
						1082556, //漩涡
						1052669, //漩涡
						1072670, //漩涡
						1212089, //漩涡双头杖
						1222084, //漩涡
						1232084, //漩涡
						1302297, //漩涡
						1312173, //漩涡
						1222223, //漩涡
						1332247, //漩涡
						1342090, //漩涡
						1362109, //漩涡
						1372195, //漩涡
						1382231, //漩涡
						1402220, //漩涡
						1412152, //漩涡
						1422158, //漩涡
						1432187, //漩涡
						1442242, //漩涡
						1452226, //漩涡
						1462213, //漩涡
						1472235, //漩涡
						1482189, //漩涡
						1492199, //漩涡
						1522113, //漩涡
						1532118, //漩涡
						1252033, //漩涡虎梳魔法棒
						1072737, // 诺巴西亚戴斯靴           等级: 110
						1072738, // 诺巴赫尔梅斯靴           等级: 110
						1072739, // 诺巴凯伦靴               等级: 110
						1072740, // 诺巴利卡昂靴             等级: 110
						1072741, // 诺巴阿尔泰靴             等级: 110
						1102476, // 诺巴西亚戴斯披风         等级: 110
						1102477, // 诺巴赫尔梅斯披风         等级: 110
						1102478, // 诺巴凯伦披风             等级: 110
						1102479, // 诺巴利卡昂披风           等级: 110
						1102480, // 诺巴阿尔泰披风           等级: 110
						1132169, // 诺巴西亚戴斯腰带         等级: 110
						1132170, // 诺巴赫尔梅斯腰带         等级: 110
						1132171, // 诺巴凯伦腰带             等级: 110
						1132172, // 诺巴利卡昂腰带           等级: 110
						1132173, // 诺巴阿尔泰腰带           等级: 110
						1122242, // 超越的心之项链           等级: 75
						1122243, // 超越的心之项链           等级: 75
						1122244, // 超越的心之项链           等级: 75
						1122245, // 超越的心之项链           等级: 75
						1122241, // 超越的心之项链           等级: 75
						2431993, // 最高呗首饰箱子
						2046913, // 宿命正义单手武器攻击力卷轴 100%
						2046914, // 宿命正义单手武器魔力卷轴 100%
						2046173, // 宿命正义双手武器攻击力卷轴 100%
						2046577, // 宿命正义防具力量卷轴 100%
						2046578, // 宿命正义防具智力卷轴 100%
						2046579, // 宿命正义防具敏捷卷轴 100%
						2046580, // 宿命正义防具运气卷轴 100%
						2046763, // 宿命正义饰品力量卷轴 100%
						2046764, // 宿命正义饰品智力卷轴 100%
						2046765, // 宿命正义饰品敏捷卷轴 100%
						2046766, // 宿命正义饰品运气卷轴 100%
						//2431690, // 金龙鱼
						2613000, // - 星火单手武器攻击力卷轴 - 为单手武器附加提升攻击力的属性。
						2613001, //- 星火单手武器魔法力卷轴 - 为单手武器附加提升魔力的属性。
						2612010 //- 星火双手武器攻击力卷轴 - 为双手武器附加提升攻击力的属性。
					);
					item = cm.gainGachaponItem(itemList[Math.floor(Math
						.random() * itemList.length)], 1, "充值积分转盘");
				} else {
					var itemList = new Array(
						/*1532098, // 法弗纳荣耀炮 - (无描述)
					1522094, // 法弗纳双风翼弩 - (无描述)
					1492179, // 法弗纳左轮枪 - (无描述)
					1482168, // 法弗纳巨狼之爪 - (无描述)
					1472214, // 法弗纳危险之手 - (无描述)
					1462193, // 法弗纳风翼弩 - (无描述)
					1452205, // 法弗纳追风者 - (无描述)
					1442223, // 法弗纳半月宽刃斧 - (无描述)
					1432167, // 法弗纳贯雷枪 - (无描述)
					1422140, // 法弗纳闪电锤 - (无描述)
					1412135, // 法弗纳战斗切肉斧 - (无描述)
					1402196, // 法弗纳忏悔之剑 - (无描述)
					1382208, // 法弗纳魔冠之杖 - (无描述)
					1372177, // 法弗纳魔力夺取者 - (无描述)
					1362090, // 法弗纳洞察手杖 - (无描述)
					1342082, // 法弗纳急速之刃 - (无描述)
					1332225, // 法弗纳大马士革剑 - (无描述)
					1322203, // 法弗纳戈耳迪锤 - (无描述)
					1312153, // 法弗纳双刃切肉斧 - (无描述)
					1302275, // 法弗纳银槲之剑 - (无描述)
					1242061, // 法弗纳精神之刃 - 鲁塔比斯套装(海盗)专用武器
					1242060, // 法弗纳精神之刃 - 鲁塔比斯套装(飞侠)专用武器
					1232057, // 法弗纳死亡使者 - (无描述)
					1222058, // 法弗纳天使手铳 - (无描述)
					1212063, // 法弗纳魔力源泉杖 - (无描述)
					1072743, // 暴君西亚戴斯靴  150战士
					1072744, // 暴君赫尔梅斯靴  150法师
					1072745, // 暴君凯伦靴      150弓手
					1072746, // 暴君利卡昂靴    150飞侠
					1072747, // 暴君阿尔泰靴    150海盗
					1082543, // 暴君西亚戴斯手套
					1082544, // 暴君赫尔梅斯手套
					1082545, // 暴君凯伦手套
					1082546, // 暴君利卡昂手套
					1072547, // 暴君阿尔泰手套
					1102481, // 暴君西亚戴斯披风
					1102482, // 暴君赫尔梅斯披风
					1102483, // 暴君凯伦披风
					1102484, // 暴君利卡昂披风
					1102485, // 暴君阿尔泰披风
					1132174, // 暴君西亚戴斯腰带
					1132175, // 暴君赫尔梅斯腰带
					1132176, // 暴君凯伦腰带
					1132177, // 暴君利卡昂腰带
					1132178, // 暴君阿尔泰腰带 150级*/

						2049406, // 特殊潜能附加卷轴
						2049303, // 高级装备强化卷轴
						3010068, // 露水椅子
						3010175, // 名画家椅子
						3010360, // 光之骑士椅子
						3010206, // 梦想画家椅子
						3012016, // 情侣糖果椅子
						3010660, // 梦幻公主城堡椅子
						3010661, // 欢乐相框椅子
						3010658, // 夏日西瓜冰椅子
						3010528, // 跑步机椅子
						3012018, // 萌萌育婴摇篮
						3010788, // 巨无霸年夜饭
						3010783, // 蓝色邦尼屋 
						3010811, // 嫩芽椅
						3010814, // 粉丝抱枕椅子
						3010815, // 单身部队海报椅
						3010851, // 夏日沁饮椅子
						3010751, // 鲸鱼椅子
						3012020, // 紫藤花吊篮椅
						3012019, // 爱琴海椅子
						3010832, // 太阳椅子
						3010936, // 青蛙跳楼机
						3015014, // 千钧一发
						3010910, // 艾莉珍椅子
						3015051, // 巨无霸国际巨星
						3015075, // 大自然椅子
						3015060, // 五彩糖罐椅子
						3015054, // 爱之骑士椅
						3015080, // 被蛋卷椅子
						3012027, // 羊羊热气球椅子
						3015130, // 土豪婴儿推车
						3015089, // 训练师庭院椅子
						3015133, // 亚敏下午茶椅
						3015096, // 羊羊幻想牧场椅子
						3015139, // 和谢拉共享下午茶
						3015140, // 和克里姆共享下午茶
						3015015, // 白羊座椅子
						3015016, // 金牛座椅子
						3015017, // 双鱼座椅子
						3015018, // 双子座椅子
						3015019, // 巨蟹座椅子
						3015020, // 狮子座椅子
						3015021, // 天秤座椅子
						3015022, // 天蝎座椅子
						3015023, // 处女座椅子
						3015024, // 射手座椅子
						3015025, // 山羊座椅子
						3015026, // 水瓶座椅子
						3015027, // 安德洛墨达椅子
						3010070, // 巨无霸品克缤
						2431988, //150防具
						3010073, // baby品克缤
						3010073, // baby品克缤
						1402014, // 温度计
						1003172, // 狮心战斗头盔
						1102275, // 狮心战斗披风
						1082295, // 狮心战斗护腕
						1052314, // 狮心战斗锁子甲
						1072485, // 狮心战斗鞋
						1003173, // 龙尾法师帽子
						1102276, // 龙尾法师披风
						1082296, // 龙尾法师手套
						1052315, // 龙尾法师长袍
						1072486, // 龙尾法师鞋
						1003174, // 鹰翼哨兵便帽
						1102277, // 鹰翼哨兵披风
						1082297, // 鹰翼哨兵手套
						1052316, // 鹰翼哨兵服
						1072487, // 鹰翼哨兵鞋
						1003175, // 渡鸦之魂追踪者帽
						1102278, // 渡鸦之魂猎人披风
						1082298, // 渡鸦之魂追踪者手套
						1052317, // 渡鸦之魂追踪者盔甲
						1072488, // 渡鸦之魂追踪者鞋
						1003176, // 鲨齿船长帽
						1102279, // 鲨齿船长披风
						1082299, // 鲨齿船长手套
						1052318, // 鲨齿船长外套
						1072489, // 鲨齿船长鞋
						1432086, // 狮心长枪
						1442116, // 狮心长矛
						1322096, // 狮心震雷
						1422066, // 狮心巨锤
						1402095, // 狮心战刀
						1412065, // 狮心战斧
						1302152, // 狮心弯刀
						1312065, // 狮心勇斧
						1372084, // 龙尾短杖
						1382104, // 龙尾长杖
						1452111, // 鹰翼重弓
						1462099, // 鹰翼重弩
						1332130, // 渡鸦之魂（短刀）
						1472122, // 渡鸦之魂
						1342036, // 精灵角刀
						1492085, // 鲨齿手铳
						1532018, // 鲨齿鹰爪
						1302016, // 鲨齿火炮
						1522018 // 龙翼弩枪
					);
					item = cm.gainGachaponItem(itemList[Math.floor(Math
						.random() * itemList.length)], 1, "充值积分转盘");
				}
				if (item != -1) {
					text += " #b#t" + item + "##k.";
				}
			}
			cm.sendOk(text);
		} else {
			cm.sendOk("xx错误");
		}
		cm.dispose();
	}
}

function getMyPoints() {
	var myRmbPoints = 0;
	var conn = cm.getConnection();
	var sql = "select rmbpoints from accounts where id = ?;";
	var pstmt = conn.prepareStatement(sql);
	pstmt.setString(1, cm.getPlayer().getAccountID());
	var myRPSql = pstmt.executeQuery();
	if (myRPSql.next()) {
		myRmbPoints = myRPSql.getString("rmbpoints");
	} else {
		myRmbPoints = 0;
	}
	myRPSql.close();
	pstmt.close();
	return myRmbPoints
}

function gainPoint(quantity) {
	var myRmbPoints = 0;
	var conn = cm.getConnection();
	var pstmt = conn.prepareStatement("update accounts set rmbpoints=rmbpoints+? where id = ?;");
	pstmt.setInt(1, quantity);
	pstmt.setInt(2, cm.getPlayer().getAccountID());
	pstmt.executeUpdate();
	pstmt.close();
}