/* 技能册 */

var status = -1;
var itemList = Array(
Array(2290016, 10), // 葵花宝典 20
Array(2290017, 10), // 葵花宝典 30
Array(2290018, 10), // 神圣冲击 20
Array(2290019, 10), // 神圣冲击 30
Array(2290020, 10), //  圣域 20
Array(2290021, 10), // 圣域 30
Array(2290024, 10), // 神秘瞄准术20
Array(2290025, 10), // 神秘瞄准术30
Array(2290026, 10), // 创世之破 20
Array(2290027, 10), // 创世之破 30
Array(2290028, 10), // 终极无限 20
Array(2290029, 10), // 终极无限 30
Array(2290030, 10), // 美杜莎之眼 20
Array(2290031, 10), // 美杜莎之眼 30
Array(2290032, 10), // 链环闪电 20
Array(2290033, 10), // 链环闪电 30
Array(2290034, 10), // 进阶祝福20
Array(2290036, 10), // 迷雾爆发20
Array(2290037, 10), // 迷雾爆发30
Array(2290038, 10), // 火魔兽 20
Array(2290039, 10), // 火魔兽 30
Array(2290040, 10), // 天降落星 20
Array(2290041, 10), // 天降落星 30
Array(2290044, 10), // 冰破魔兽 20
Array(2290045, 10), // 冰破魔兽 30
Array(2290046, 10), // 落霜冰破 20
Array(2290047, 10), // 落霜冰破 30
Array(2290048, 10), // 圣光普照 20
Array(2290049, 10), // 圣光普照 30
Array(2290050, 10), // 光芒飞箭 20
Array(2290051, 10), // 光芒飞箭 30
Array(2290052, 10), // 火眼晶晶20
Array(2290053, 10), // 火眼晶晶30
//Array(2290054, 10), // 火眼晶晶20
//Array(2290055, 10), // 火眼晶晶30
Array(2290056, 10), // 神箭手 20
Array(2290057, 10), // 神箭手 30
Array(2290058, 10), // 幻影步20
Array(2290059, 10), // 幻影步30
Array(2290064, 10), // 进阶终极攻击20
Array(2290065, 10), // 进阶终极攻击30
Array(2290066, 10), // 神弩手 20
Array(2290067, 10), // 神弩手 30
Array(2290068, 10), // 幻影步20
Array(2290069, 10), // 幻影步30
Array(2290074, 10), // 一击要害箭 20
Array(2290075, 10), // 一击要害箭 30
Array(2290076, 10), // 假动作 20
Array(2290077, 10), // 假动作 30
Array(2290090, 10), // 一出双击20
Array(2290091, 10), // 一出双击30
Array(2290094, 10), // 烟雾弹 20
Array(2290095, 10), // 烟雾弹 30
Array(2290097, 10), // 潜龙出渊 20
Array(2290098, 10), // 潜龙出渊 30
Array(2290108, 10), // 极速领域 20
Array(2290117, 10), // 金属风暴 20
Array(2290118, 10), // 金属风暴 30
Array(2290126, 10), // 战神之舞 20
Array(2290127, 10), // 战神之舞 30
Array(2290128, 10), // 攻击策略 20
Array(2290132, 10), // 巨熊咆哮 20
Array(2290133, 10), // 巨熊咆哮 30
Array(2290134, 10), // 防守策略 20
Array(2290136, 10), // 钻石星辰 20
Array(2290137, 10), // 钻石星辰 30
Array(2290138, 10), // 战神之盾 20
Array(2290139, 10), // 战神之盾 30
Array(2290140, 10), // 魔龙分身 20
Array(2290141, 10), // 魔龙分身 30
Array(2290142, 10), // 火焰轮 20
Array(2290143, 10), // 火焰轮 30
Array(2290144, 10), // 魔法精通 20
Array(2290145, 10), // 魔法精通 30
Array(2290146, 10), // 熊熊烈火 20
Array(2290147, 10), // 熊熊烈火 30
Array(2290148, 10), // 黑暗迷雾 20
Array(2290149, 10), // 黑暗迷雾 30
Array(2290150, 10), // 灵魂之石 20
Array(2290151, 10), // 玛瑙的祝福 20
Array(2290152, 10), // 玛瑙的祝福 25
Array(2290153, 10), // 双刀风暴 20
Array(2290155, 10), // 镜像分身 20
Array(2290156, 10), // 暗影飞跃斩 20
Array(2290159, 10), // 暴怒刀阵 30
Array(2290160, 10), // 傀儡召唤 30
Array(2290161, 10), // 荆棘 20
Array(2290230, 10), // 致命冲击 20
Array(2290231, 10), // 致命冲击 30
Array(2290232, 10), // 飓风 20
Array(2290233, 10), // 飓风 30
Array(2290234, 10), // 黑暗创世 20
Array(2290235, 10), // 黑暗创世 30
Array(2290236, 10), // 避难所 20
Array(2290238, 10), // 辅助打猎单元 20
Array(2290239, 10), // 辅助打猎单元 30
Array(2290240, 10), // 奥义箭乱舞 20
Array(2290241, 10), // 奥义箭乱舞 30
Array(2290242, 10), // 音速震波 20
Array(2290243, 10), // 音速震波 30
Array(2290275, 10), // 战争机器：泰坦 20
Array(2290276, 10), // 战争机器：泰坦 30
Array(2290277, 10), // 金属机甲：导弹战车 20
Array(2290278, 10), // 金属机甲：导弹战车 30
Array(2290279, 10), // 机器人工厂：RM1 20
Array(2290280, 10), // 机器人工厂：RM1 30
Array(2290281, 10), // 放大器：AF-11 20
Array(2290282, 10), // 激光爆破 20
Array(2290283, 10), // 激光爆破 30
Array(2290284, 10), // 卫星防护 20
Array(2290290, 10), // 进阶终极攻击20
Array(2290291, 10), // 进阶终极攻击30
Array(2290292, 10), // 黑暗穿刺20
Array(2290293, 10), // 黑暗穿刺30
Array(2290322, 10), // 加农火箭炮20
Array(2290323, 10), // 加农火箭炮30
Array(2290324, 10), // 诺特勒斯战舰20
Array(2290325, 10), // 诺特勒斯战舰30
Array(2290326, 10), // 海盗精神20
Array(2290327, 10), // 海盗精神30
Array(2290329, 10), // 超级猴子魔法20
Array(2290330, 10), // 超级猴子魔法20
Array(2290331, 10), // 集中炮击20
Array(2290332, 10), // 集中炮击30
Array(2290333, 10), // 极限燃烧弹20
Array(2290334, 10), // 极限燃烧弹30
Array(2290340, 10), // 伊师塔之环 20
Array(2290341, 10), // 伊师塔之环 30
Array(2290342, 10), // 传说之矛 20
Array(2290343, 10), // 闪电刀刃 20
Array(2290344, 10), // 闪电刀刃 30
Array(2290345, 10), // 古老意志 20
Array(2290346, 10), // 古老意志 30
Array(2290347, 10), // 双弩枪专家 20
Array(2290348, 10), // 双弩枪专家 30
Array(2290349, 10), // 防御突破 20
Array(2290354, 10), // 恶魔爆炸 20
Array(2290355, 10), // 恶魔爆炸 30
Array(2290356, 10), // 恶魔冲击波 20
Array(2290357, 10), // 恶魔冲击波 30
Array(2290358, 10), // 鬼泣 20
Array(2290361, 10), // 黑暗变形 20
Array(2290362, 10), // 黑暗变形 30
Array(2290363, 10), // 黑暗束缚 20
Array(2290364, 10), // 进阶精准武器 20
Array(2290365, 10), // 进阶精准武器 30
Array(2290366, 10), // 皮肤硬化 20
Array(2290367, 10), // 皮肤硬化 30
Array(2290656, 10), // 闪电反击 20
Array(2290657, 10), // 闪电反击 30
Array(2290658, 10), // 晨星坠落 20
Array(2290659, 10), // 晨星坠落 30
Array(2290660, 10), // 启示录 20
Array(2290661, 10), // 启示录 30
Array(2290662, 10), // 绝对死亡 20
Array(2290663, 10), // 绝对死亡 30
Array(2290664, 10), // 黑暗高潮 20
Array(2290665, 10), // 黑暗高潮 30
Array(2290666, 10), // 黑暗巫术 20
Array(2290667, 10), // 黑暗巫术 30
Array(2290668, 10), // 魔法精通 20
Array(2290669, 10), // 魔法精通 30
Array(2290739, 10), // 怒雷屠龙斩 20
Array(2290740, 10), // 怒雷屠龙斩 30
Array(2290741, 10), // 天空剑影 20
Array(2290742, 10), // 天空剑影 30
Array(2290743, 10), // 进阶剑刃之壁 20
Array(2290744, 10), // 进阶剑刃之壁 30
Array(2290745, 10), // 无敌之勇 20
Array(2290746, 10), // 无敌之勇 30
Array(2290747, 10), // 进阶精准剑 20
Array(2290748, 10), // 进阶精准剑 30
Array(2290751, 10), // 强健护甲 20
Array(2290752, 10), // 剑气突袭 20
Array(2290753, 10), // 恶魔之息 20
Array(2290763, 10), // 原始之吼 20
Array(2290764, 10), // 原始之吼 30
Array(2290765, 10), // 三位一体 20
Array(2290766, 10), // 三位一体 30
Array(2290767, 10), // 大地冲击波 20
Array(2290768, 10), // 大地冲击波 30
Array(2290769, 10), // 灵魂共鸣 20
Array(2290770, 10), // 灵魂共鸣 30
Array(2290771, 10), // 灵魂凝视 20
Array(2290772, 10), // 灵魂凝视 30
Array(2290773, 10), // 灵魂手铳手 20
Array(2290774, 10), // 灵魂手铳手 30
Array(2290775, 10), // 亲和Ⅳ 20
Array(2290776, 10), // 亲和Ⅳ 30
Array(2290894, 10), // 超越：处决 20
Array(2290895, 10), // 超越：处决 30
Array(2290896, 10), // 追击盾 20
Array(2290897, 10), // 追击盾 30
Array(2290898, 10), // 破甲 20
Array(2290899, 10), // 破甲 30
Array(2290900, 10), // 血腥禁锢 20
Array(2290901, 10), // 惊天之力 20
Array(2290902, 10), // 惊天之力 30
Array(2290903, 10), // 防御专精 20
Array(2290904, 10), // 防御专精 30
Array(2290905, 10), // 进阶亡命剑精通 20
Array(2290906, 10), // 进阶亡命剑精通 30
Array(2290907, 10), // 强化超越 20
Array(2290916, 10), // 刀锋之舞 20
Array(2290917, 10), // 刀锋之舞 30
Array(2290918, 10), // 聚能脉冲炮 20
Array(2290919, 10), // 聚能脉冲炮 30
Array(2290920, 10), // 全息力场 20
Array(2290921, 10), // 全息力场 30
Array(2290922, 10), // 神秘代码 20
Array(2290923, 10), // 神秘代码 30
Array(2290924, 10), // 攻击矩阵 20
Array(2290925, 10), // 攻击矩阵 30
Array(2290926, 10), // 瞬间闪避 20
Array(2290927, 10), // 瞬间闪避 30
Array(2290928, 10), // 尖兵专家 20
Array(2290929, 10), // 尖兵专家 30
Array(2290635, 10), // 连射 20
Array(2290636, 10), // 连射 30
Array(2290378, 10), // 进阶终极攻击20
Array(2290379, 10), // 进阶终极攻击30
Array(2291022, 10), // 长杖专家 20
Array(2291023, 10), // 长杖专家 30
Array(2290411, 10), // 进阶终极攻击30
Array(2290412, 10), // 暗器专家 20
Array(2290413, 10), // 暗器专家 30
Array(2290414, 10), // 突然袭击 20
Array(2290415, 10), // 突然袭击 30
Array(2290416, 10), // 四连镖 20
Array(2290417, 10), // 四连镖 30
Array(2290418, 10), // 黑暗祝福 20
Array(2290419, 10), // 黑暗祝福 30
Array(2290420, 10), // 模糊领域 20
Array(2290421, 10), // 模糊领域 30
Array(2290422, 10), // 突然袭击 20
Array(2290423, 10), // 突然袭击 30
Array(2290424, 10), // 短刀专家 20
Array(2290425, 10), // 短刀专家 30
Array(2290426, 10), // 侠盗本能 20
Array(2290427, 10), // 重装碾压 20
Array(2290428, 10), // 诺特勒斯战舰 20
Array(2290429, 10), // 诺特勒斯战舰 30
Array(2290430, 10), //  能量爆炸 20
Array(2290431, 10), // 能量爆炸 30
Array(2290432, 10), // 蛇拳 20
Array(2290433, 10), // 蛇拳 30
Array(2290434, 10), // 激怒拳 20
Array(2290435, 10), // 激怒拳 30
Array(2290436, 10), // 船长的威严 20
Array(2290437, 10), // 船长的威严 30
Array(2290438, 10), // 海盗气魄 20
Array(2290439, 10), // 齐射 20
Array(2290440, 10), // 齐射 30
Array(2290441, 10), // 爆头 20
Array(2290442, 10), // 爆头 30
Array(2290443, 10), // 诺特勒斯战舰 20
Array(2290444, 10), // 诺特勒斯战舰 30
Array(2290512, 10), // 蓝光连击 20
Array(2290513, 10), // 蓝光连击 30
Array(2290514, 10), // 幻影印技天赋 20
Array(2290515, 10), // 幻影印技天赋 30
Array(2290516, 10), // 黑色秘卡 20
Array(2290517, 10), // 圣歌祈祷 20
Array(2290518, 10), // 圣歌祈祷 30
Array(2290519, 10), // 卡片风暴 20
Array(2290520, 10), // 卡片风暴 30
Array(2290521, 10), // 手杖专家 20
Array(2290522, 10), // 手杖专家 30
Array(2290523, 10), // 灵魂偷取 20
Array(2290589, 10), // 进阶精准剑20
Array(2290590, 10), // 进阶精准剑30
Array(2290591, 10), // 进阶灵魂盾 20
Array(2290592, 10), // 进阶灵魂盾 30
Array(2290593, 10), // 灵魂之怒 20
Array(2290594, 10), // 灵魂之怒 30
Array(2290595, 10), // 灵魂抨击 20
Array(2290596, 10), // 灵魂抨击 30
Array(2290597, 10), // 闪耀爆炸 20
Array(2290598, 10), // 闪耀爆炸 30
Array(2290599, 10), // 终极打击 20
Array(2290560, 10), // 终极打击 30
Array(2290689, 10), // 暴怒对战 20
Array(2290690, 10), // 暴怒对战 30
Array(2291025, 10), // 稳如泰山 20
Array(2291026, 10), // 稳如泰山 30
Array(2291027, 10), // 烈焰冲斩 20
Array(2291028, 10), // 烈焰冲斩 30
Array(2291029, 10), // 虚空元素 20
Array(2291030, 10), // 虚空元素 30
Array(2291031, 10), // 守护之神 20
Array(2291032, 10), // 圣骑士专家 20
Array(2291033, 10), // 圣骑士专家 30
Array(2291034, 10), // 神枪降临 20
Array(2291035, 10), // 神枪降临 30
Array(2291036, 10), // 龙之献祭 20
Array(2291037, 10), // 龙之献祭 30
Array(2291038, 10), // 重生契约 20
Array(2291039, 10), // 重生契约 30
Array(2291040, 10), // 进阶精准武器 20
Array(2291041, 10), // 进阶精准武器 30
Array(2291042, 10), // 炙焰笼罩 20
Array(2291043, 10), // 炙焰笼罩 30
Array(2291044, 10), // 极冻吐息 20
Array(2291045, 10), // 极冻吐息 30
Array(2291046, 10), // 寒霜爆晶 20
Array(2291047, 10), // 寒霜爆晶 30
Array(2291048, 10), // 箭矢炮盘 20
Array(2291049, 10), // 箭矢炮盘 30
Array(2291050, 10), // 骤雨箭矢 20
Array(2291051, 10), // 骤雨箭矢 30
Array(2291052, 10), // 防甲穿透 20
Array(2291054, 10), // 神箭幻影 20
Array(2291055, 10), // 神箭幻影 30
Array(2291056, 10), // 穿透箭 20
Array(2291057, 10), // 穿透箭 30
Array(2291058, 10), // 弱点捕捉 20
Array(2291059, 10), // 突然袭击 20
Array(2291060, 10), // 突然袭击 30
Array(2291061, 10), // 决战之巅 20
Array(2291062, 10), // 暗杀 20
Array(2291063, 10), // 暗杀 30
Array(2291064, 10), // 终极斩 20
Array(2291065, 10), // 终极斩 30
Array(2291066, 10), // 幽灵一击 20
Array(2291067, 10), // 幽灵一击 30
Array(2291068, 10), // 进阶狂蛮撞击 20
Array(2291069, 10), // 进阶神剑陨落 20
Array(2291070, 10), // 进阶旋卷切割 20
Array(2291071, 10), // 进阶圆月旋风 20
Array(2291072, 10), // 进阶狂转回旋 20
Array(2291073, 10), // 进阶狂转回旋 30
Array(2291074, 10), // 进阶旋跃斩 20
Array(2291075, 10), // 进阶旋跃斩 30
Array(2291076, 10), // 进阶地裂山崩 20
Array(2291077, 10), // 进阶地裂山崩 30
Array(2291078, 10), // 进阶暴风旋涡 20
Array(2291079, 10), // 进阶暴风旋涡 30
Array(2291112, 10), // 进阶圆月旋风 30
Array(2291116, 10), // 爆流拳 20
Array(2291117, 10), // 爆流拳 30
Array(2291118, 10), // 鬼斩 20
Array(2291119, 10), // 鬼斩 30
Array(2291120, 10), // 四魂刻印 20
Array(2291121, 10), // 分魂斩 20
Array(2291122, 10), // 火狐灵 20
Array(2291123, 10), // 火狐灵 30
Array(2291124, 10), // 精灵凝聚第4招 20
Array(2291125, 10), // 精灵凝聚第4招 30
Array(2291126, 10), // 高级拳甲修炼 20
Array(2291127, 10), // 高级拳甲修炼 30
Array(2291128, 10), // 洞察之眼 20
Array(2291138, 10), // 暴风箭雨 20
Array(2291139, 10), // 暴风箭雨 30
Array(2291141, 10), // 磁性船锚 20
Array(2291144, 10), // 暮光祝福 20
Array(2291145, 10), // 暮光祝福 30
Array(2291147, 10), // 弹仓扩展 20
Array(2291149, 10), // 弹仓扩展 30
Array(2291151, 10), // 鬼泣 30
Array(2291152, 10) // 血腥禁锢 30
);
var selectedItem = -1;
var selectedCost = -1;
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#亲爱的#r#h ##k您好，请选择您希望购买的技能册：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k #b需要 #r" + itemList[i][1] + " #k#b苹果#k#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1];
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 苹果\r\n\r\n#b另外您要支付我 2000万 冒险币才能获得。");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getMeso() >= 20000000 && cm.getPlayerPoints() >= selectedCost) {
	    var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "技能书商店", 3, true);
            if (cm.gachaponItem != -1) {
		//cm.gainItem(selectedItem,1);
                cm.gainMeso(-20000000);
				cm.gainPlayerPoints(-selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多苹果或冒险币。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k \r\n需要 #r" + selectedCost + "#k 苹果 附加 2000万 冒险币。");
        }
        cm.dispose();
    }
}