var aa ="#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#";

function start() {
   if (cm.haveItem(2430154) < 1) {
	cm.gainItem(2430154, 1);
	cm.sendOk(""+aa+"\r\n\r\n #b请从左边的门出去领取#r【新手玩家奖励】#b。送您一份新手说明书。请妥善保管。切勿扔掉。请看完新手说明书。看完后您才能充分的对本冒险岛世界的了解，对于新手来说的您很有帮助的。请勿丢弃该说明书，丢弃后是无 法再次获得。这样您就不可以领取： #r【200级每日福利】");
	cm.dispose();
   } else {
	cm.sendOk(""+aa+"\r\n\r\n\t#d您已经在我这领取过，已经拥有请勿重复领取#k\r\n\r\n #b请从左边的门出去领取#r【新手玩家奖励】#b。送您一份新手说明书。请妥善保管。切勿扔掉。请看完新手说明书。看完后您才能充分的对本冒险岛世界的了解，对于新手来说的您很有帮助的。请勿丢弃该说明书，丢弃后是无 法再次获得。这样您就不可以领取： #r【200级每日福利】");
	cm.dispose();
    }
}