

var status = -1;
var beauty = 0;
var hair_Colo_new;
var facetype;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        cm.sendSimple("这里是#r会员#k整形医院，只要你有美发卡，或者染发卡，你就把头发交给我吧。选择你想做的事情吧。\r\n#b#L0#更换发型(使用#z5150052#)#l\r\n#L1#头发染色(使用#z5151036#)#l\r\n#L2#脸部整形(使用#z5152057#)#l");
    } else if (status == 1) {
        if (selection == 0) {//更换发型
            var hair = cm.getPlayerStat("HAIR");
            hair_Colo_new = [];
            beauty = 1;
            if (cm.getPlayerStat("GENDER") == 0) {//男生
                hair_Colo_new = [40050, 40390, 40350, 36930, 35270, 35350, 35330, 35360, 35470, 35550, 35430, 35460, 35510, 32500, 36300, 36620, 33260, 36730, 33550, 30620, 36440, 30170, 34680, 36240, 36690,36070,36010,36530,30650,33770,30630,30800,33320,36460,33290,33220,30680,36410,33940,30280,34130,30100,33370,34700,33960,33200,31280,33450,33330,30990,33740,33710,30380,36370,33240,30830,33610,33480,33980,33080,33120,33130,36020,33340,36680,33140,36050, 33430,33820,33180,33150,30210,33580,30810,36110,30660,30490,36770,36920,36490,36990,36740,36950,36890,36720,36700,36580,33380,33390,36720,31650,36180,33160,35220,35120,35090,36810,36820,36990,36490,32490,36230,33970,33520,36480,36150,36170,36190,36180,36220,36370,36350,33692,35180];
            } else {
                hair_Colo_new = [41150, 41420, 41360, 41400, 41080, 38930, 38940, 38790, 37227, 36590, 36514, 38520, 38730, 37930, 38500, 38420, 38010, 38100, 38390, 38470, 38480, 38540, 38600, 38490, 38680, 38580, 38610, 35600, 38640, 38700, 38630, 38790, 38810, 38710, 37020, 34560, 34330, 34860, 34890, 37580, 34770, 37310,37410,34640,34900,31930,34060,37420,34750,34310,33680,34510,37190,31540,34430,37720,34850,34470,34970,31640,37180,34840,34670,31710,37060,31760,37090,34260,37200,34870,37380,37010,34480,37230,34630,34610,37300,34780,37510,34790,37530,37610,34450,34410,37540,31900,34250,34230,37320,37550,34950,34400,37210,37250,37460,32140,34180,34210,34220,37000,37760,37340,37280,34590,34600,34730,34800,34960,34810,37560,31990,34720,36400,37030,34940,37440,37520,37680,34710,31130,37700,37290,37920,37860,38070,37900,37830,37630,37950,37690,37810,37880,37710,38240,38151,37980,37970,37820,34840,37350,37640,38020]; //37890,
            }
            for (var i = 0; i < hair_Colo_new.length; i++) {
                hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
            }
            cm.askAvatar("我可以帮你换成全新的发型。你厌倦了现在的发型了吗？只要你有#b万能会员卡#k，我就可以帮你更换发型。请慢慢挑选自己喜欢的发型～", hair_Colo_new, 5150052);
        } else if (selection == 1) {
            var currenthaircolo = Math.floor((cm.getPlayerStat("HAIR") / 10)) * 10;
            hair_Colo_new = [];
            beauty = 2;
            for (var i = 0; i < 8; i++) {
                hair_Colo_new[i] = currenthaircolo + i;
            }
            cm.askAvatar("我们可以为你改变头发的颜色。是不是已经厌倦了头发的颜色啊？如果你有#b万能会员卡#k，我就可以给你染发，慢慢挑选你喜欢的颜色吧！", hair_Colo_new, 5151036);
	} else if (selection == 2) {
	    var face = cm.getPlayerStat("FACE");
		hair_Colo_new = [];
		beauty = 3;
        	if (cm.getPlayerStat("GENDER") == 0) {
            	facetype = [20000, 20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20035, 20036, 20037, 20038, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20053, 20055, 20056, 20057, 20058, 20059, 20060, 20061, 20062, 20063, 20064, 20065, 20066, 20067, 20068, 20069];
        } else {
            	facetype = [24179, 24124, 24171, 21000, 21001, 21002, 21003, 21004, 21005, 21006, 21007, 21008, 21009, 21010, 21011, 21012, 21013, 21014, 21015, 21016, 21017, 21018, 21019, 21020, 21021, 21022, 21023, 21024, 21025, 21026, 21027, 21028, 21029, 21030, 21031, 21033, 21034, 21035, 21036, 21038, 21041, 21042, 21043, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21052, 21053, 21054, 21055, 21056, 21057, 21058, 21059, 21060, 21061, 21062, 21063, 21064, 21077, 21075, 21078];
        }
        for (var i = 0; i < facetype.length; i++) {
            facetype[i] = facetype[i] + face % 1000 - (face % 100);
        }
        cm.askAvatar("可以让你的面容焕然一新…不想让你的面容变一变吗？ 只需要#b万能会员卡#k就可以给你做整形手术.怎么样~慢慢挑选一下你想要的面容~", facetype, 5152057);
        }
    } else if (status == 2) {
        if (beauty == 1) {
	    if (cm.getPlayer().getCSPoints(1) <= 999) {
		cm.sendOk("你没有1000点卷，我无法给你换发型.");
		cm.dispose();
            } else if (cm.setAvatar(5150052, hair_Colo_new[selection]) == 1) {
		cm.gainNX(-1000);
                cm.sendOk("理发好了，怎么样？看看你的新发型吧！");
		cm.dispose();
            } else {
                cm.sendOk("你没有#i5150052# #z5150052#，我无法给你换发型.");
		cm.dispose();
            }
        } else if (beauty == 2) {
            if (cm.setAvatar(5151036, hair_Colo_new[selection]) == 1) {
                cm.sendOk("好了，让朋友们赞叹你的新发色吧！");
		cm.dispose();
            } else {
                cm.sendOk("你没有#i5151036# #z5151036#，我无法给你染头发。");
		cm.dispose();
            }
	} else if (beauty == 3) {
           if (cm.setAvatar(5152057, facetype[selection]) == 1) {
		cm.sendOk("好了,你的朋友们一定认不出来是你了!");
		cm.dispose();
           } else {
            	cm.sendOk("你没有#i5152057# #z5152057#，我不能给你做手术。");
		cm.dispose();
        }
        cm.dispose();
    }
}
}