
var status = -1;
var text;
var sel;
var rmb;
var aaa ="#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
//"#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";

// 每个礼包所需的充值金额
var condition = new Array(1, 10, 30, 50, 100, 200, 300, 500, 800, 1000, 1500, 2000, 3000, 5000);
var reward = new Array(// 礼包编号、道具id、数量
					// 礼包1
					Array(1, 1113077, 1),
					Array(1, 3010118, 1),
					Array(1, 2340000, 2), // 祝福卷
					Array(1, 2049116, 2), // 强化混沌卷

					// 礼包2
					Array(2, 5062002, 20),  // 高级神奇魔方
					Array(2, 5064000, 10), // 防暴卷
					Array(2, 2340000, 5),
					Array(2, 3010044, 1), // 同一红伞下
					Array(2, 4001785, 4), // 定居金500万

					// 礼包3
					Array(3, 5062002, 50), // 高级神奇魔方
					Array(3, 5064000, 15), // 防暴卷
					Array(3, 2340000, 10), // 祝福卷
					Array(3, 2049116, 4), // 强化混沌
					Array(3, 3010535, 1), // 海蓝天鹅绒椅子
					Array(3, 3010038, 1), // 空气沙发
					Array(3, 5390004, 30), // 新年庆祝喇叭
					Array(3, 4001785, 8), // 定居金500

					// 礼包4
					Array(4, 5062002, 70),					
					Array(4, 5064000, 20),
					Array(4, 2340000, 15),
					Array(4, 3010678, 1),
					Array(4, 2049116, 5), // 强化混沌
					Array(4, 5073000, 60), // 心脏高级喇叭
					Array(4, 5390004, 60), // 新年庆祝喇叭
					Array(4, 4001715, 1), // 定居金1E金币

					// 礼包5
					Array(5, 3994417, 1), // 红色蜡笔
					
					//Array(5, 3010417, 1),
					//Array(5, 3994417, 1),
					Array(5, 5062002, 80), // 高级神奇魔方
					Array(5, 5064000, 25), //防暴卷
					Array(5, 4001715, 2), // 定居金1E 金币
					Array(5, 2340000, 20), // 祝福卷
					Array(5, 2049137, 5), // 惊人正义
					Array(5, 5073000, 80), //心脏喇叭
					Array(5, 5390004, 80), // 新年喇叭
					Array(5, 5390018, 2), // 赤兔马喇叭
					Array(5, 3010830, 1), // 天王星椅子

					// 礼包6
					
					Array(6, 3994418, 1), // 橙色蜡笔
					
					Array(6, 5062002, 100), // 高级魔方	
					Array(6, 5062500, 50), // 大师附加神奇魔方
					Array(6, 5064000, 30),
					Array(6, 4310036, 800),
					Array(6, 2049116, 10), //强化混沌
					//Array(6, 5530360, 1), // 特殊附加潜能 
					Array(6, 2340000, 30), //祝福卷 
					Array(6, 2049137, 8), //惊人正义
					Array(6, 5390004, 100),	//新年喇叭
					Array(6, 5390018, 30), //赤兔喇叭
					Array(6, 3010827, 1), //火星椅子
					Array(6, 4001715, 2), // 定居金1 E

					// 礼包7
					//Array(7, 2432069, 1),
					Array(7, 3994418, 1), // 橙色蜡笔
					Array(7, 3994417, 1), // 红色蜡笔 
			        Array(7, 5062002, 100), // 高级魔方
					Array(7, 5062500, 80),
					Array(7, 5064000, 35), // 防暴
					Array(7, 3010831, 1), // 海王星椅子
					Array(7, 4310036, 8000), // 征服币
					Array(7, 2340000, 35), //祝福
					Array(7, 2049137, 5), // 惊人正义
					Array(7, 5390004, 100), //新年喇叭
					Array(7, 5390018, 35), //赤兔喇叭
					
					// 礼包8
					//Array(8, 2431938, 1),
					Array(8, 2432069, 1), // 暴君防具箱子
					//Array(8, 3010876, 1),
					//Array(8, 2430226, 1),
					//Array(8, 3994417, 1),
					//Array(8, 3994418, 1),
					//Array(8, 5530360, 2), // 特殊附加潜能
					Array(8, 3994419, 1), // 黄色蜡笔
					Array(8, 5062002, 100), // 高级魔方
					Array(8, 5062500, 100), //大师附加魔方
					Array(8, 5064000, 40), // 防暴
					Array(8, 2049116, 20), // 强化混沌
					Array(8, 3010417, 1), // 巨无霸企鹅王椅子
					Array(8, 1190302, 1), // 水晶枫叶徽章 
					Array(8, 2340000, 40), // 祝福卷
					Array(8, 2049137, 10), // 惊人正义
					Array(8, 5390004, 100), // 新年喇叭
					Array(8, 5390018, 50), //赤兔喇叭
					
					// 礼包9
					Array(9, 2432069, 1), // 暴君箱子
					Array(9, 3994417, 1), // 红色蜡笔
					Array(9, 3994418, 1), // 黄色蜡笔
					Array(9, 3994419, 1), // 橙色蜡笔
					//Array(9, 3994420, 1),
					//Array(9, 3994421, 1),
					Array(9, 5062002, 100), // 高级魔方
					Array(9, 5062500, 100), // 大师附加
					Array(9, 2049116, 50), // 强化混沌 
					Array(9, 2049750, 5), // S级潜能80%
					Array(9, 2340000, 50), // 祝福
					Array(9, 5064000, 50), // 防暴
					Array(9, 2049124, 5), //正向混沌
					Array(9, 2049137, 20), // 惊人正义
					Array(9, 3010416, 1), // 巨无霸白雪人椅子
					//Array(9, 2430865, 1, 60), //VIP
					Array(9, 5390018, 100), //赤兔喇叭
					Array(9, 4001716, 1), // 定居金10E
					
					// 礼包10
					//Array(10, 2046829, 10),
					//Array(10, 2431991, 1),
					Array(10, 2432069, 1), //暴君箱子
					Array(10, 2049405, 1), //真觉冒险之心专用潜能卷
					Array(10, 3994417, 1), // 红蜡笔
					Array(10, 3994418, 1), //橙色蜡笔
					Array(10, 3994419, 1), // 黄蜡笔
					Array(10, 3994420, 1), //绿色蜡笔
					Array(10, 3994421, 1), // 青色蜡笔
					Array(10, 3994422, 1), //蓝色蜡笔
					Array(10, 5062002, 200), //高级魔方
					Array(10, 5062500, 200), // 大师附加
					Array(10, 5064000, 50), //防暴
					Array(10, 2340000, 50), // 祝福
					Array(10, 2049116, 40), // 强化混沌
					Array(10, 2049124, 5), //正向混沌
					Array(10, 2049137, 30), // 惊人正义
					Array(10, 5390018, 100), // 赤兔马喇叭
					Array(10, 4001716, 2), //定居金10E
					Array(10, 1142796, 1), // 官方认证男神
					Array(10, 3010832, 1), // 太阳椅子

					// 11
					Array(11, 2431987, 1), // 神秘箱子
					Array(11,2432069, 2), // 暴君箱子
					//Array(11, 2049137, 30),
					//Array(10, 2431991, 1),
					Array(11, 2049405, 5), // 真觉冒险心专用潜能卷
					//Array(11, 3994417, 1),
					Array(11, 3994418, 2), //  橙色蜡笔
					Array(11, 3994417, 2), // 红色蜡笔
					Array(11, 3994419, 2), // 黄色蜡笔
					Array(11, 3994420, 2), // 绿色蜡笔
					Array(11, 3994421, 2), // 青色蜡笔
					Array(11, 3994422, 2), //蓝色蜡笔
					Array(11, 5062009, 300), // 超级魔方
					Array(11, 5062500, 300), // 大师附加
					Array(11, 5064000, 100), // 防暴
					Array(11, 2340000, 150), // 祝福
					//Array(11, 4310036, 20000),
					Array(11,3010850, 1), // 潮流评论家椅子
					Array(11,3015087, 1), // 家庭聚餐椅子
					Array(11, 2049137, 60), // 惊人正义
					Array(11, 5390018, 100), // 赤兔喇叭
					Array(11, 4001716, 5), // 定居金10E

					//12
					Array(12, 2431991, 2), //秘密箱子 冒险心
					Array(12, 5530457, 2), // 专属饰品攻击卷
					Array(12, 5530458, 2), // 专属饰品魔力卷
					Array(12, 2432069, 3), // 暴君箱子
					Array(12, 2049405, 3), //   冒险心潜能卷
					Array(12, 3994417, 2), //  红色蜡笔
					Array(12, 3994418, 2), // 橙色蜡笔
					Array(12, 3994419, 2), // 黄色蜡笔
					Array(12, 3994420, 2), // 绿色蜡笔
					Array(12, 3994421, 2), // 青色蜡笔
					Array(12, 3994422, 2), // 蓝色蜡笔
					Array(12, 5062009, 300), // 超级魔方
					Array(12, 4310030, 5000), // 运动币
					Array(12, 5062002, 150),
					Array(12, 5062500, 500), // 大师附加
					Array(12, 2049124, 50), // 正向混沌
					Array(12, 5064000, 200), // 防暴
					Array(12, 2340000, 200), // 祝福
					Array(12, 2049137, 100), // 惊人正义
					Array(12, 4310036, 5000), // 征服币
					Array(12, 2049116, 50), // 强混
					Array(12, 3010423, 1), // 蘑菇椅子
					Array(12, 3010070, 1), // 巨无霸品克宾
					Array(12, 3012024, 1), // 沙滩排球椅子
					Array(12, 3010876, 1), // 行星椅子
					Array(12, 1672027, 1), // 极真心脏
					Array(12, 1142540, 1), // 黄金勋章
					Array(12, 5390018, 200), // 赤兔喇叭
					Array(12, 4001716, 8), // 定居金10

					//13
					//Array(13, 2431938, 1), //法笑纳武器箱子
					Array(13, 2049323, 80),
					Array(13, 5530457, 5), // 专属饰品攻击卷
					Array(13, 5530458, 5), // 专属饰品魔力卷 
					Array(10, 2432069, 4), // 暴君箱子
					Array(13, 2049405, 3), //冒险心潜能卷
					Array(13, 3994420, 3),// 绿色蜡笔
					Array(13, 3994417, 3), // 红色蜡笔
					Array(13, 3994418, 3), // 橙色蜡笔
					Array(13, 3994419, 3), // 黄色蜡笔
					Array(13, 3994421, 3), // 青色蜡笔
					Array(13, 3994422, 3), // 蓝色蜡笔
					Array(13, 4310030, 8000),// 运动币
					Array(13, 5062002, 200), // 高级魔方
					Array(13, 5062500, 500), // 大师附加
					Array(13, 5064000, 300), // 防暴
					Array(13, 2340000, 300),// 祝福
					Array(13, 4310036, 10000), // 征服币
					Array(13, 2049137, 100),// 惊人正义
					Array(13, 1142145, 1), // vip勋章
					Array(13, 1182016, 1), //黄金比德曼徽章
					Array(13, 2049116, 100), //强混
					Array(13, 5062009, 400), //超级魔方
					Array(13, 5390018, 300),//赤兔喇叭
					Array(13, 3010195, 1), // 无价之宝椅子
					Array(13, 3010206, 1), // 梦想画家椅子
					Array(13, 3012009, 1), //梦幻雪晶球
					Array(13, 1142706, 1), //大吉勋章
					Array(13, 3015002, 1), //摩天轮
					Array(13, 3010670, 1), //绝对指环椅子
					//Array(13, 3010696, 1), // 大黄鸭椅子
					Array(13, 4001716, 10),// 定居金10E
					//14
					Array(14, 2432069, 8), // 暴君箱子
					Array(14, 2049323, 200),// 无损
					Array(14, 2431938, 1), // 法笑纳武器箱子
					//Array(14, 2049137, 100),
					//Array(10, 2431991, 1),
					Array(14, 2049405, 10), // 冒险心潜能卷
					Array(14, 3994421, 8), // 青色蜡笔
					Array(14, 3994417, 8), // 红色蜡笔
					Array(14, 3994418, 8), // 橙色蜡笔
					Array(14, 3994419, 8), // 黄色蜡笔
					Array(14, 3994420, 8), // 绿色蜡笔
					Array(14, 3994422, 8), //蓝色蜡笔
					Array(14, 5062002, 800),// 高级魔方
					Array(14, 5062500, 800),// 大师附加
					Array(14, 5064000, 800),// 防暴
					Array(14, 2340000, 800),// 祝福
					Array(14, 5062009, 800), // 超级魔方
					Array(14, 3010660, 1), //梦幻公主城堡
					Array(14, 3010696, 1), // 大黄鸭
					Array(14, 3010955, 1), // 新运金蛋椅子
					Array(14, 3010938, 1), // 异界血腥女王椅子
					Array(14, 3010821, 1), // 童年玩具椅子
					Array(14, 3015009, 1), // 小苹果椅子
					Array(14, 1142788, 1), // 进击巨人勋章
					Array(14, 3012022, 1), // 小火车椅子
					Array(14, 3010936, 1), //青蛙跳楼椅子
					Array(14, 2049116, 500), // 强混
					Array(14, 4310036, 20000),// 征服币
					Array(14, 5530457, 10), //专属饰品攻击
					Array(14, 5530458, 10), //专属饰品魔力
					Array(14, 2049137, 500),// 惊人正义
					Array(14, 1142593, 1), // 13个星星勋章
					Array(14, 3015014, 1), //千君一发椅子
					Array(14, 5390018, 500),// 赤兔喇叭
					Array(14, 4001716, 20)
					);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0)
	{
		cm.dispose();
		return;
	}
	if (mode == 1)
	{
		status++;
	} else {
		status--;
	}

	rmb = cm.getTotalRMB();
	var curlevel = -1;

	if (status == 0) {
		text = head + "您累计充值金额为： #r" + rmb + "#k 元\r\n\r\n";
		for (var i = 1; i <= condition.length; i++) {
			text += "#b#L" + i + "#"+aaa+" 累计充值 #r" + condition[i-1] + " #b元奖励";
			if (cm.getBossLogAcc("累计充值礼包" + i) == -1) {
				text += "(已领取)";
				curlevel = curlevel == -1 ? i : curlevel;
			}
			text += "#l\r\n";
		}
		text += "#k";
		cm.sendSimple(text);
	} else if (status == 1) {
		sel = selection;
		text = head + "#e#r- 累计充值" + condition[selection - 1] + "元奖励 -#k#n\r\n\r\n";
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == selection) {
				text += "#i" + reward[i][1] + "# #z" + reward[i][1] + "#[" + reward[i][2] + "个]\r\n";
			}
		}
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (cm.getBossLogAcc("累计充值礼包" + sel) == -1) {
			cm.sendOk(head + "这个礼包您已经领取过了");
			cm.dispose();
			return;
		}
		if (rmb < condition[sel-1]) {
			cm.sendOk("累计充值金额不足，无法领取。");
			cm.dispose();
			return;
		}
		var rewardlist = new Array();
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == sel) {
				if (reward[i][3]==null)
					reward[i][3]=-1;
				rewardlist.push(new Array(reward[i][1], reward[i][2], reward[i][3]));
			}
		}
		if (!cm.canHoldSlots(rewardlist.length)) {
			cm.sendOk(head + "包裹空间不足，请确保包裹每个栏位有至少 " + rewardlist.length + " 格空间");
			cm.dispose();
			return;
		}
		for (var i = 0; i < rewardlist.length; i++) {
			if (rewardlist[i][0]==2430865) {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1], rewardlist[i][2]);
			} else {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1]);
			}
		}
		cm.setBossLogAcc("累计充值礼包" + sel, -2);
		cm.playerMessage(1, "领取成功！");
		cm.channelMessage(0x18, "『累计充值奖励』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了累计充值 " + condition[sel-1] + " 元奖励。");
		cm.dispose();
	}
}